000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    FNINT01.
000300 AUTHOR.        MARK OSBORN ROB TITTLE.
000400 INSTALLATION.  IBM - SANTA TERESA LABORATORY.
000500 DATE-WRITTEN.  NOVEMBER 1990
000600 DATE-COMPILED.
000700 SECURITY.      PROPERTY OF IBM CORPORATION (INTERNAL USE ONLY).
000800*LANGUAGE.    COBOL/370  V1 R1.
000900*             LE/370     V1 R1.
001000******************************************************************
001100***                                                            ***
001200*** Function:                                                  ***
001300***    INTEGER                                                 ***
001400***      The INTEGER function returns an integer that is       ***
001500***      =<  of argument-1. This is an integer function        ***
001600***                                                            ***
001700*** Restrictions:                                              ***
001800***    None                                                    ***
001900***                                                            ***
002000***  Expected results:                                         ***
002100***  <>>>>FLOW MSG: FNINT01 BEGIN EXECUTION
002200***  FNINT01 SUCCESS
002300***  <>>>>FLOW MSG: FNINT01 END EXECUTION
002400***   failed  0000
002500***   passed  0647
002600***   total tests 0647
002700***                                                            ***
002800*** Files used:                                                ***
002900***   Input:  Dummy output and sort files.                     ***

003000*** Matrix:                                                    ***
003100***        FNINT MATRIX                                        ***
003200*** Structure:                                                 ***
003300***                                                            ***
003400***   ___ PROGRAM FNINT01                                      ***
003500***  |                                                         ***
003600***  |                                                         ***
003700***  |___ End Program MAIN                                     ***
003800***                                                            ***
003900*** Change activities:                                         ***
004000***  Date     Description                      Programmer      ***
      ***  Apr 95    Modified ORD expected value for    MZS          ***
      ***            workstation (ASCII)                             ***
      ***            Max 15 digits precision floating point          ***
      ***            Present-value (-.9 1919) = 19190                ***
004300******************************************************************
004400 ENVIRONMENT DIVISION.
004500 CONFIGURATION SECTION.
004600 SOURCE-COMPUTER. IBM-370.
004700 OBJECT-COMPUTER. IBM-370.
004800 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
005000     SELECT SD-FILE  ASSIGN TO temp1.
005100     SELECT OUTD-FILE ASSIGN TO temp2.
005200 DATA DIVISION.
005300 FILE SECTION.
005400 SD SD-FILE
005500     RECORD CONTAINS 80 CHARACTERS.
005600 01 sd-record.
005700     05 sd-key     PIC 99.
005800     05 sd-field   COMP-2.
005900     05 FILLER     PIC X(70).
006800
006900 WORKING-STORAGE SECTION.

       01 ITRAP-VARS.
          05 PGM-ID   PIC X(10)  VALUE "FNINT01".
          05 PGM-STS  PIC X      VALUE "F".

       01  SORT-CORE-SIZE  PIC 9(9).
       01  SORT-FILE-SIZE  PIC 9(9).
       01  SORT-MODE-SIZE  PIC 9(9).
       01  SORT-MESSAGE    PIC X(8).
       01  TALLY           PIC 9(9).
007000
007100 01  MULTI-ARRAY.
007200     10 FILLER  OCCURS 4 TIMES.
007300        15 FILLER  OCCURS 4 TIMES.
007400           20 FILLER  OCCURS 4 TIMES.
007500              25 FILLER  OCCURS 4 TIMES.
007600                30 FILLER  OCCURS 4 TIMES.
007700                  35 FILLER  OCCURS 4 TIMES.
007800                    40 FILLER  OCCURS 4 TIMES.
007900                      49 ar-multi COMP-2.
008000
008100 01  MULTI3-ARRAY.
008200     10 FILLER  OCCURS 4 TIMES.
008300        20 FILLER  OCCURS 4 TIMES.
008400             30 FILLER  OCCURS 4 TIMES.
008500                   49 ar-multi3 PIC +99.99E+99  DISPLAY.
008600 01  actual      COMP-2.
008650 01  expected    COMP-2.
008660 01  posit1      PIC 9(15)V99.
008700 01  posit2      PIC 99V9(15).
008800
008900 01 var-table.
009000    02  FILLER OCCURS 2 TO 8  TIMES DEPENDING ON Sb.
009100        03  var-val     COMP-2.
009200
009300 01 TEST-PAIR-DATA-COMP-1       COMP-1.
009400    02  FILLER.
009500        03  FILLER      VALUE +1048575.E+00.
009600        03  FILLER      VALUE +1048575.E+00.
009700        03  FILLER      VALUE +1048575.E+00.
009800        03  FILLER      VALUE +1048575.E+00.
009900    02  FILLER.
010000        03  FILLER      VALUE +104857.0E+00.
010100        03  FILLER      VALUE +104857.1E+00.
010200        03  FILLER      VALUE +104857.4E+00.
010300        03  FILLER      VALUE +104857.E+00.
010400    02  FILLER.
010500        03  FILLER      VALUE +10485.00E+00.
010600        03  FILLER      VALUE +10485.01E+00.
010700        03  FILLER      VALUE +10485.49E+00.
010800        03  FILLER      VALUE +10485.E+00.
010900    02  FILLER.
011000        03  FILLER      VALUE +1048.000E+00.
011100        03  FILLER      VALUE +1048.001E+00.
011200        03  FILLER      VALUE +1048.499E+00.
011300        03  FILLER      VALUE +1048.E+00.
011400    02  FILLER.
011500        03  FILLER      VALUE +104.0000E+00.
011600        03  FILLER      VALUE +104.0001E+00.
011700        03  FILLER      VALUE +104.4999E+00.
011800        03  FILLER      VALUE +104.E+00.
011900    02  FILLER.
012000        03  FILLER      VALUE +10.00000E+00.
012100        03  FILLER      VALUE +10.00001E+00.
012200        03  FILLER      VALUE +10.49999E+00.
012300        03  FILLER      VALUE +10.E+00.
012400    02  FILLER.
012500        03  FILLER      VALUE +1.000000E+00.
012600        03  FILLER      VALUE +1.000001E+00.
012700        03  FILLER      VALUE +1.499999E+00.
012800        03  FILLER      VALUE +1.E+00.
012900    02  FILLER.
013000        03  FILLER      VALUE +0.0000000E+00.
013100        03  FILLER      VALUE +0.0000001E+00.
013200        03  FILLER      VALUE +0.4999999E+00.
013300        03  FILLER      VALUE +0.E+00.
013400    02  FILLER.
013500        03  FILLER      VALUE -1048575.E+00.
013600        03  FILLER      VALUE -1048575.E+00.
013700        03  FILLER      VALUE -1048575.E+00.
013800        03  FILLER      VALUE -1048575.E+00.
013900    02  FILLER.
014000        03  FILLER      VALUE -104857.1E+00.
014100        03  FILLER      VALUE -104857.2E+00.
014200        03  FILLER      VALUE -104857.9E+00.
014300        03  FILLER      VALUE -104858.E+00.
014400    02  FILLER.
014500        03  FILLER      VALUE -10485.01E+00.
014600        03  FILLER      VALUE -10485.02E+00.
014700        03  FILLER      VALUE -10485.99E+00.
014800        03  FILLER      VALUE -10486.00E+00.
014900    02  FILLER.
015000        03  FILLER      VALUE -1048.001E+00.
015100        03  FILLER      VALUE -1048.002E+00.
015200        03  FILLER      VALUE -1048.999E+00.
015300        03  FILLER      VALUE -1049.00E+00.
015400    02  FILLER.
015500        03  FILLER      VALUE -104.0001E+00.
015600        03  FILLER      VALUE -104.0002E+00.
015700        03  FILLER      VALUE -104.9999E+00.
015800        03  FILLER      VALUE -105.0000E+00.
015900    02  FILLER.
016000        03  FILLER      VALUE -10.00001E+00.
016100        03  FILLER      VALUE -10.00002E+00.
016200        03  FILLER      VALUE -10.99999E+00.
016300        03  FILLER      VALUE -11.00000E+00.
016400    02  FILLER.
016500        03  FILLER      VALUE -1.000001E+00.
016600        03  FILLER      VALUE -1.000002E+00.
016700        03  FILLER      VALUE -1.999999E+00.
016800        03  FILLER      VALUE -2.000000E+00.
016900
017000 01 TEST-PAIR-TABLE-C1  REDEFINES TEST-PAIR-DATA-COMP-1.
017100    02  TEST-PAIR  OCCURS  15 TIMES.
017200        03  TEST-VALUEC1        COMP-1, OCCURS 3 TIMES.
017300        03  EXPECTED-RESULTSC1  COMP-1.
017400
017500 01 TEST-PAIR-DATA-COMP-2      COMP-2.
017600    02  FILLER.
017700        03  FILLER      VALUE +7205759403702793.E+00.
017800        03  FILLER      VALUE +7205759403702793.E+00.
017900        03  FILLER      VALUE +7205759403702793.E+00.
018000        03  FILLER      VALUE +7205759403702793.E+00.
018100    02  FILLER.
018200        03  FILLER      VALUE +720575940370279.0E+00.
018300        03  FILLER      VALUE +720575940370279.1E+00.
018400        03  FILLER      VALUE +720575940370279.4E+00.
018500        03  FILLER      VALUE +720575940370279.E+00.
018600    02  FILLER.
018700        03  FILLER      VALUE +72057594037027.00E+00.
018800        03  FILLER      VALUE +72057594037027.01E+00.
018900        03  FILLER      VALUE +72057594037027.44E+00.
019000        03  FILLER      VALUE +72057594037027.E+00.
019100    02  FILLER.
019200        03  FILLER      VALUE +7205759403702.000E+00.
019300        03  FILLER      VALUE +7205759403702.001E+00.
019400        03  FILLER      VALUE +7205759403702.444E+00.
019500        03  FILLER      VALUE +7205759403702.E+00.
019600    02  FILLER.
019700        03  FILLER      VALUE +720575940370.0000E+00.
019800        03  FILLER      VALUE +720575940370.0001E+00.
019900        03  FILLER      VALUE +720575940370.4444E+00.
020000        03  FILLER      VALUE +720575940370.E+00.
020100    02  FILLER.
020200        03  FILLER      VALUE +72057594037.00000E+00.
020300        03  FILLER      VALUE +72057594037.00001E+00.
020400        03  FILLER      VALUE +72057594037.44444E+00.
020500        03  FILLER      VALUE +72057594037.E+00.
020600    02  FILLER.
020700        03  FILLER      VALUE +7205759403.000000E+00.
020800        03  FILLER      VALUE +7205759403.000001E+00.
020900        03  FILLER      VALUE +7205759403.444444E+00.
021000        03  FILLER      VALUE +7205759403.E+00.
021100    02  FILLER.
021200        03  FILLER      VALUE +720575940.0000000E+00.
021300        03  FILLER      VALUE +720575940.0000001E+00.
021400        03  FILLER      VALUE +720575940.4444449E+00.
021500        03  FILLER      VALUE +720575940.E+00.
021600    02  FILLER.
021700        03  FILLER      VALUE +72057594.00000000E+00.
021800        03  FILLER      VALUE +72057594.00000001E+00.
021900        03  FILLER      VALUE +72057594.49999999E+00.
022000        03  FILLER      VALUE +72057594.E+00.
022100    02  FILLER.
022200        03  FILLER      VALUE +7205759.000000000E+00.
022300        03  FILLER      VALUE +7205759.000000001E+00.
022400        03  FILLER      VALUE +7205759.999999999E+00.
022500        03  FILLER      VALUE +7205759.E+00.
022600    02  FILLER.
022700        03  FILLER      VALUE +720575.0000000000E+00.
022800        03  FILLER      VALUE +720575.0000000001E+00.
022900        03  FILLER      VALUE +720575.9999999999E+00.
023000        03  FILLER      VALUE +720575.E+00.
023100    02  FILLER.
023200        03  FILLER      VALUE +72057.00000000000E+00.
023300        03  FILLER      VALUE +72057.00000000001E+00.
023400        03  FILLER      VALUE +72057.99999999999E+00.
023500        03  FILLER      VALUE +72057.E+00.
023600    02  FILLER.
023700        03  FILLER      VALUE +7205.000000000000E+00.
023800        03  FILLER      VALUE +7205.000000000001E+00.
023900        03  FILLER      VALUE +7205.999999999999E+00.
024000        03  FILLER      VALUE +7205.E+00.
024100    02  FILLER.
024200        03  FILLER      VALUE +720.0000000000000E+00.
024300        03  FILLER      VALUE +720.0000000000001E+00.
024400        03  FILLER      VALUE +720.9999999999999E+00.
024500        03  FILLER      VALUE +720.E+00.
024600    02  FILLER.
024700        03  FILLER      VALUE +72.00000000000000E+00.
024800        03  FILLER      VALUE +72.00000000000001E+00.
024900        03  FILLER      VALUE +72.99999999999999E+00.
025000        03  FILLER      VALUE +72.E+00.
025100    02  FILLER.
025200        03  FILLER      VALUE +7.000000000000000E+00.
025300        03  FILLER      VALUE +7.000000000000001E+00.
              03  FILLER      VALUE +7.99999999999999E+00.
      *       03  FILLER      VALUE +7.999999999999999E+00.
025500        03  FILLER      VALUE +7.E+00.
025600    02  FILLER.
025700        03  FILLER      VALUE +.0000000000000000E+00.
025800        03  FILLER      VALUE +.0000000000000000E+00.
              03  FILLER      VALUE +.999999999999999E+00.
      *       03  FILLER      VALUE +.9999999999999999E+00.
026000        03  FILLER      VALUE +0.E+00.
026100    02  FILLER.
026200        03  FILLER      VALUE -7205759403792793.E+00.
026300        03  FILLER      VALUE -7205759403792793.E+00.
026400        03  FILLER      VALUE -7205759403792793.E+00.
026500        03  FILLER      VALUE -7205759403792793.E+00.
026600    02  FILLER.
026700        03  FILLER      VALUE -720575940379279.1E+00.
026800        03  FILLER      VALUE -720575940379279.2E+00.
026900        03  FILLER      VALUE -720575940379279.9E+00.
027000        03  FILLER      VALUE -720575940379280.E+00.
027100    02  FILLER.
027200        03  FILLER      VALUE -72057594037927.01E+00.
027300        03  FILLER      VALUE -72057594037927.02E+00.
027400        03  FILLER      VALUE -72057594037927.99E+00.
027500        03  FILLER      VALUE -72057594037928.E+00.
027600    02  FILLER.
027700        03  FILLER      VALUE -7205759403792.001E+00.
027800        03  FILLER      VALUE -7205759403792.002E+00.
027900        03  FILLER      VALUE -7205759403792.999E+00.
028000        03  FILLER      VALUE -7205759403793.E+00.
028100    02  FILLER.
028200        03  FILLER      VALUE -720575940379.0001E+00.
028300        03  FILLER      VALUE -720575940379.0002E+00.
028400        03  FILLER      VALUE -720575940379.9999E+00.
028500        03  FILLER      VALUE -720575940380.E+00.
028600    02  FILLER.
028700        03  FILLER      VALUE -72057594037.00001E+00.
028800        03  FILLER      VALUE -72057594037.00002E+00.
028900        03  FILLER      VALUE -72057594037.99999E+00.
029000        03  FILLER      VALUE -72057594038.E+00.
029100    02  FILLER.
029200        03  FILLER      VALUE -7205759403.000001E+00.
029300        03  FILLER      VALUE -7205759403.000002E+00.
029400        03  FILLER      VALUE -7205759403.999999E+00.
029500        03  FILLER      VALUE -7205759404.E+00.
029600    02  FILLER.
029700        03  FILLER      VALUE -720575940.0000001E+00.
029800        03  FILLER      VALUE -720575940.0000002E+00.
029900        03  FILLER      VALUE -720575940.9999999E+00.
030000        03  FILLER      VALUE -720575941.E+00.
030100    02  FILLER.
030200        03  FILLER      VALUE -72057594.00000001E+00.
030300        03  FILLER      VALUE -72057594.00000002E+00.
030400        03  FILLER      VALUE -72057594.99999999E+00.
030500        03  FILLER      VALUE -72057595.E+00.
030600    02  FILLER.
030700        03  FILLER      VALUE -7205759.000000001E+00.
030800        03  FILLER      VALUE -7205759.000000002E+00.
030900        03  FILLER      VALUE -7205759.999999999E+00.
031000        03  FILLER      VALUE -7205760.E+00.
031100    02  FILLER.
031200        03  FILLER      VALUE -720575.0000000001E+00.
031300        03  FILLER      VALUE -720575.0000000002E+00.
031400        03  FILLER      VALUE -720575.9999999999E+00.
031500        03  FILLER      VALUE -720576.E+00.
031600    02  FILLER.
              03  FILLER      VALUE -72057.0000000001E+00.
      *       03  FILLER      VALUE -72057.00000000001E+00.
031800        03  FILLER      VALUE -72057.00000000002E+00.
              03  FILLER      VALUE -72057.99999999999E+00.
032000        03  FILLER      VALUE -72058.E+00.
032100    02  FILLER.
032200        03  FILLER      VALUE -7205.000000000001E+00.
032300        03  FILLER      VALUE -7205.000000000002E+00.
              03  FILLER      VALUE -7205.999999999999E+00.
032500        03  FILLER      VALUE -7206.E+00.
032600    02  FILLER.
032700        03  FILLER      VALUE -720.0000000000001E+00.
032800        03  FILLER      VALUE -720.0000000000002E+00.
032900        03  FILLER      VALUE -720.9999999999999E+00.
033000        03  FILLER      VALUE -721.E+00.
033100    02  FILLER.
033200        03  FILLER      VALUE -72.00000000000001E+00.
033300        03  FILLER      VALUE -72.00000000000002E+00.
033400        03  FILLER      VALUE -72.99999999999999E+00.
033500        03  FILLER      VALUE -73.E+00.
033600    02  FILLER.
033700        03  FILLER      VALUE -7.000000000000001E+00.
033800        03  FILLER      VALUE -7.000000000000002E+00.
033900        03  FILLER      VALUE -7.999999999999999E+00.
034000        03  FILLER      VALUE -8.E+00.
034100
034200 01 TEST-PAIR-TABLEC2   REDEFINES TEST-PAIR-DATA-COMP-2.
034300    02  TEST-PAIRC2         OCCURS 33 TIMES.
034400        03  TEST-VALUEC2        COMP-2 OCCURS 3 TIMES.
034500        03  EXPECTED-RESULTSC2  COMP-2.
034600
034700 01 TEST-PAIR-DATA-COMP-3      COMP-3.
034800    02  FILLER.
034900        03  FILLER      PIC S9V9(17)  VALUE 7.00000000000000000.
035000        03  FILLER      PIC S9V9(17)  VALUE 7.00000000000000001.
035100        03  FILLER      PIC S9V9(17)  VALUE 7.99999999999999999.
035200        03  FILLER      PIC S9        VALUE 7.
035300        03  FILLER      PIC S9.
035400    02  FILLER.
035500        03  FILLER      PIC S99V9(14)   VALUE 72.00000000000000.
035600        03  FILLER      PIC S99V9(14)   VALUE 72.00000000000001.
035700        03  FILLER      PIC S99V9(14)   VALUE 72.99999999999999.
035800        03  FILLER      PIC S99         VALUE 72.
035900        03  FILLER      PIC S99.
036000    02  FILLER.
036100        03  FILLER      PIC S9(3)V9(13) VALUE 720.0000000000000.
036200        03  FILLER      PIC S9(3)V9(13) VALUE 720.0000000000001.
036300        03  FILLER      PIC S9(3)V9(13) VALUE 720.9999999999999.
036400        03  FILLER      PIC S9(3)       VALUE 720.
036500        03  FILLER      PIC S9(3).
036600    02  FILLER.
036700        03  FILLER      PIC S9(4)V9(12) VALUE 7205.000000000000.
036800        03  FILLER      PIC S9(4)V9(12) VALUE 7205.000000000001.
036900        03  FILLER      PIC S9(4)V9(12) VALUE 7205.999999999999.
037000        03  FILLER      PIC S9(4) VALUE 7205.
037100        03  FILLER      PIC S9(4).
037200    02  FILLER.
037300        03  FILLER      PIC S9(5)V9(11) VALUE 72057.00000000000.
037400        03  FILLER      PIC S9(5)V9(11) VALUE 72057.00000000001.
037500        03  FILLER      PIC S9(5)V9(11) VALUE 72057.99999999999.
037600        03  FILLER      PIC S9(5) VALUE 72057.
037700        03  FILLER      PIC S9(5).
037800    02  FILLER.
037900        03  FILLER      PIC S9(6)V9(10) VALUE 720575.0000000000.
038000        03  FILLER      PIC S9(6)V9(10) VALUE 720575.0000000001.
038100        03  FILLER      PIC S9(6)V9(10) VALUE 720575.9999999999.
038200        03  FILLER      PIC S9(6) VALUE 720575.
038300        03  FILLER      PIC S9(6).
038400    02  FILLER.
038500        03  FILLER      PIC S9(7)V9(9) VALUE 7205759.000000000.
038600        03  FILLER      PIC S9(7)V9(9) VALUE 7205759.000000001.
038700        03  FILLER      PIC S9(7)V9(9) VALUE 7205759.999999999.
038800        03  FILLER      PIC S9(7) VALUE 7205759.
038900        03  FILLER      PIC S9(7).
039000    02  FILLER.
039100        03  FILLER      PIC S9(8)V9(8) VALUE 72057594.00000000.
039200        03  FILLER      PIC S9(8)V9(8) VALUE 72057594.00000001.
039300        03  FILLER      PIC S9(8)V9(8) VALUE 72057594.99999999.
039400        03  FILLER      PIC S9(8) VALUE 72057594.
039500        03  FILLER      PIC S9(8).
039600    02  FILLER.
039700        03  FILLER      PIC S9(9)V9(7) VALUE 720575940.0000000.
039800        03  FILLER      PIC S9(9)V9(7) VALUE 720575940.0000001.
039900        03  FILLER      PIC S9(9)V9(7) VALUE 720575940.9999999.
040000        03  FILLER      PIC S9(9) VALUE 720575940.
040100        03  FILLER      PIC S9(9).
040200    02  FILLER.
040300        03  FILLER      PIC S9(10)V9(6) VALUE 7205759403.000000.
040400        03  FILLER      PIC S9(10)V9(6) VALUE 7205759403.000001.
040500        03  FILLER      PIC S9(10)V9(6) VALUE 7205759403.999999.
040600        03  FILLER      PIC S9(10) VALUE 7205759403.
040700        03  FILLER      PIC S9(10).
040800    02  FILLER.
040900        03  FILLER      PIC S9(11)V9(5) VALUE 72057594037.00000.
041000        03  FILLER      PIC S9(11)V9(5) VALUE 72057594037.00001.
041100        03  FILLER      PIC S9(11)V9(5) VALUE 72057594037.99999.
041200        03  FILLER      PIC S9(11) VALUE 72057594037.
041300        03  FILLER      PIC S9(11).
041400    02  FILLER.
041500        03  FILLER      PIC S9(12)V9(4) VALUE 720575940379.0000.
041600        03  FILLER      PIC S9(12)V9(4) VALUE 720575940379.0001.
041700        03  FILLER      PIC S9(12)V9(4) VALUE 720575940379.9999.
041800        03  FILLER      PIC S9(12) VALUE 720575940379.
041900        03  FILLER      PIC S9(12).
042000    02  FILLER.
042100        03  FILLER      PIC S9(13)V9(3) VALUE 7205759403792.000.
042200        03  FILLER      PIC S9(13)V9(3) VALUE 7205759403792.001.
042300        03  FILLER      PIC S9(13)V9(3) VALUE 7205759403792.999.
042400        03  FILLER      PIC S9(13) VALUE 7205759403792.
042500        03  FILLER      PIC S9(13).
042600    02  FILLER.
042700        03  FILLER      PIC S9(14)V9(2) VALUE 72057594037927.00.
042800        03  FILLER      PIC S9(14)V9(2) VALUE 72057594037927.01.
042900        03  FILLER      PIC S9(14)V9(2) VALUE 72057594037927.99.
043000        03  FILLER      PIC S9(14) VALUE 72057594037927.
043100        03  FILLER      PIC S9(14).
043200    02  FILLER.
043300        03  FILLER      PIC S9(15)V9 VALUE 720575940379279.0.
043400        03  FILLER      PIC S9(15)V9 VALUE 720575940379279.1.
043500        03  FILLER      PIC S9(15)V9 VALUE 720575940379279.9.
043600        03  FILLER      PIC S9(15) VALUE 720575940379279.
043700        03  FILLER      PIC S9(15).
043800    02  FILLER.
043900        03  FILLER      PIC S9V9(15) VALUE -7.000000000000001.
044000        03  FILLER      PIC S9V9(15) VALUE -7.000000000000002.
044100        03  FILLER      PIC S9V9(15) VALUE -7.999999999999999.
044200        03  FILLER      PIC S9 VALUE -8.
044300        03  FILLER      PIC S9.
044400    02  FILLER.
044500        03  FILLER      PIC S99V9(14) VALUE -72.00000000000001.
044600        03  FILLER      PIC S99V9(14) VALUE -72.00000000000002.
044700        03  FILLER      PIC S99V9(14) VALUE -72.99999999999999.
044800        03  FILLER      PIC S99 VALUE -73.
044900        03  FILLER      PIC S99.
045000    02  FILLER.
045100        03  FILLER      PIC S9(3)V9(13) VALUE -720.0000000000001.
045200        03  FILLER      PIC S9(3)V9(13) VALUE -720.0000000000002.
045300        03  FILLER      PIC S9(3)V9(13) VALUE -720.9999999999999.
045400        03  FILLER      PIC S9(3) VALUE -721.
045500        03  FILLER      PIC S9(3).
045600    02  FILLER.
045700        03  FILLER      PIC S9(4)V9(12) VALUE -7205.000000000001.
045800        03  FILLER      PIC S9(4)V9(12) VALUE -7205.000000000002.
045900        03  FILLER      PIC S9(4)V9(12) VALUE -7205.999999999999.
046000        03  FILLER      PIC S9(4) VALUE -7206.
046100        03  FILLER      PIC S9(4).
046200    02  FILLER.
046300        03  FILLER      PIC S9(5)V9(11) VALUE -72057.00000000001.
046400        03  FILLER      PIC S9(5)V9(11) VALUE -72057.00000000002.
046500        03  FILLER      PIC S9(5)V9(11) VALUE -72057.99999999999.
046600        03  FILLER      PIC S9(5) VALUE -72058.
046700        03  FILLER      PIC S9(5).
046800    02  FILLER.
046900        03  FILLER      PIC S9(6)V9(10) VALUE -720575.0000000001.
047000        03  FILLER      PIC S9(6)V9(10) VALUE -720575.0000000002.
047100        03  FILLER      PIC S9(6)V9(10) VALUE -720575.9999999999.
047200        03  FILLER      PIC S9(6) VALUE -720576.
047300        03  FILLER      PIC S9(6).
047400    02  FILLER.
047500        03  FILLER      PIC S9(7)V9(9) VALUE -7205759.000000001.
047600        03  FILLER      PIC S9(7)V9(9) VALUE -7205759.000000002.
047700        03  FILLER      PIC S9(7)V9(9) VALUE -7205759.999999999.
047800        03  FILLER      PIC S9(7) VALUE -7205760.
047900        03  FILLER      PIC S9(7).
048000    02  FILLER.
048100        03  FILLER      PIC S9(8)V9(8) VALUE -72057594.00000001.
048200        03  FILLER      PIC S9(8)V9(8) VALUE -72057594.00000002.
048300        03  FILLER      PIC S9(8)V9(8) VALUE -72057594.99999999.
048400        03  FILLER      PIC S9(8) VALUE -72057595.
048500        03  FILLER      PIC S9(8).
048600    02  FILLER.
048700        03  FILLER      PIC S9(9)V9(7) VALUE -720575940.0000001.
048800        03  FILLER      PIC S9(9)V9(7) VALUE -720575940.0000002.
048900        03  FILLER      PIC S9(9)V9(7) VALUE -720575940.9999999.
049000        03  FILLER      PIC S9(9) VALUE -720575941.
049100        03  FILLER      PIC S9(9).
049200    02  FILLER.
049300        03  FILLER      PIC S9(10)V9(6) VALUE -7205759403.000001.
049400        03  FILLER      PIC S9(10)V9(6) VALUE -7205759403.000002.
049500        03  FILLER      PIC S9(10)V9(6) VALUE -7205759403.999999.
049600        03  FILLER      PIC S9(10) VALUE -7205759404.
049700        03  FILLER      PIC S9(10).
049800    02  FILLER.
049900        03  FILLER      PIC S9(11)V9(5) VALUE -72057594037.00001.
050000        03  FILLER      PIC S9(11)V9(5) VALUE -72057594037.00002.
050100        03  FILLER      PIC S9(11)V9(5) VALUE -72057594037.99999.
050200        03  FILLER      PIC S9(11) VALUE -72057594038.
050300        03  FILLER      PIC S9(11).
050400    02  FILLER.
050500        03  FILLER      PIC S9(12)V9(4) VALUE -720575940379.0001.
050600        03  FILLER      PIC S9(12)V9(4) VALUE -720575940379.0002.
050700        03  FILLER      PIC S9(12)V9(4) VALUE -720575940379.9999.
050800        03  FILLER      PIC S9(12) VALUE -720575940380.
050900        03  FILLER      PIC S9(12).
051000    02  FILLER.
051100        03  FILLER      PIC S9(13)V9(3) VALUE -7205759403792.001.
051200        03  FILLER      PIC S9(13)V9(3) VALUE -7205759403792.002.
051300        03  FILLER      PIC S9(13)V9(3) VALUE -7205759403792.999.
051400        03  FILLER      PIC S9(13) VALUE -7205759403793.
051500        03  FILLER      PIC S9(13).
051600    02  FILLER.
051700        03  FILLER      PIC S9(14)V9(2) VALUE -72057594037927.01.
051800        03  FILLER      PIC S9(14)V9(2) VALUE -72057594037927.02.
051900        03  FILLER      PIC S9(14)V9(2) VALUE -72057594037927.99.
052000        03  FILLER      PIC S9(14) VALUE -72057594037928.
052100        03  FILLER      PIC S9(14).
052200    02  FILLER.
052300        03  FILLER      PIC S9(15)V9 VALUE -720575940379279.1.
052400        03  FILLER      PIC S9(15)V9 VALUE -720575940379279.2.
052500        03  FILLER      PIC S9(15)V9 VALUE -720575940379279.9.
052600        03  FILLER      PIC S9(15) VALUE -720575940379280.
052700        03  FILLER      PIC S9(15).
052800
052900 01 TEST-PAIR-TABLEC3   REDEFINES TEST-PAIR-DATA-COMP-3 COMP-3.
053000    02  FILLER.
053100        03  COMP-3-TEST-VALUE-1       PIC S9V9(17) OCCURS 3 TIMES.
053200        03  COMP-3-EXPECTED-RESULT-1  PIC S9.
053300        03  COMP-3-ACTUAL-RESULT-1 PIC S9.
053400    02  FILLER.
053500        03  COMP-3-TEST-VALUE-2    PIC S99V9(14) OCCURS 3 TIMES.
053600        03  COMP-3-EXPECTED-RESULT-2  PIC S99.
053700        03  COMP-3-ACTUAL-RESULT-2 PIC S99.
053800    02  FILLER.
053900        03  COMP-3-TEST-VALUE-3    PIC S9(3)V9(13) OCCURS 3 TIMES.
054000        03  COMP-3-EXPECTED-RESULT-3  PIC S9(3).
054100        03  COMP-3-ACTUAL-RESULT-3 PIC S9(3).
054200    02  FILLER.
054300        03  COMP-3-TEST-VALUE-4    PIC S9(4)V9(12) OCCURS 3 TIMES.
054400        03  COMP-3-EXPECTED-RESULT-4  PIC S9(4).
054500        03  COMP-3-ACTUAL-RESULT-4 PIC S9(4).
054600    02  FILLER.
054700        03  COMP-3-TEST-VALUE-5    PIC S9(5)V9(11) OCCURS 3 TIMES.
054800        03  COMP-3-EXPECTED-RESULT-5  PIC S9(5).
054900        03  COMP-3-ACTUAL-RESULT-5 PIC S9(5).
055000    02  FILLER.
055100        03  COMP-3-TEST-VALUE-6    PIC S9(6)V9(10) OCCURS 3 TIMES.
055200        03  COMP-3-EXPECTED-RESULT-6  PIC S9(6).
055300        03  COMP-3-ACTUAL-RESULT-6 PIC S9(6).
055400    02  FILLER.
055500        03  COMP-3-TEST-VALUE-7    PIC S9(7)V9(9) OCCURS 3 TIMES.
055600        03  COMP-3-EXPECTED-RESULT-7  PIC S9(7).
055700        03  COMP-3-ACTUAL-RESULT-7 PIC S9(7).
055800    02  FILLER.
055900        03  COMP-3-TEST-VALUE-8    PIC S9(8)V9(8) OCCURS 3 TIMES.
056000        03  COMP-3-EXPECTED-RESULT-8  PIC S9(8).
056100        03  COMP-3-ACTUAL-RESULT-8 PIC S9(8).
056200    02  FILLER.
056300        03  COMP-3-TEST-VALUE-9    PIC S9(9)V9(7) OCCURS 3 TIMES.
056400        03  COMP-3-EXPECTED-RESULT-9  PIC S9(9).
056500        03  COMP-3-ACTUAL-RESULT-9 PIC S9(9).
056600    02  FILLER.
056700        03  COMP-3-TEST-VALUE-10   PIC S9(10)V9(6) OCCURS 3 TIMES.
056800        03  COMP-3-EXPECTED-RESULT-10 PIC S9(10).
056900        03  COMP-3-ACTUAL-RESULT-10 PIC S9(10).
057000    02  FILLER.
057100        03  COMP-3-TEST-VALUE-11   PIC S9(11)V9(5) OCCURS 3 TIMES.
057200        03  COMP-3-EXPECTED-RESULT-11 PIC S9(11).
057300        03  COMP-3-ACTUAL-RESULT-11 PIC S9(11).
057400    02  FILLER.
057500        03  COMP-3-TEST-VALUE-12   PIC S9(12)V9(4) OCCURS 3 TIMES.
057600        03  COMP-3-EXPECTED-RESULT-12 PIC S9(12).
057700        03  COMP-3-ACTUAL-RESULT-12 PIC S9(12).
057800    02  FILLER.
057900        03  COMP-3-TEST-VALUE-13   PIC S9(13)V9(3) OCCURS 3 TIMES.
058000        03  COMP-3-EXPECTED-RESULT-13 PIC S9(13).
058100        03  COMP-3-ACTUAL-RESULT-13 PIC S9(13).
058200    02  FILLER.
058300        03  COMP-3-TEST-VALUE-14   PIC S9(14)V9(2) OCCURS 3 TIMES.
058400        03  COMP-3-EXPECTED-RESULT-14 PIC S9(14).
058500        03  COMP-3-ACTUAL-RESULT-14 PIC S9(14).
058600    02  FILLER.
058700        03  COMP-3-TEST-VALUE-15   PIC S9(15)V9    OCCURS 3 TIMES.
058800        03  COMP-3-EXPECTED-RESULT-15 PIC S9(15).
058900        03  COMP-3-ACTUAL-RESULT-15 PIC S9(15).
059000    02  FILLER.
059100        03  COMP-3-TEST-VALUE-16   PIC S9V9(15)    OCCURS 3 TIMES.
059200        03  COMP-3-EXPECTED-RESULT-16 PIC S9.
059300        03  COMP-3-ACTUAL-RESULT-16 PIC S9.
059400    02  FILLER.
059500        03  COMP-3-TEST-VALUE-17   PIC S99V9(14)   OCCURS 3 TIMES.
059600        03  COMP-3-EXPECTED-RESULT-17 PIC S99.
059700        03  COMP-3-ACTUAL-RESULT-17 PIC S99.
059800    02  FILLER.
059900        03  COMP-3-TEST-VALUE-18   PIC S9(3)V9(13) OCCURS 3 TIMES.
060000        03  COMP-3-EXPECTED-RESULT-18 PIC S9(3).
060100        03  COMP-3-ACTUAL-RESULT-18 PIC S9(3).
060200    02  FILLER.
060300        03  COMP-3-TEST-VALUE-19   PIC S9(4)V9(12) OCCURS 3 TIMES.
060400        03  COMP-3-EXPECTED-RESULT-19 PIC S9(4).
060500        03  COMP-3-ACTUAL-RESULT-19 PIC S9(4).
060600    02  FILLER.
060700        03  COMP-3-TEST-VALUE-20   PIC S9(5)V9(11) OCCURS 3 TIMES.
060800        03  COMP-3-EXPECTED-RESULT-20 PIC S9(5).
060900        03  COMP-3-ACTUAL-RESULT-20 PIC S9(5).
061000    02  FILLER.
061100        03  COMP-3-TEST-VALUE-21   PIC S9(6)V9(10) OCCURS 3 TIMES.
061200        03  COMP-3-EXPECTED-RESULT-21 PIC S9(6).
061300        03  COMP-3-ACTUAL-RESULT-21 PIC S9(6).
061400    02  FILLER.
061500        03  COMP-3-TEST-VALUE-22  PIC S9(7)V9(9) OCCURS 3 TIMES.
061600        03  COMP-3-EXPECTED-RESULT-22 PIC S9(7).
061700        03  COMP-3-ACTUAL-RESULT-22 PIC S9(7).
061800    02  FILLER.
061900        03  COMP-3-TEST-VALUE-23    PIC S9(8)V9(8) OCCURS 3 TIMES.
062000        03  COMP-3-EXPECTED-RESULT-23 PIC S9(8).
062100        03  COMP-3-ACTUAL-RESULT-23 PIC S9(8).
062200    02  FILLER.
062300        03  COMP-3-TEST-VALUE-24    PIC S9(9)V9(7) OCCURS 3 TIMES.
062400        03  COMP-3-EXPECTED-RESULT-24 PIC S9(9).
062500        03  COMP-3-ACTUAL-RESULT-24 PIC S9(9).
062600    02  FILLER.
062700        03  COMP-3-TEST-VALUE-25   PIC S9(10)V9(6) OCCURS 3 TIMES.
062800        03  COMP-3-EXPECTED-RESULT-25 PIC S9(10).
062900        03  COMP-3-ACTUAL-RESULT-25 PIC S9(10).
063000    02  FILLER.
063100        03  COMP-3-TEST-VALUE-26   PIC S9(11)V9(5) OCCURS 3 TIMES.
063200        03  COMP-3-EXPECTED-RESULT-26 PIC S9(11).
063300        03  COMP-3-ACTUAL-RESULT-26 PIC S9(11).
063400    02  FILLER.
063500        03  COMP-3-TEST-VALUE-27   PIC S9(12)V9(4) OCCURS 3 TIMES.
063600        03  COMP-3-EXPECTED-RESULT-27 PIC S9(12).
063700        03  COMP-3-ACTUAL-RESULT-27 PIC S9(12).
063800    02  FILLER.
063900        03  COMP-3-TEST-VALUE-28   PIC S9(13)V9(3) OCCURS 3 TIMES.
064000        03  COMP-3-EXPECTED-RESULT-28 PIC S9(13).
064100        03  COMP-3-ACTUAL-RESULT-28  PIC S9(13).
064200    02  FILLER.
064300        03  COMP-3-TEST-VALUE-29   PIC S9(14)V9(2) OCCURS 3 TIMES.
064400        03  COMP-3-EXPECTED-RESULT-29 PIC S9(14).
064500        03  COMP-3-ACTUAL-RESULT-29 PIC S9(14).
064600    02  FILLER.
064700        03  COMP-3-TEST-VALUE-30    PIC S9(15)V9 OCCURS 3 TIMES.
064800        03  COMP-3-EXPECTED-RESULT-30 PIC S9(15).
064900        03  COMP-3-ACTUAL-RESULT-30 PIC S9(15).
065000
065100 01 TEST-PAIR-DATA-DISPLAY      DISPLAY.
065200    02  FILLER.
065300        03  FILLER    PIC S9V9(17) VALUE 7.00000000000000000.
065400        03  FILLER    PIC S9V9(17) VALUE 7.00000000000000001.
065500        03  FILLER    PIC S9V9(17) VALUE 7.99999999999999999.
065600        03  FILLER    PIC S9 VALUE 7.
065700        03  FILLER    PIC S9.
065800    02  FILLER.
065900        03  FILLER     PIC S99V9(14) VALUE 72.00000000000000.
066000        03  FILLER     PIC S99V9(14) VALUE 72.00000000000001.
066100        03  FILLER     PIC S99V9(14) VALUE 72.99999999999999.
066200        03  FILLER     PIC S99 VALUE 72.
066300        03  FILLER     PIC S99.
066400    02  FILLER.
066500        03  FILLER     PIC S9(3)V9(13) VALUE 720.0000000000000.
066600        03  FILLER     PIC S9(3)V9(13) VALUE 720.0000000000001.
066700        03  FILLER     PIC S9(3)V9(13) VALUE 720.9999999999999.
066800        03  FILLER     PIC S9(3) VALUE 720.
066900        03  FILLER     PIC S9(3).
067000    02  FILLER.
067100        03  FILLER     PIC S9(4)V9(12) VALUE 7205.000000000000.
067200        03  FILLER     PIC S9(4)V9(12) VALUE 7205.000000000001.
067300        03  FILLER     PIC S9(4)V9(12) VALUE 7205.999999999999.
067400        03  FILLER      PIC S9(4) VALUE 7205.
067500        03  FILLER      PIC S9(4).
067600    02  FILLER.
067700        03  FILLER      PIC S9(5)V9(11) VALUE 72057.00000000000.
067800        03  FILLER      PIC S9(5)V9(11) VALUE 72057.00000000001.
067900        03  FILLER      PIC S9(5)V9(11) VALUE 72057.99999999999.
068000        03  FILLER      PIC S9(5) VALUE 72057.
068100        03  FILLER      PIC S9(5).
068200    02  FILLER.
068300        03  FILLER      PIC S9(6)V9(10) VALUE 720575.0000000000.
068400        03  FILLER      PIC S9(6)V9(10) VALUE 720575.0000000001.
068500        03  FILLER      PIC S9(6)V9(10) VALUE 720575.9999999999.
068600        03  FILLER      PIC S9(6) VALUE 720575.
068700        03  FILLER      PIC S9(6).
068800    02  FILLER.
068900        03  FILLER      PIC S9(7)V9(9) VALUE 7205759.000000000.
069000        03  FILLER      PIC S9(7)V9(9) VALUE 7205759.000000001.
069100        03  FILLER      PIC S9(7)V9(9) VALUE 7205759.999999999.
069200        03  FILLER      PIC S9(7) VALUE 7205759.
069300        03  FILLER      PIC S9(7).
069400    02  FILLER.
069500        03  FILLER      PIC S9(8)V9(8) VALUE 72057594.00000000.
069600        03  FILLER      PIC S9(8)V9(8) VALUE 72057594.00000001.
069700        03  FILLER      PIC S9(8)V9(8) VALUE 72057594.99999999.
069800        03  FILLER      PIC S9(8) VALUE 72057594.
069900        03  FILLER      PIC S9(8).
070000    02  FILLER.
070100        03  FILLER      PIC S9(9)V9(7) VALUE 720575940.0000000.
070200        03  FILLER      PIC S9(9)V9(7) VALUE 720575940.0000001.
070300        03  FILLER      PIC S9(9)V9(7) VALUE 720575940.9999999.
070400        03  FILLER      PIC S9(9) VALUE 720575940.
070500        03  FILLER      PIC S9(9).
070600    02  FILLER.
070700        03  FILLER      PIC S9(10)V9(6) VALUE 7205759403.000000.
070800        03  FILLER      PIC S9(10)V9(6) VALUE 7205759403.000001.
070900        03  FILLER      PIC S9(10)V9(6) VALUE 7205759403.999999.
071000        03  FILLER      PIC S9(10) VALUE 7205759403.
071100        03  FILLER      PIC S9(10).
071200    02  FILLER.
071300        03  FILLER      PIC S9(11)V9(5) VALUE 72057594037.00000.
071400        03  FILLER      PIC S9(11)V9(5) VALUE 72057594037.00001.
071500        03  FILLER      PIC S9(11)V9(5) VALUE 72057594037.99999.
071600        03  FILLER      PIC S9(11) VALUE 72057594037.
071700        03  FILLER      PIC S9(11).
071800    02  FILLER.
071900        03  FILLER      PIC S9(12)V9(4) VALUE 720575940379.0000.
072000        03  FILLER      PIC S9(12)V9(4) VALUE 720575940379.0001.
072100        03  FILLER      PIC S9(12)V9(4) VALUE 720575940379.9999.
072200        03  FILLER      PIC S9(12) VALUE 720575940379.
072300        03  FILLER      PIC S9(12).
072400    02  FILLER.
072500        03  FILLER      PIC S9(13)V9(3) VALUE 7205759403792.000.
072600        03  FILLER      PIC S9(13)V9(3) VALUE 7205759403792.001.
072700        03  FILLER      PIC S9(13)V9(3) VALUE 7205759403792.999.
072800        03  FILLER      PIC S9(13) VALUE 7205759403792.
072900        03  FILLER      PIC S9(13).
073000    02  FILLER.
073100        03  FILLER      PIC S9(14)V9(2) VALUE 72057594037927.00.
073200        03  FILLER      PIC S9(14)V9(2) VALUE 72057594037927.01.
073300        03  FILLER      PIC S9(14)V9(2) VALUE 72057594037927.99.
073400        03  FILLER      PIC S9(14) VALUE 72057594037927.
073500        03  FILLER      PIC S9(14).
073600    02  FILLER.
073700        03  FILLER      PIC S9(15)V9 VALUE 720575940379279.0.
073800        03  FILLER      PIC S9(15)V9 VALUE 720575940379279.1.
073900        03  FILLER      PIC S9(15)V9 VALUE 720575940379279.9.
074000        03  FILLER      PIC S9(15) VALUE 720575940379279.
074100        03  FILLER      PIC S9(15).
074200    02  FILLER.
074300        03  FILLER      PIC S9V9(15) VALUE -7.000000000000001.
074400        03  FILLER      PIC S9V9(15) VALUE -7.000000000000002.
074500        03  FILLER      PIC S9V9(15) VALUE -7.999999999999999.
074600        03  FILLER      PIC S9 VALUE -8.
074700        03  FILLER      PIC S9.
074800    02  FILLER.
074900        03  FILLER      PIC S99V9(14) VALUE -72.00000000000001.
075000        03  FILLER      PIC S99V9(14) VALUE -72.00000000000002.
075100        03  FILLER      PIC S99V9(14) VALUE -72.99999999999999.
075200        03  FILLER      PIC S99 VALUE -73.
075300        03  FILLER      PIC S99.
075400    02  FILLER.
075500        03  FILLER      PIC S9(3)V9(13) VALUE -720.0000000000001.
075600        03  FILLER      PIC S9(3)V9(13) VALUE -720.0000000000002.
075700        03  FILLER      PIC S9(3)V9(13) VALUE -720.9999999999999.
075800        03  FILLER      PIC S9(3) VALUE -721.
075900        03  FILLER      PIC S9(3).
076000    02  FILLER.
076100        03  FILLER      PIC S9(4)V9(12) VALUE -7205.000000000001.
076200        03  FILLER      PIC S9(4)V9(12) VALUE -7205.000000000002.
076300        03  FILLER      PIC S9(4)V9(12) VALUE -7205.999999999999.
076400        03  FILLER      PIC S9(4) VALUE -7206.
076500        03  FILLER      PIC S9(4).
076600    02  FILLER.
076700        03  FILLER      PIC S9(5)V9(11) VALUE -72057.00000000001.
076800        03  FILLER      PIC S9(5)V9(11) VALUE -72057.00000000002.
076900        03  FILLER      PIC S9(5)V9(11) VALUE -72057.99999999999.
077000        03  FILLER      PIC S9(5) VALUE -72058.
077100        03  FILLER      PIC S9(5).
077200    02  FILLER.
077300        03  FILLER      PIC S9(6)V9(10) VALUE -720575.0000000001.
077400        03  FILLER      PIC S9(6)V9(10) VALUE -720575.0000000002.
077500        03  FILLER      PIC S9(6)V9(10) VALUE -720575.9999999999.
077600        03  FILLER      PIC S9(6) VALUE -720576.
077700        03  FILLER      PIC S9(6).
077800    02  FILLER.
077900        03  FILLER      PIC S9(7)V9(9) VALUE -7205759.000000001.
078000        03  FILLER      PIC S9(7)V9(9) VALUE -7205759.000000002.
078100        03  FILLER      PIC S9(7)V9(9) VALUE -7205759.999999999.
078200        03  FILLER      PIC S9(7) VALUE -7205760.
078300        03  FILLER      PIC S9(7).
078400    02  FILLER.
078500        03  FILLER      PIC S9(8)V9(8) VALUE -72057594.00000001.
078600        03  FILLER      PIC S9(8)V9(8) VALUE -72057594.00000002.
078700        03  FILLER      PIC S9(8)V9(8) VALUE -72057594.99999999.
078800        03  FILLER      PIC S9(8) VALUE -72057595.
078900        03  FILLER      PIC S9(8).
079000    02  FILLER.
079100        03  FILLER      PIC S9(9)V9(7) VALUE -720575940.0000001.
079200        03  FILLER      PIC S9(9)V9(7) VALUE -720575940.0000002.
079300        03  FILLER      PIC S9(9)V9(7) VALUE -720575940.9999999.
079400        03  FILLER      PIC S9(9) VALUE -720575941.
079500        03  FILLER      PIC S9(9).
079600    02  FILLER.
079700        03  FILLER      PIC S9(10)V9(6) VALUE -7205759403.000001.
079800        03  FILLER      PIC S9(10)V9(6) VALUE -7205759403.000002.
079900        03  FILLER      PIC S9(10)V9(6) VALUE -7205759403.999999.
080000        03  FILLER      PIC S9(10) VALUE -7205759404.
080100        03  FILLER      PIC S9(10).
080200    02  FILLER.
080300        03  FILLER      PIC S9(11)V9(5) VALUE -72057594037.00001.
080400        03  FILLER      PIC S9(11)V9(5) VALUE -72057594037.00002.
080500        03  FILLER      PIC S9(11)V9(5) VALUE -72057594037.99999.
080600        03  FILLER      PIC S9(11) VALUE -72057594038.
080700        03  FILLER      PIC S9(11).
080800    02  FILLER.
080900        03  FILLER      PIC S9(12)V9(4) VALUE -720575940379.0001.
081000        03  FILLER      PIC S9(12)V9(4) VALUE -720575940379.0002.
081100        03  FILLER      PIC S9(12)V9(4) VALUE -720575940379.9999.
081200        03  FILLER      PIC S9(12) VALUE -720575940380.
081300        03  FILLER      PIC S9(12).
081400    02  FILLER.
081500        03  FILLER      PIC S9(13)V9(3) VALUE -7205759403792.001.
081600        03  FILLER      PIC S9(13)V9(3) VALUE -7205759403792.002.
081700        03  FILLER      PIC S9(13)V9(3) VALUE -7205759403792.999.
081800        03  FILLER      PIC S9(13) VALUE -7205759403793.
081900        03  FILLER      PIC S9(13).
082000    02  FILLER.
082100        03  FILLER      PIC S9(14)V9(2) VALUE -72057594037927.01.
082200        03  FILLER      PIC S9(14)V9(2) VALUE -72057594037927.02.
082300        03  FILLER      PIC S9(14)V9(2) VALUE -72057594037927.99.
082400        03  FILLER      PIC S9(14) VALUE -72057594037928.
082500        03  FILLER      PIC S9(14).
082600    02  FILLER.
082700        03  FILLER      PIC S9(15)V9 VALUE -720575940379279.1.
082800        03  FILLER      PIC S9(15)V9 VALUE -720575940379279.2.
082900        03  FILLER      PIC S9(15)V9 VALUE -720575940379279.9.
083000        03  FILLER      PIC S9(15) VALUE -720575940379280.
083100        03  FILLER      PIC S9(15).
083200
083300 01 TEST-PAIR-TABLEDP REDEFINES TEST-PAIR-DATA-DISPLAY DISPLAY.
083400    02  FILLER.
083500        03  DISPLAY-TEST-VALUE-1     PIC S9V9(17) OCCURS 3 TIMES.
083600        03  DISPLAY-EXPECTED-RESULT-1  PIC S9.
083700        03  DISPLAY-ACTUAL-RESULT-1    PIC S9.
083800    02  FILLER.
083900        03  DISPLAY-TEST-VALUE-2     PIC S99V9(14) OCCURS 3 TIMES.
084000        03  DISPLAY-EXPECTED-RESULT-2  PIC S99.
084100        03  DISPLAY-ACTUAL-RESULT-2    PIC S99.
084200    02  FILLER.
084300        03  DISPLAY-TEST-VALUE-3  PIC S9(3)V9(13) OCCURS 3 TIMES.
084400        03  DISPLAY-EXPECTED-RESULT-3  PIC S9(3).
084500        03  DISPLAY-ACTUAL-RESULT-3    PIC S9(3).
084600    02  FILLER.
084700        03  DISPLAY-TEST-VALUE-4   PIC S9(4)V9(12) OCCURS 3 TIMES.
084800        03  DISPLAY-EXPECTED-RESULT-4  PIC S9(4).
084900        03  DISPLAY-ACTUAL-RESULT-4  PIC S9(4).
085000    02  FILLER.
085100        03  DISPLAY-TEST-VALUE-5   PIC S9(5)V9(11) OCCURS 3 TIMES.
085200        03  DISPLAY-EXPECTED-RESULT-5  PIC S9(5).
085300        03  DISPLAY-ACTUAL-RESULT-5  PIC S9(5).
085400    02  FILLER.
085500        03  DISPLAY-TEST-VALUE-6   PIC S9(6)V9(10) OCCURS 3 TIMES.
085600        03  DISPLAY-EXPECTED-RESULT-6  PIC S9(6).
085700        03  DISPLAY-ACTUAL-RESULT-6  PIC S9(6).
085800    02  FILLER.
085900        03  DISPLAY-TEST-VALUE-7   PIC S9(7)V9(9)  OCCURS 3 TIMES.
086000        03  DISPLAY-EXPECTED-RESULT-7  PIC S9(7).
086100        03  DISPLAY-ACTUAL-RESULT-7  PIC S9(7).
086200    02  FILLER.
086300        03  DISPLAY-TEST-VALUE-8   PIC S9(8)V9(8) OCCURS 3 TIMES.
086400        03  DISPLAY-EXPECTED-RESULT-8  PIC S9(8).
086500        03  DISPLAY-ACTUAL-RESULT-8  PIC S9(8).
086600    02  FILLER.
086700        03  DISPLAY-TEST-VALUE-9   PIC S9(9)V9(7) OCCURS 3 TIMES.
086800        03  DISPLAY-EXPECTED-RESULT-9  PIC S9(9).
086900        03  DISPLAY-ACTUAL-RESULT-9  PIC S9(9).
087000    02  FILLER.
087100        03  DISPLAY-TEST-VALUE-10  PIC S9(10)V9(6) OCCURS 3 TIMES.
087200        03  DISPLAY-EXPECTED-RESULT-10 PIC S9(10).
087300        03  DISPLAY-ACTUAL-RESULT-10   PIC S9(10).
087400    02  FILLER.
087500        03  DISPLAY-TEST-VALUE-11  PIC S9(11)V9(5) OCCURS 3 TIMES.
087600        03  DISPLAY-EXPECTED-RESULT-11 PIC S9(11).
087700        03  DISPLAY-ACTUAL-RESULT-11   PIC S9(11).
087800    02  FILLER.
087900        03  DISPLAY-TEST-VALUE-12  PIC S9(12)V9(4) OCCURS 3 TIMES.
088000        03  DISPLAY-EXPECTED-RESULT-12 PIC S9(12).
088100        03  DISPLAY-ACTUAL-RESULT-12   PIC S9(12).
088200    02  FILLER.
088300        03  DISPLAY-TEST-VALUE-13  PIC S9(13)V9(3) OCCURS 3 TIMES.
088400        03  DISPLAY-EXPECTED-RESULT-13 PIC S9(13).
088500        03  DISPLAY-ACTUAL-RESULT-13   PIC S9(13).
088600    02  FILLER.
088700        03  DISPLAY-TEST-VALUE-14  PIC S9(14)V9(2) OCCURS 3 TIMES.
088800        03  DISPLAY-EXPECTED-RESULT-14 PIC S9(14).
088900        03  DISPLAY-ACTUAL-RESULT-14   PIC S9(14).
089000    02  FILLER.
089100        03  DISPLAY-TEST-VALUE-15  PIC S9(15)V9    OCCURS 3 TIMES.
089200        03  DISPLAY-EXPECTED-RESULT-15 PIC S9(15).
089300        03  DISPLAY-ACTUAL-RESULT-15   PIC S9(15).
089400    02  FILLER.
089500        03  DISPLAY-TEST-VALUE-16  PIC S9V9(15) OCCURS 3 TIMES.
089600        03  DISPLAY-EXPECTED-RESULT-16 PIC S9.
089700        03  DISPLAY-ACTUAL-RESULT-16   PIC S9.
089800    02  FILLER.
089900        03  DISPLAY-TEST-VALUE-17  PIC S99V9(14) OCCURS 3 TIMES.
090000        03  DISPLAY-EXPECTED-RESULT-17 PIC S99.
090100        03  DISPLAY-ACTUAL-RESULT-17   PIC S99.
090200    02  FILLER.
090300        03  DISPLAY-TEST-VALUE-18  PIC S9(3)V9(13) OCCURS 3 TIMES.
090400        03  DISPLAY-EXPECTED-RESULT-18 PIC S9(3).
090500        03  DISPLAY-ACTUAL-RESULT-18   PIC S9(3).
090600    02  FILLER.
090700        03  DISPLAY-TEST-VALUE-19  PIC S9(4)V9(12) OCCURS 3 TIMES.
090800        03  DISPLAY-EXPECTED-RESULT-19 PIC S9(4).
090900        03  DISPLAY-ACTUAL-RESULT-19   PIC S9(4).
091000    02  FILLER.
091100        03  DISPLAY-TEST-VALUE-20  PIC S9(5)V9(11) OCCURS 3 TIMES.
091200        03  DISPLAY-EXPECTED-RESULT-20 PIC S9(5).
091300        03  DISPLAY-ACTUAL-RESULT-20   PIC S9(5).
091400    02  FILLER.
091500        03  DISPLAY-TEST-VALUE-21  PIC S9(6)V9(10) OCCURS 3 TIMES.
091600        03  DISPLAY-EXPECTED-RESULT-21 PIC S9(6).
091700        03  DISPLAY-ACTUAL-RESULT-21   PIC S9(6).
091800    02  FILLER.
091900        03  DISPLAY-TEST-VALUE-22   PIC S9(7)V9(9) OCCURS 3 TIMES.
092000        03  DISPLAY-EXPECTED-RESULT-22 PIC S9(7).
092100        03  DISPLAY-ACTUAL-RESULT-22   PIC S9(7).
092200    02  FILLER.
092300        03  DISPLAY-TEST-VALUE-23   PIC S9(8)V9(8) OCCURS 3 TIMES.
092400        03  DISPLAY-EXPECTED-RESULT-23 PIC S9(8).
092500        03  DISPLAY-ACTUAL-RESULT-23   PIC S9(8).
092600    02  FILLER.
092700        03  DISPLAY-TEST-VALUE-24   PIC S9(9)V9(7) OCCURS 3 TIMES.
092800        03  DISPLAY-EXPECTED-RESULT-24 PIC S9(9).
092900        03  DISPLAY-ACTUAL-RESULT-24   PIC S9(9).
093000    02  FILLER.
093100        03  DISPLAY-TEST-VALUE-25  PIC S9(10)V9(6) OCCURS 3 TIMES.
093200        03  DISPLAY-EXPECTED-RESULT-25 PIC S9(10).
093300        03  DISPLAY-ACTUAL-RESULT-25   PIC S9(10).
093400    02  FILLER.
093500        03  DISPLAY-TEST-VALUE-26  PIC S9(11)V9(5) OCCURS 3 TIMES.
093600        03  DISPLAY-EXPECTED-RESULT-26 PIC S9(11).
093700        03  DISPLAY-ACTUAL-RESULT-26   PIC S9(11).
093800    02  FILLER.
093900        03  DISPLAY-TEST-VALUE-27  PIC S9(12)V9(4) OCCURS 3 TIMES.
094000        03  DISPLAY-EXPECTED-RESULT-27 PIC S9(12).
094100        03  DISPLAY-ACTUAL-RESULT-27   PIC S9(12).
094200    02  FILLER.
094300        03  DISPLAY-TEST-VALUE-28  PIC S9(13)V9(3) OCCURS 3 TIMES.
094400        03  DISPLAY-EXPECTED-RESULT-28 PIC S9(13).
094500        03  DISPLAY-ACTUAL-RESULT-28   PIC S9(13).
094600    02  FILLER.
094700        03  DISPLAY-TEST-VALUE-29  PIC S9(14)V9(2) OCCURS 3 TIMES.
094800        03  DISPLAY-EXPECTED-RESULT-29 PIC S9(14).
094900        03  DISPLAY-ACTUAL-RESULT-29   PIC S9(14).
095000    02  FILLER.
095100        03  DISPLAY-TEST-VALUE-30   PIC S9(15)V9  OCCURS 3 TIMES.
095200        03  DISPLAY-EXPECTED-RESULT-30 PIC S9(15).
095300        03  DISPLAY-ACTUAL-RESULT-30   PIC S9(15).
095400
095500 01 TEST-PAIR-DATA-HALFWD       COMP .
095600    02  FILLER.
095700        03  FILLER                    PIC S9V9(3) VALUE 7.000.
095800        03  FILLER                    PIC S9V9(3) VALUE 7.001.
095900        03  FILLER                    PIC S9V9(3) VALUE 7.999.
096000        03  FILLER                    PIC S9      VALUE 7.
096100        03  FILLER                    PIC S9.
096200    02  FILLER.
096300        03  FILLER                    PIC S99V9(2) VALUE 72.00.
096400        03  FILLER                    PIC S99V9(2) VALUE 72.01.
096500        03  FILLER                    PIC S99V9(2) VALUE 72.99.
096600        03  FILLER                    PIC S99      VALUE 72.
096700        03  FILLER                    PIC S99.
096800    02  FILLER.
096900        03  FILLER                    PIC S9(3)V9  VALUE 720.0.
097000        03  FILLER                    PIC S9(3)V9  VALUE 720.1.
097100        03  FILLER                    PIC S9(3)V9  VALUE 720.9.
097200        03  FILLER                    PIC S9(3)    VALUE 720.
097300        03  FILLER                    PIC S9(3).
097400    02  FILLER.
097500        03  FILLER                    PIC S9(4) VALUE 7205.
097600        03  FILLER                    PIC S9(4) VALUE 7205.
097700        03  FILLER                    PIC S9(4) VALUE 7205.
097800        03  FILLER                    PIC S9(4) VALUE 7205.
097900        03  FILLER                    PIC S9(4).
098000    02  FILLER.
098100        03  FILLER                    PIC S9V9(3) VALUE -7.001.
098200        03  FILLER                    PIC S9V9(3) VALUE -7.002.
098300        03  FILLER                    PIC S9V9(3) VALUE -7.999.
098400        03  FILLER                    PIC S9      VALUE -8.
098500        03  FILLER                    PIC S9.
098600    02  FILLER.
098700        03  FILLER                    PIC S99V9(2) VALUE -72.01.
098800        03  FILLER                    PIC S99V9(2) VALUE -72.02.
098900        03  FILLER                    PIC S99V9(2) VALUE -72.99.
099000        03  FILLER                    PIC S99      VALUE -73.
099100        03  FILLER                    PIC S99.
099200    02  FILLER.
099300        03  FILLER                    PIC S9(3)V9  VALUE -722.2.
099400        03  FILLER                    PIC S9(3)V9  VALUE -722.1.
099500        03  FILLER                    PIC S9(3)V9  VALUE -722.9.
099600        03  FILLER                    PIC S9(3)    VALUE -723.
099700        03  FILLER                    PIC S9(3).
099800    02  FILLER.
099900        03  FILLER                    PIC S9(4)   VALUE -7205.
100000        03  FILLER                    PIC S9(4)   VALUE -7205.
100100        03  FILLER                    PIC S9(4)   VALUE -7205.
100200        03  FILLER                    PIC S9(4)   VALUE -7205.
100300        03  FILLER                    PIC S9(4).
100400
100500 01 TEST-PAIR-HALFWD    REDEFINES TEST-PAIR-DATA-HALFWD COMP.
100600    02  FILLER.
100700        03   HALFWD-TEST-VALUE-1  PIC S9V9(3) OCCURS 3 TIMES.
100800        03  HALFWD-EXPECTED-RESULT-1  PIC S9.
100900        03  HALFWD-ACTUAL-RESULT-1    PIC S9.
101000    02  FILLER.
101100        03   HALFWD-TEST-VALUE-2  PIC S99V9(2) OCCURS 3 TIMES.
101200        03  HALFWD-EXPECTED-RESULT-2  PIC S99.
101300        03  HALFWD-ACTUAL-RESULT-2    PIC S99.
101400    02  FILLER.
101500        03   HALFWD-TEST-VALUE-3  PIC S9(3)V9 OCCURS 3 TIMES.
101600        03  HALFWD-EXPECTED-RESULT-3  PIC S9(3).
101700        03  HALFWD-ACTUAL-RESULT-3    PIC S9(3).
101800    02  FILLER.
101900        03   HALFWD-TEST-VALUE-4  PIC S9(4)   OCCURS 3 TIMES.
102000        03  HALFWD-EXPECTED-RESULT-4  PIC S9(4).
102100        03  HALFWD-ACTUAL-RESULT-4    PIC S9(4).
102200    02  FILLER.
102300        03  HALFWD-TEST-VALUE-5  PIC S9V9(3)  OCCURS 3 TIMES.
102400        03  HALFWD-EXPECTED-RESULT-5  PIC S9.
102500        03  HALFWD-ACTUAL-RESULT-5    PIC S9.
102600    02  FILLER.
102700        03  HALFWD-TEST-VALUE-6  PIC S9(2)V9(2) OCCURS 3 TIMES.
102800        03  HALFWD-EXPECTED-RESULT-6  PIC S9(2).
102900        03  HALFWD-ACTUAL-RESULT-6    PIC S9(2).
103000    02  FILLER.
103100        03  HALFWD-TEST-VALUE-7  PIC S9(3)V9    OCCURS 3 TIMES.
103200        03  HALFWD-EXPECTED-RESULT-7  PIC S9(3).
103300        03  HALFWD-ACTUAL-RESULT-7    PIC S9(3).
103400    02  FILLER.
103500        03  HALFWD-TEST-VALUE-8  PIC S9(4)      OCCURS 3 TIMES.
103600        03  HALFWD-EXPECTED-RESULT-8  PIC S9(4).
103700        03  HALFWD-ACTUAL-RESULT-8    PIC S9(4).
103800
103900 01 TEST-PAIR-DATA-FULLWD       COMP .
104000    02  FILLER.
104100        03  FILLER       PIC S9V9(7) VALUE 7.0000000.
104200        03  FILLER       PIC S9V9(7) VALUE 7.0000001.
104300        03  FILLER       PIC S9V9(7) VALUE 7.9999999.
104400        03  FILLER       PIC S9      VALUE 7.
104500        03  FILLER       PIC S9.
104600    02  FILLER.
104700        03  FILLER       PIC S99V9(6) VALUE 72.000000.
104800        03  FILLER       PIC S99V9(6) VALUE 72.000001.
104900        03  FILLER       PIC S99V9(6) VALUE 72.999999.
105000        03  FILLER       PIC S99      VALUE 72.
105100        03  FILLER       PIC S99.
105200    02  FILLER.
105300        03  FILLER       PIC S9(3)V9(5) VALUE 720.00000.
105400        03  FILLER       PIC S9(3)V9(5) VALUE 720.00001.
105500        03  FILLER       PIC S9(3)V9(5) VALUE 720.99999.
105600        03  FILLER       PIC S9(3)      VALUE 720.
105700        03  FILLER       PIC S9(3).
105800    02  FILLER.
105900        03  FILLER       PIC S9(4)V9(4) VALUE 7205.0000.
106000        03  FILLER       PIC S9(4)V9(4) VALUE 7205.0001.
106100        03  FILLER       PIC S9(4)V9(4) VALUE 7205.9999.
106200        03  FILLER       PIC S9(4)      VALUE 7205.
106300        03  FILLER       PIC S9(4).
106400    02  FILLER.
106500        03  FILLER       PIC S9(5)V9(3) VALUE 72057.000.
106600        03  FILLER       PIC S9(5)V9(3) VALUE 72057.001.
106700        03  FILLER       PIC S9(5)V9(3) VALUE 72057.999.
106800        03  FILLER       PIC S9(5)      VALUE 72057.
106900        03  FILLER       PIC S9(5).
107000    02  FILLER.
107100        03  FILLER       PIC S9(6)V9(2) VALUE 720575.00.
107200        03  FILLER       PIC S9(6)V9(2) VALUE 720575.01.
107300        03  FILLER       PIC S9(6)V9(2) VALUE 720575.99.
107400        03  FILLER       PIC S9(6)      VALUE 720575.
107500        03  FILLER       PIC S9(6).
107600    02  FILLER.
107700        03  FILLER       PIC S9(7)V9    VALUE 7205759.0.
107800        03  FILLER       PIC S9(7)V9    VALUE 7205759.1.
107900        03  FILLER       PIC S9(7)V9    VALUE 7205759.9.
108000        03  FILLER       PIC S9(7)      VALUE 7205759.
108100        03  FILLER       PIC S9(7).
108200    02  FILLER.
108300        03  FILLER       PIC S9(8)      VALUE 72057594.
108400        03  FILLER       PIC S9(8)      VALUE 72057594.
108500        03  FILLER       PIC S9(8)      VALUE 72057594.
108600        03  FILLER       PIC S9(8)    VALUE 72057594.
108700        03  FILLER       PIC S9(8).
108800    02  FILLER.
108900        03  FILLER       PIC S9V9(7)  VALUE -7.0000001.
109000        03  FILLER       PIC S9V9(7)  VALUE -7.0000002.
109100        03  FILLER       PIC S9V9(7)  VALUE -7.9999999.
109200        03  FILLER       PIC S9       VALUE -8.
109300        03  FILLER       PIC S9.
109400    02  FILLER.
109500        03  FILLER       PIC S99V9(6) VALUE -72.000001.
109600        03  FILLER       PIC S99V9(6) VALUE -72.000002.
109700        03  FILLER       PIC S99V9(6) VALUE -72.999999.
109800        03  FILLER       PIC S99      VALUE -73.
109900        03  FILLER       PIC S99.
110000    02  FILLER.
110100        03  FILLER       PIC S9(3)V9(5) VALUE -720.00001.
110200        03  FILLER       PIC S9(3)V9(5) VALUE -720.00002.
110300        03  FILLER       PIC S9(3)V9(5) VALUE -720.99999.
110400        03  FILLER       PIC S9(3)      VALUE -721.
110500        03  FILLER       PIC S9(3).
110600    02  FILLER.
110700        03  FILLER       PIC S9(4)V9(4) VALUE -7205.0001.
110800        03  FILLER       PIC S9(4)V9(4) VALUE -7205.0002.
110900        03  FILLER       PIC S9(4)V9(4) VALUE -7205.9999.
111000        03  FILLER       PIC S9(4)      VALUE -7206.
111100        03  FILLER       PIC S9(4).
111200    02  FILLER.
111300        03  FILLER       PIC S9(5)V9(3) VALUE -72057.001.
111400        03  FILLER       PIC S9(5)V9(3) VALUE -72057.002.
111500        03  FILLER       PIC S9(5)V9(3) VALUE -72057.999.
111600        03  FILLER       PIC S9(5)      VALUE -72058.
111700        03  FILLER       PIC S9(5).
111800    02  FILLER.
111900        03  FILLER       PIC S9(6)V9(2) VALUE -720575.01.
112000        03  FILLER       PIC S9(6)V9(2) VALUE -720575.02.
112100        03  FILLER       PIC S9(6)V9(2) VALUE -720575.99.
112200        03  FILLER       PIC S9(6)      VALUE -720576.
112300        03  FILLER       PIC S9(6).
112400    02  FILLER.
112500        03  FILLER       PIC S9(7)V9    VALUE -7205759.1.
112600        03  FILLER       PIC S9(7)V9    VALUE -7205759.2.
112700        03  FILLER       PIC S9(7)V9    VALUE -7205759.9.
112800        03  FILLER       PIC S9(7)      VALUE -7205760.
112900        03  FILLER       PIC S9(7).
113000    02  FILLER.
113100        03  FILLER       PIC S9(8)      VALUE -72057594.
113200        03  FILLER       PIC S9(8)      VALUE -72057594.
113300        03  FILLER       PIC S9(8)      VALUE -72057594.
113400        03  FILLER       PIC S9(8)      VALUE -72057594.
113500        03  FILLER               PIC S9(8).
113600
113700 01 TEST-PAIR-TABLEFW   REDEFINES TEST-PAIR-DATA-FULLWD COMP.
113800    02  FILLER.
113900        03  FULLWD-TEST-VALUE-1  PIC S9V9(7)  OCCURS 3 TIMES.
114000        03  FULLWD-EXPECTED-RESULT-1  PIC S9.
114100        03  FULLWD-ACTUAL-RESULT-1    PIC S9.
114200    02  FILLER.
114300        03  FULLWD-TEST-VALUE-2  PIC S99V9(6) OCCURS 3 TIMES.
114400        03  FULLWD-EXPECTED-RESULT-2  PIC S99.
114500        03  FULLWD-ACTUAL-RESULT-2    PIC S99.
114600    02  FILLER.
114700        03  FULLWD-TEST-VALUE-3  PIC S9(3)V9(5) OCCURS 3 TIMES.
114800        03  FULLWD-EXPECTED-RESULT-3  PIC S9(3).
114900        03  FULLWD-ACTUAL-RESULT-3    PIC S9(3).
115000    02  FILLER.
115100        03  FULLWD-TEST-VALUE-4  PIC S9(4)V9(4) OCCURS 3 TIMES.
115200        03  FULLWD-EXPECTED-RESULT-4  PIC S9(4).
115300        03  FULLWD-ACTUAL-RESULT-4    PIC S9(4).
115400    02  FILLER.
115500        03  FULLWD-TEST-VALUE-5  PIC S9(5)V9(3) OCCURS 3 TIMES.
115600        03  FULLWD-EXPECTED-RESULT-5  PIC S9(5).
115700        03  FULLWD-ACTUAL-RESULT-5    PIC S9(5).
115800    02  FILLER.
115900        03  FULLWD-TEST-VALUE-6  PIC S9(6)V9(2) OCCURS 3 TIMES.
116000        03  FULLWD-EXPECTED-RESULT-6  PIC S9(6).
116100        03  FULLWD-ACTUAL-RESULT-6    PIC S9(6).
116200    02  FILLER.
116300        03  FULLWD-TEST-VALUE-7  PIC S9(7)V9    OCCURS 3 TIMES.
116400        03  FULLWD-EXPECTED-RESULT-7  PIC S9(7).
116500        03  FULLWD-ACTUAL-RESULT-7    PIC S9(7).
116600    02  FILLER.
116700        03  FULLWD-TEST-VALUE-8  PIC S9(8)      OCCURS 3 TIMES.
116800        03  FULLWD-EXPECTED-RESULT-8  PIC S9(8).
116900        03  FULLWD-ACTUAL-RESULT-8    PIC S9(8).
117000    02  FILLER.
117100        03  FULLWD-TEST-VALUE-9  PIC S9(1)V9(7) OCCURS 3 TIMES.
117200        03  FULLWD-EXPECTED-RESULT-9  PIC S9(1).
117300        03  FULLWD-ACTUAL-RESULT-9    PIC S9(1).
117400    02  FILLER.
117500        03  FULLWD-TEST-VALUE-10 PIC S9(2)V9(6) OCCURS 3 TIMES.
117600        03  FULLWD-EXPECTED-RESULT-10 PIC S9(2).
117700        03  FULLWD-ACTUAL-RESULT-10   PIC S9(2).
117800    02  FILLER.
117900        03  FULLWD-TEST-VALUE-11 PIC S9(3)V9(5) OCCURS 3 TIMES.
118000        03  FULLWD-EXPECTED-RESULT-11 PIC S9(3).
118100        03  FULLWD-ACTUAL-RESULT-11   PIC S9(3).
118200    02  FILLER.
118300        03  FULLWD-TEST-VALUE-12 PIC S9(4)V9(4) OCCURS 3 TIMES.
118400        03  FULLWD-EXPECTED-RESULT-12 PIC S9(4).
118500        03  FULLWD-ACTUAL-RESULT-12   PIC S9(4).
118600    02  FILLER.
118700        03  FULLWD-TEST-VALUE-13 PIC S9(5)V9(3) OCCURS 3 TIMES.
118800        03  FULLWD-EXPECTED-RESULT-13 PIC S9(5).
118900        03  FULLWD-ACTUAL-RESULT-13   PIC S9(5).
119000    02  FILLER.
119100        03  FULLWD-TEST-VALUE-14 PIC S9(6)V9(2) OCCURS 3 TIMES.
119200        03  FULLWD-EXPECTED-RESULT-14 PIC S9(6).
119300        03  FULLWD-ACTUAL-RESULT-14   PIC S9(6).
119400    02  FILLER.
119500        03  FULLWD-TEST-VALUE-15 PIC S9(7)V9  OCCURS 3 TIMES.
119600        03  FULLWD-EXPECTED-RESULT-15 PIC S9(7).
119700        03  FULLWD-ACTUAL-RESULT-15   PIC S9(7).
119800    02  FILLER.
119900        03  FULLWD-TEST-VALUE-16      PIC S9(8) OCCURS 3 TIMES.
120000        03  FULLWD-EXPECTED-RESULT-16 PIC S9(8).
120100        03  FULLWD-ACTUAL-RESULT-16   PIC S9(8).
120200
120300 01 TEST-PAIR-DATA-TWINFW       COMP .
120400    02  FILLER.
120500        03  FILLER    PIC S9V9(17) VALUE 7.00000000000000000.
120600        03  FILLER    PIC S9V9(17) VALUE 7.00000000000000001.
120700        03  FILLER    PIC S9V9(17) VALUE 7.99999999999999999.
120800        03  FILLER    PIC S9       VALUE 7.
120900        03  FILLER    PIC S9.
121000    02  FILLER.
121100        03  FILLER    PIC S99V9(16) VALUE 72.0000000000000000.
121200        03  FILLER    PIC S99V9(16) VALUE 72.0000000000000001.
121300        03  FILLER    PIC S99V9(16) VALUE 72.9999999999999999.
121400        03  FILLER    PIC S99       VALUE 72.
121500        03  FILLER    PIC S99.
121600    02  FILLER.
121700        03  FILLER    PIC S9(3)V9(15) VALUE 720.000000000000000.
121800        03  FILLER    PIC S9(3)V9(15) VALUE 720.000000000000001.
121900        03  FILLER    PIC S9(3)V9(15) VALUE 720.999999999999999.
122000        03  FILLER    PIC S9(3)       VALUE 720.
122100        03  FILLER    PIC S9(3).
122200    02  FILLER.
122300        03  FILLER    PIC S9(4)V9(14) VALUE 7205.00000000000000.
122400        03  FILLER    PIC S9(4)V9(14) VALUE 7205.00000000000001.
122500        03  FILLER    PIC S9(4)V9(14) VALUE 7205.99999999999999.
122600        03  FILLER    PIC S9(4)       VALUE 7205.
122700        03  FILLER    PIC S9(4).
122800    02  FILLER.
122900        03  FILLER    PIC S9(5)V9(13) VALUE 72057.0000000000000.
123000        03  FILLER    PIC S9(5)V9(13) VALUE 72057.0000000000001.
123100        03  FILLER    PIC S9(5)V9(13) VALUE 72057.9999999999999.
123200        03  FILLER    PIC S9(5)       VALUE 72057.
123300        03  FILLER    PIC S9(5).
123400    02  FILLER.
123500        03  FILLER    PIC S9(6)V9(12) VALUE 720575.000000000000.
123600        03  FILLER    PIC S9(6)V9(12) VALUE 720575.000000000001.
123700        03  FILLER    PIC S9(6)V9(12) VALUE 720575.999999999999.
123800        03  FILLER    PIC S9(6)       VALUE 720575.
123900        03  FILLER    PIC S9(6).
124000    02  FILLER.
124100        03  FILLER    PIC S9(7)V9(11) VALUE 7205759.00000000000.
124200        03  FILLER    PIC S9(7)V9(11) VALUE 7205759.00000000001.
124300        03  FILLER    PIC S9(7)V9(11) VALUE 7205759.99999999999.
124400        03  FILLER    PIC S9(7)       VALUE 7205759.
124500        03  FILLER    PIC S9(7).
124600    02  FILLER.
124700        03  FILLER    PIC S9(8)V9(10) VALUE 72057594.0000000000.
124800        03  FILLER    PIC S9(8)V9(10) VALUE 72057594.0000000001.
124900        03  FILLER    PIC S9(8)V9(10) VALUE 72057594.9999999999.
125000        03  FILLER    PIC S9(8)       VALUE 72057594.
125100        03  FILLER    PIC S9(8).
125200    02  FILLER.
125300        03  FILLER    PIC S9(9)V9(9) VALUE 720575940.000000000.
125400        03  FILLER    PIC S9(9)V9(9) VALUE 720575940.000000001.
125500        03  FILLER    PIC S9(9)V9(9) VALUE 720575940.999999999.
125600        03  FILLER    PIC S9(9)      VALUE 720575940.
125700        03  FILLER    PIC S9(9).
125800    02  FILLER.
125900        03  FILLER    PIC S9(10)V9(8) VALUE 7205759403.00000000.
126000        03  FILLER    PIC S9(10)V9(8) VALUE 7205759403.00000001.
126100        03  FILLER    PIC S9(10)V9(8) VALUE 7205759403.99999999.
126200        03  FILLER    PIC S9(10)      VALUE 7205759403.
126300        03  FILLER    PIC S9(10).
126400    02  FILLER.
126500        03  FILLER    PIC S9(11)V9(7) VALUE 72057594037.0000000.
126600        03  FILLER    PIC S9(11)V9(7) VALUE 72057594037.0000001.
126700        03  FILLER    PIC S9(11)V9(7) VALUE 72057594037.9999999.
126800        03  FILLER    PIC S9(11)      VALUE 72057594037.
126900        03  FILLER    PIC S9(11).
127000    02  FILLER.
127100        03  FILLER    PIC S9(12)V9(6) VALUE 720575940379.000000.
127200        03  FILLER    PIC S9(12)V9(6) VALUE 720575940379.000001.
127300        03  FILLER    PIC S9(12)V9(6) VALUE 720575940379.999999.
127400        03  FILLER    PIC S9(12)       VALUE 720575940379.
127500        03  FILLER    PIC S9(12).
127600    02  FILLER.
127700        03  FILLER    PIC S9(13)V9(5) VALUE 7205759403792.00000.
127800        03  FILLER    PIC S9(13)V9(5) VALUE 7205759403792.00001.
127900        03  FILLER    PIC S9(13)V9(5) VALUE 7205759403792.99999.
128000        03  FILLER    PIC S9(13)      VALUE 7205759403792.
128100        03  FILLER    PIC S9(13).
128200    02  FILLER.
128300        03  FILLER    PIC S9(14)V9(4) VALUE 72057594037927.0000.
128400        03  FILLER    PIC S9(14)V9(4) VALUE 72057594037927.0001.
128500        03  FILLER    PIC S9(14)V9(4) VALUE 72057594037927.9999.
128600        03  FILLER    PIC S9(14)      VALUE 72057594037927.
128700        03  FILLER    PIC S9(14).
128800    02  FILLER.
128900        03  FILLER    PIC S9(15)V9(3) VALUE 720575940379279.000.
129000        03  FILLER    PIC S9(15)V9(3) VALUE 720575940379279.001.
129100        03  FILLER    PIC S9(15)V9(3) VALUE 720575940379279.999.
129200        03  FILLER    PIC S9(15)      VALUE 720575940379279.
129300        03  FILLER    PIC S9(15).
129400    02  FILLER.
129500        03  FILLER    PIC S9(16)V9(2) VALUE 7205759403792790.00.
129600        03  FILLER    PIC S9(16)V9(2) VALUE 7205759403792790.01.
129700        03  FILLER    PIC S9(16)V9(2) VALUE 7205759403792790.99.
129800        03  FILLER    PIC S9(16)      VALUE 7205759403792790.
129900        03  FILLER    PIC S9(16).
130000    02  FILLER.
130100        03  FILLER    PIC S9(17)V9 VALUE 72057594037927900.0.
130200        03  FILLER    PIC S9(17)V9 VALUE 72057594037927900.1.
130300        03  FILLER    PIC S9(17)V9 VALUE 72057594037927900.9.
130400        03  FILLER    PIC S9(17)   VALUE 72057594037927900.
130500        03  FILLER    PIC S9(17).
130600    02  FILLER.
130700        03  FILLER    PIC S9(18)   VALUE 720575940379279000.
130800        03  FILLER    PIC S9(18)   VALUE 720575940379279000.
130900        03  FILLER    PIC S9(18)   VALUE 720575940379279000.
131000        03  FILLER    PIC S9(18)   VALUE 720575940379279000.
131100        03  FILLER    PIC S9(18).
131200    02  FILLER.
131300        03  FILLER    PIC S9V9(17) VALUE -7.00000000000000001.
131400        03  FILLER    PIC S9V9(17) VALUE -7.00000000000000002.
131500        03  FILLER    PIC S9V9(17) VALUE -7.99999999999999999.
131600        03  FILLER    PIC S9       VALUE -8.
131700        03  FILLER    PIC S9.
131800    02  FILLER.
131900        03  FILLER    PIC S99V9(16) VALUE -72.0000000000000001.
132000        03  FILLER    PIC S99V9(16) VALUE -72.0000000000000002.
132100        03  FILLER    PIC S99V9(16) VALUE -72.9999999999999999.
132200        03  FILLER    PIC S99        VALUE -73.
132300        03  FILLER    PIC S99.
132400    02  FILLER.
132500        03  FILLER    PIC S9(3)V9(15) VALUE -720.000000000000001.
132600        03  FILLER    PIC S9(3)V9(15) VALUE -720.000000000000002.
132700        03  FILLER    PIC S9(3)V9(15) VALUE -720.999999999999999.
132800        03  FILLER    PIC S9(3)       VALUE -721.
132900        03  FILLER    PIC S9(3).
133000    02  FILLER.
133100        03  FILLER    PIC S9(4)V9(14) VALUE -7205.00000000000001.
133200        03  FILLER    PIC S9(4)V9(14) VALUE -7205.00000000000002.
133300        03  FILLER    PIC S9(4)V9(14) VALUE -7205.99999999999999.
133400        03  FILLER    PIC S9(4)       VALUE -7206.
133500        03  FILLER    PIC S9(4).
133600    02  FILLER.
133700        03  FILLER    PIC S9(5)V9(13) VALUE -72057.0000000000001.
133800        03  FILLER    PIC S9(5)V9(13) VALUE -72057.0000000000002.
133900        03  FILLER    PIC S9(5)V9(13) VALUE -72057.9999999999999.
134000        03  FILLER    PIC S9(5)       VALUE -72058.
134100        03  FILLER    PIC S9(5).
134200    02  FILLER.
134300        03  FILLER    PIC S9(6)V9(12) VALUE -720575.000000000001.
134400        03  FILLER    PIC S9(6)V9(12) VALUE -720575.000000000002.
134500        03  FILLER    PIC S9(6)V9(12) VALUE -720575.999999999999.
134600        03  FILLER    PIC S9(6)       VALUE -720576.
134700        03  FILLER    PIC S9(6).
134800    02  FILLER.
134900        03  FILLER    PIC S9(7)V9(11)  VALUE -7205759.00000000001.
135000        03  FILLER    PIC S9(7)V9(11)  VALUE -7205759.00000000002.
135100        03  FILLER    PIC S9(7)V9(11)  VALUE -7205759.99999999999.
135200        03  FILLER    PIC S9(7)        VALUE -7205760.
135300        03  FILLER    PIC S9(7).
135400    02  FILLER.
135500        03  FILLER    PIC S9(8)V9(10)  VALUE -72057594.0000000001.
135600        03  FILLER    PIC S9(8)V9(10)  VALUE -72057594.0000000002.
135700        03  FILLER    PIC S9(8)V9(10)  VALUE -72057594.9999999999.
135800        03  FILLER    PIC S9(8)        VALUE -72057595.
135900        03  FILLER    PIC S9(8).
136000    02  FILLER.
136100        03  FILLER    PIC S9(9)V9(9)   VALUE -720575940.000000001.
136200        03  FILLER    PIC S9(9)V9(9)   VALUE -720575940.000000002.
136300        03  FILLER    PIC S9(9)V9(9)   VALUE -720575940.999999999.
136400        03  FILLER    PIC S9(9)        VALUE -720575941.
136500        03  FILLER    PIC S9(9).
136600    02  FILLER.
136700        03  FILLER    PIC S9(10)V9(8)  VALUE -7205759403.00000001.
136800        03  FILLER    PIC S9(10)V9(8)  VALUE -7205759403.00000002.
136900        03  FILLER    PIC S9(10)V9(8)  VALUE -7205759403.99999999.
137000        03  FILLER    PIC S9(10)       VALUE -7205759404.
137100        03  FILLER    PIC S9(10).
137200    02  FILLER.
137300        03  FILLER    PIC S9(11)V9(7)  VALUE -72057594037.0000001.
137400        03  FILLER    PIC S9(11)V9(7)  VALUE -72057594037.0000002.
137500        03  FILLER    PIC S9(11)V9(7)  VALUE -72057594037.9999999.
137600        03  FILLER    PIC S9(11)       VALUE -72057594038.
137700        03  FILLER    PIC S9(11).
137800    02  FILLER.
137900        03  FILLER    PIC S9(12)V9(6)  VALUE -720575940379.000001.
138000        03  FILLER    PIC S9(12)V9(6)  VALUE -720575940379.000002.
138100        03  FILLER    PIC S9(12)V9(6)  VALUE -720575940379.999999.
138200        03  FILLER    PIC S9(12)       VALUE -720575940380.
138300        03  FILLER    PIC S9(12).
138400    02  FILLER.
138500        03  FILLER    PIC S9(13)V9(5)  VALUE -7205759403792.00001.
138600        03  FILLER    PIC S9(13)V9(5)  VALUE -7205759403792.00002.
138700        03  FILLER    PIC S9(13)V9(5)  VALUE -7205759403792.99999.
138800        03  FILLER    PIC S9(13)       VALUE -7205759403793.
138900        03  FILLER    PIC S9(13).
139000    02  FILLER.
139100        03  FILLER    PIC S9(14)V9(4) VALUE -72057594037927.0001.
139200        03  FILLER    PIC S9(14)V9(4) VALUE -72057594037927.0002.
139300        03  FILLER    PIC S9(14)V9(4) VALUE -72057594037927.9999.
139400        03  FILLER    PIC S9(14)      VALUE -72057594037928.
139500        03  FILLER    PIC S9(14).
139600    02  FILLER.
139700        03  FILLER    PIC S9(15)V9(3) VALUE -720575940379279.001.
139800        03  FILLER    PIC S9(15)V9(3) VALUE -720575940379279.002.
139900        03  FILLER    PIC S9(15)V9(3) VALUE -720575940379279.999.
140000        03  FILLER    PIC S9(15)      VALUE -720575940379280.
140100        03  FILLER    PIC S9(15).
140200    02  FILLER.
140300        03  FILLER    PIC S9(16)V9(2) VALUE -7205759403792790.01.
140400        03  FILLER    PIC S9(16)V9(2) VALUE -7205759403792790.02.
140500        03  FILLER    PIC S9(16)V9(2) VALUE -7205759403792790.99.
140600        03  FILLER    PIC S9(16)      VALUE -7205759403792791.
140700        03  FILLER    PIC S9(16).
140800    02  FILLER.
140900        03  FILLER    PIC S9(17)V9    VALUE -72057594037927900.1.
141000        03  FILLER    PIC S9(17)V9    VALUE -72057594037927900.2.
141100        03  FILLER    PIC S9(17)V9    VALUE -72057594037927900.9.
141200        03  FILLER    PIC S9(17)      VALUE -72057594037927901.
141300        03  FILLER    PIC S9(17).
141400    02  FILLER.
141500        03  FILLER    PIC S9(18)  VALUE -720575940379279000.
141600        03  FILLER    PIC S9(18)  VALUE -720575940379279000.
141700        03  FILLER    PIC S9(18)  VALUE -720575940379279000.
141800        03  FILLER    PIC S9(18)  VALUE -720575940379279000.
141900        03  FILLER    PIC S9(18).
142000
142100 01 TEST-PAIR-TABLETF   REDEFINES TEST-PAIR-DATA-TWINFW COMP.
142200    02  FILLER.
142300        03  TWINFW-TEST-VALUE-1  PIC S9V9(17) OCCURS 3 TIMES.
142400        03  TWINFW-EXPECTED-RESULT-1  PIC S9.
142500        03  TWINFW-ACTUAL-RESULT-1    PIC S9.
142600    02  FILLER.
142700        03  TWINFW-TEST-VALUE-2  PIC S99V9(16) OCCURS 3 TIMES.
142800        03  TWINFW-EXPECTED-RESULT-2  PIC S99.
142900        03  TWINFW-ACTUAL-RESULT-2    PIC S99.
143000    02  FILLER.
143100        03  TWINFW-TEST-VALUE-3  PIC S9(3)V9(15) OCCURS 3 TIMES.
143200        03  TWINFW-EXPECTED-RESULT-3  PIC S9(3).
143300        03  TWINFW-ACTUAL-RESULT-3    PIC S9(3).
143400    02  FILLER.
143500        03  TWINFW-TEST-VALUE-4  PIC S9(4)V9(14) OCCURS 3 TIMES.
143600        03  TWINFW-EXPECTED-RESULT-4  PIC S9(4).
143700        03  TWINFW-ACTUAL-RESULT-4    PIC S9(4).
143800    02  FILLER.
143900        03  TWINFW-TEST-VALUE-5  PIC S9(5)V9(13) OCCURS 3 TIMES.
144000        03  TWINFW-EXPECTED-RESULT-5  PIC S9(5).
144100        03  TWINFW-ACTUAL-RESULT-5    PIC S9(5).
144200    02  FILLER.
144300        03  TWINFW-TEST-VALUE-6  PIC S9(6)V9(12) OCCURS 3 TIMES.
144400        03  TWINFW-EXPECTED-RESULT-6  PIC S9(6).
144500        03  TWINFW-ACTUAL-RESULT-6    PIC S9(6).
144600    02  FILLER.
144700        03  TWINFW-TEST-VALUE-7  PIC S9(7)V9(11)  OCCURS 3 TIMES.
144800        03  TWINFW-EXPECTED-RESULT-7  PIC S9(7).
144900        03  TWINFW-ACTUAL-RESULT-7    PIC S9(7).
145000    02  FILLER.
145100        03  TWINFW-TEST-VALUE-8  PIC S9(8)V9(10) OCCURS 3 TIMES.
145200        03  TWINFW-EXPECTED-RESULT-8  PIC S9(8).
145300        03  TWINFW-ACTUAL-RESULT-8    PIC S9(8).
145400    02  FILLER.
145500        03  TWINFW-TEST-VALUE-9  PIC S9(9)V9(9)  OCCURS 3 TIMES.
145600        03  TWINFW-EXPECTED-RESULT-9  PIC S9(9).
145700        03  TWINFW-ACTUAL-RESULT-9    PIC S9(9).
145800    02  FILLER.
145900        03  TWINFW-TEST-VALUE-10 PIC S9(10)V9(8) OCCURS 3 TIMES.
146000        03  TWINFW-EXPECTED-RESULT-10 PIC S9(10).
146100        03  TWINFW-ACTUAL-RESULT-10   PIC S9(10).
146200    02  FILLER.
146300        03  TWINFW-TEST-VALUE-11 PIC S9(11)V9(7) OCCURS 3 TIMES.
146400        03  TWINFW-EXPECTED-RESULT-11 PIC S9(11).
146500        03  TWINFW-ACTUAL-RESULT-11   PIC S9(11).
146600    02  FILLER.
146700        03  TWINFW-TEST-VALUE-12 PIC S9(12)V9(6) OCCURS 3 TIMES.
146800        03  TWINFW-EXPECTED-RESULT-12 PIC S9(12).
146900        03  TWINFW-ACTUAL-RESULT-12   PIC S9(12).
147000    02  FILLER.
147100        03  TWINFW-TEST-VALUE-13 PIC S9(13)V9(5)  OCCURS 3 TIMES.
147200        03  TWINFW-EXPECTED-RESULT-13 PIC S9(13).
147300        03  TWINFW-ACTUAL-RESULT-13   PIC S9(13).
147400    02  FILLER.
147500        03  TWINFW-TEST-VALUE-14 PIC S9(14)V9(4)  OCCURS 3 TIMES.
147600        03  TWINFW-EXPECTED-RESULT-14 PIC S9(14).
147700        03  TWINFW-ACTUAL-RESULT-14   PIC S9(14).
147800    02  FILLER.
147900        03  TWINFW-TEST-VALUE-15 PIC S9(15)V9(3)  OCCURS 3 TIMES.
148000        03  TWINFW-EXPECTED-RESULT-15 PIC S9(15).
148100        03  TWINFW-ACTUAL-RESULT-15   PIC S9(15).
148200    02  FILLER.
148300        03  TWINFW-TEST-VALUE-16 PIC S9(16)V99    OCCURS 3 TIMES.
148400        03  TWINFW-EXPECTED-RESULT-16 PIC S9(16).
148500        03  TWINFW-ACTUAL-RESULT-16   PIC S9(16).
148600    02  FILLER.
148700        03  TWINFW-TEST-VALUE-17 PIC S9(17)V9     OCCURS 3 TIMES.
148800        03  TWINFW-EXPECTED-RESULT-17 PIC S9(17).
148900        03  TWINFW-ACTUAL-RESULT-17   PIC S9(17).
149000    02  FILLER.
149100        03  TWINFW-TEST-VALUE-18 PIC S9(18)       OCCURS 3 TIMES.
149200        03  TWINFW-EXPECTED-RESULT-18 PIC S9(18).
149300        03  TWINFW-ACTUAL-RESULT-18   PIC S9(18).
149400    02  FILLER.
149500        03  TWINFW-TEST-VALUE-19 PIC S9V9(17)     OCCURS 3 TIMES.
149600        03  TWINFW-EXPECTED-RESULT-19 PIC S9.
149700        03  TWINFW-ACTUAL-RESULT-19   PIC S9.
149800    02  FILLER.
149900        03  TWINFW-TEST-VALUE-20 PIC S9(2)V9(16)  OCCURS 3 TIMES.
150000        03  TWINFW-EXPECTED-RESULT-20 PIC S9(2).
150100        03  TWINFW-ACTUAL-RESULT-20   PIC S9(2).
150200    02  FILLER.
150300        03  TWINFW-TEST-VALUE-21 PIC S9(3)V9(15)  OCCURS 3 TIMES.
150400        03  TWINFW-EXPECTED-RESULT-21 PIC S9(3).
150500        03  TWINFW-ACTUAL-RESULT-21   PIC S9(3).
150600    02  FILLER.
150700        03  TWINFW-TEST-VALUE-22 PIC S9(4)V9(14)  OCCURS 3 TIMES.
150800        03  TWINFW-EXPECTED-RESULT-22 PIC S9(4).
150900        03  TWINFW-ACTUAL-RESULT-22   PIC S9(4).
151000    02  FILLER.
151100        03  TWINFW-TEST-VALUE-23 PIC S9(5)V9(13)  OCCURS 3 TIMES.
151200        03  TWINFW-EXPECTED-RESULT-23 PIC S9(5).
151300        03  TWINFW-ACTUAL-RESULT-23   PIC S9(5).
151400    02  FILLER.
151500        03  TWINFW-TEST-VALUE-24 PIC S9(6)V9(12)  OCCURS 3 TIMES.
151600        03  TWINFW-EXPECTED-RESULT-24 PIC S9(6).
151700        03  TWINFW-ACTUAL-RESULT-24   PIC S9(6).
151800    02  FILLER.
151900        03  TWINFW-TEST-VALUE-25 PIC S9(7)V9(11)  OCCURS 3 TIMES.
152000        03  TWINFW-EXPECTED-RESULT-25 PIC S9(7).
152100        03  TWINFW-ACTUAL-RESULT-25   PIC S9(7).
152200    02  FILLER.
152300        03  TWINFW-TEST-VALUE-26 PIC S9(8)V9(10) OCCURS 3 TIMES.
152400        03  TWINFW-EXPECTED-RESULT-26 PIC S9(8).
152500        03  TWINFW-ACTUAL-RESULT-26   PIC S9(8).
152600    02  FILLER.
152700        03  TWINFW-TEST-VALUE-27 PIC S9(9)V9(9)  OCCURS 3 TIMES.
152800        03  TWINFW-EXPECTED-RESULT-27 PIC S9(9).
152900        03  TWINFW-ACTUAL-RESULT-27   PIC S9(9).
153000    02  FILLER.
153100        03  TWINFW-TEST-VALUE-28 PIC S9(10)V9(8) OCCURS 3 TIMES.
153200        03  TWINFW-EXPECTED-RESULT-28 PIC S9(10).
153300        03  TWINFW-ACTUAL-RESULT-28   PIC S9(10).
153400    02  FILLER.
153500        03  TWINFW-TEST-VALUE-29 PIC S9(11)V9(7) OCCURS 3 TIMES.
153600        03  TWINFW-EXPECTED-RESULT-29 PIC S9(11).
153700        03  TWINFW-ACTUAL-RESULT-29   PIC S9(11).
153800    02  FILLER.
153900        03  TWINFW-TEST-VALUE-30 PIC S9(12)V9(6) OCCURS 3 TIMES.
154000        03  TWINFW-EXPECTED-RESULT-30 PIC S9(12).
154100        03  TWINFW-ACTUAL-RESULT-30   PIC S9(12).
154200    02  FILLER.
154300        03  TWINFW-TEST-VALUE-31 PIC S9(13)V9(5) OCCURS 3 TIMES.
154400        03  TWINFW-EXPECTED-RESULT-31 PIC S9(13).
154500        03  TWINFW-ACTUAL-RESULT-31   PIC S9(13).
154600    02  FILLER.
154700        03  TWINFW-TEST-VALUE-32 PIC S9(14)V9(4) OCCURS 3 TIMES.
154800        03  TWINFW-EXPECTED-RESULT-32 PIC S9(14).
154900        03  TWINFW-ACTUAL-RESULT-32   PIC S9(14).
155000    02  FILLER.
155100        03  TWINFW-TEST-VALUE-33 PIC S9(15)V9(3) OCCURS 3 TIMES.
155200        03  TWINFW-EXPECTED-RESULT-33 PIC S9(15).
155300        03  TWINFW-ACTUAL-RESULT-33   PIC S9(15).
155400    02  FILLER.
155500        03  TWINFW-TEST-VALUE-34 PIC S9(16)V99   OCCURS 3 TIMES.
155600        03  TWINFW-EXPECTED-RESULT-34 PIC S9(16).
155700        03  TWINFW-ACTUAL-RESULT-34   PIC S9(16).
155800    02  FILLER.
155900        03  TWINFW-TEST-VALUE-35 PIC S9(17)V9    OCCURS 3 TIMES.
156000        03  TWINFW-EXPECTED-RESULT-35 PIC S9(17).
156100        03  TWINFW-ACTUAL-RESULT-35   PIC S9(17).
156200    02  FILLER.
156300        03  TWINFW-TEST-VALUE-36 PIC S9(18)      OCCURS 3 TIMES.
156400        03  TWINFW-EXPECTED-RESULT-36 PIC S9(18).
156500        03  TWINFW-ACTUAL-RESULT-36   PIC S9(18).
156600
156700 01  Structure.
156800     25  Part-A.
156900         49  element                PIC S999V9 COMP-3.
157000     25  Part-B.
157100         49  element                PIC S999V9 COMP-3.
157200
157300 01  FILLER.
157400     49  z-sync-item   PIC S9(3)V9  DISPLAY SYNC  VALUE 546.9.
157500     49  h-sync-item   PIC S9(4)V9  COMP    SYNC.
157600     49  f-sync-item   PIC S9(8)V9  COMP    SYNC.
157700     49  ff-sync-item  PIC S9(17)V9 COMP    SYNC.
157800     49  p-sync-item   PIC S9(3)V9  COMP-3  SYNC.
157900     49  e-sync-item                COMP-1  SYNC.
158000     49  d-sync-item                COMP-2  SYNC.
158100
158200 01  Sb      PIC S9(4) COMP-4 VALUE 8.
158300 01  fail-count   PIC S9(4) COMP-4.
158300 01  TOTAL-FAIL   PIC S9(4) COMP-4.
158400 01  pass-count   PIC S9(4) COMP-4.
158500 01  tot-count    PIC S9(4) COMP-4.
158600 01  test-type    PIC X9(18).
158700
158800 77  LEADING-SIGN-ITEM      PIC S999V9
158900                             SIGN IS LEADING SEPARATE CHARACTER.
159000 77  TRAILING-SIGN-ITEM     PIC S999V9
159100                             SIGN IS TRAILING SEPARATE CHARACTER.
159200 77  Z-SYNC-RES   PIC S999V9 DISPLAY  SYNC.
159300 77  H-SYNC-RES   PIC S9(4)V9  COMP   SYNC.
159400 77  F-SYNC-RES   PIC S9(8)V9  COMP   SYNC.
159500 77  FF-SYNC-RES  PIC S9(17)V9  COMP   SYNC.
159600 77  P-SYNC-RES   PIC S999V9 COMP-3  SYNC.
159700 77  E-SYNC-RES   COMP-1, SYNC.
159800 77  D-SYNC-RES   COMP-2, SYNC.
159900 77  Z-SYNC-EXP   PIC S999V9 DISPLAY  SYNC.
160000 77  H-SYNC-EXP   PIC S9(4)V9  COMP   SYNC.
160100 77  F-SYNC-EXP   PIC S9(8)V9  COMP   SYNC.
160200 77  FF-SYNC-EXP  PIC S9(17)V9  COMP   SYNC.
160300 77  P-SYNC-EXP   PIC S999V9 COMP-3  SYNC.
160400 77  E-SYNC-EXP   COMP-1  SYNC.
160500 77  D-SYNC-EXP   COMP-2  SYNC.
160600 77  NUM-OF-TEST   PIC S9(4)  COMP .
160700 77  NUM-COMP-1    PIC S9(4)  COMP .
160800 77  NUM-COMP-2    PIC S9(4)  COMP .
160900 77  NUM-COMP-3    PIC S9(4)  COMP .
161000 77  NUM-DISPLAY   PIC S9(4)  COMP .
161100 77  NUM-HALFWD    PIC S9(4)  COMP .
161200 77  NUM-FULLWD    PIC S9(4)  COMP .
161300 77  NUM-TWINFW    PIC S9(4)  COMP .
161400 77  II       PIC S9(4)  COMP .
161500 77  JJ       PIC S9(4)  COMP .
161600 77  ANY-FAILED    PIC S9(4)  COMP .
161700 77  ACTUAL-RES-L  PIC S9(3)V9 SIGN LEADING SEPARATE CHARACTER.
161800 77  LEAD-EXP-VAL  PIC S9(3)V9 SIGN LEADING SEPARATE CHARACTER.
161900 77  ACTUAL-RES-T  PIC S9(3)V9 SIGN TRAILING SEPARATE CHARACTER.
162000 77  TRAIL-EXP-VAL PIC S9(3)V9 SIGN TRAILING SEPARATE CHARACTER.
162100 77  QUALIFIED-COMP-3-RES PIC S999V9 COMP-3.
162200 77  QUALIFIED-COMP-3-EXP PIC S999V9 COMP-3.
162300 77  ACTUAL-RESULT-C1 COMP-1.
162400 77  ACTUAL-RESULT-C2 COMP-2.
162500
162600 PROCEDURE DIVISION.
162700*----------------------------------------------------------------
162800*02100000    Main program without subroutines       |f|
162900*----------------------------------------------------------------
163000     DISPLAY "<>>>>FLOW MSG: FNINT01 BEGIN EXECUTION";
163100     PERFORM PARA-FNINT01;
165400     MOVE ZERO TO SORT-RETURN, SORT-CORE-SIZE, SORT-FILE-SIZE,
165500         SORT-MODE-SIZE;
165600     MOVE "SYSOUT  " TO SORT-MESSAGE;
165700     MOVE "SORT" TO test-type
165800     SORT SD-FILE
165900         ASCENDING KEY sd-key,
166000         INPUT PROCEDURE IS arg-SORT-Input,
166100         OUTPUT PROCEDURE IS arg-SORT-Output;
166200     IF  SORT-RETURN NOT = ZERO  THEN
166300         COMPUTE expected = actual + 99;
166400         PERFORM universal-ver;
166500         DISPLAY "*** SORT failed with RC= " SORT-RETURN
166600     END-IF;
163200     PERFORM 000-test00;
163300     PERFORM 000-test01;
163400     PERFORM 000-test02;
163500     PERFORM 000-test03;
163600     PERFORM 000-test04;
163700     PERFORM 000-test05;
163800     PERFORM 000-test06;
163900     PERFORM 000-test07;
164000     PERFORM 000-test08;
164100     PERFORM 000-test09;
164200     PERFORM 000-test10;
164300     PERFORM 000-test11;
164400     PERFORM 000-test12;
164500     PERFORM 000-test13;
164600     PERFORM 000-test14;
164700     PERFORM 000-test15;
164800     PERFORM 000-test16;
164900     PERFORM 000-test17;
165000     PERFORM 000-test18;
165100     PERFORM 000-test19;
165200     PERFORM 000-test20;
165300     PERFORM 000-test21;
           COMPUTE TOTAL-FAIL = TOTAL-FAIL + FAIL-COUNT;
166700     COMPUTE tot-count = TOTAL-FAIL + pass-count;
166800       IF fail-count = 0    THEN
               MOVE "P" TO PGM-STS
166900         DISPLAY "FNINT01 SUCCESS";
167000       ELSE
167100         DISPLAY "FNINT01 FAILURE";
167200       END-IF;
167300     DISPLAY "<>>>>FLOW MSG: FNINT01 END EXECUTION";
167400     DISPLAY " failed  "  TOTAL-FAIL;
167500     DISPLAY " passed  "  pass-count;
167600     DISPLAY " total tests "  tot-count;
           CALL  "ITRAP100" USING PGM-ID PGM-STS
167700     STOP RUN.
167800*--------------------- TEST BEGINNING ---------------------------
167900*11314200        SD                                 |f|
168000*----------------------------------------------------------------
168100
168200 arg-SORT-Input.
168300     RELEASE sd-record.
168400 arg-SORT-Output.
168500      RETURN SD-FILE
168600       AT END
168700         DISPLAY "*** No records sorted ***"
168800         COMPUTE expected = actual + 99;
168900       NOT AT END
169000         COMPUTE sd-field = 1;
169100         COMPUTE expected = 1;
169200         COMPUTE actual = FUNCTION INTEGER(sd-field)
169300         PERFORM universal-ver;
169400
169500         RETURN SD-FILE
169600           AT END
169700             CONTINUE
169800           NOT AT END
169900             DISPLAY "*** Too many records sorted ***"
170000             COMPUTE expected = actual + 99;
170100             PERFORM universal-ver;
170200         END-RETURN;
170300     END-RETURN.
170400
170500 PARA-FNINT01.
170600*-----------------------------------------------------------------
170700*11301200                  COMP-1  (SHORT FLOATING)
170800*11302000      Level:                               | |
170900*11302300        49 (elementary item in structure)  |f|
171000*11302600        77 (elementary)                    |f|
171100*11304100          Fixed-length table:              | |
171200*11304110            literal:                       | |
171300*11304113              Subscript = 1                |f|
171400*11304114              Subscript = length/2 & > 1   |f|
171500*11304115              Subscript = length - 1       |f|
171600*11304116              Subscript = length           |f|
171700*11304120            data-name [¤+|-‡ integer]:     | |
171800*11304123              Subscript = 1                |f|
171900*11304124              Subscript = length/2 & > 1   |f|
172000*11304125              Subscript = length - 1       |f|
172100*11304126              Subscript = length           |f|
172200*11313000      OCCURS .. :                          | |
172300*11313100        integer-2 TIMES                    | |
172400*11313101          (fixed-length table)             |f|
172500*11314300        WORKING-STORAGE                    |f|
172600*------------------------------------------------------
172700*    variables used by FNINT01
172800*TEST-VALUE        value passed to the INTEGER function
172900*EXPECTED-RESULTS  the table accesed to look-up expected output
173000*ACTUAL-RESULT     holds the actual result from INTEGER
173100*NUM-OF-TEST       the number of tests in this run
173200*------------------------------------------------------
173300     MOVE 0 TO ANY-FAILED;
173400     MOVE 15 TO NUM-COMP-1;
173500     MOVE 33 TO NUM-COMP-2;
173600     MOVE 30 TO NUM-COMP-3;
173700     MOVE 30 TO NUM-DISPLAY;
173800     MOVE 8  TO NUM-HALFWD;
173900     MOVE 16 TO NUM-FULLWD;
174000     MOVE 36 TO NUM-TWINFW;
174100     MOVE 0 TO pass-count;
174200     MOVE 0 TO fail-count;
174300     MOVE NUM-COMP-1 TO NUM-OF-TEST;
174400      PERFORM VARYING II FROM 1 BY 1 UNTIL II = NUM-OF-TEST + 1;
174500        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
174600          COMPUTE
174700               ACTUAL-RESULT-C1 =
174800               FUNCTION INTEGER(TEST-VALUEC1(II, JJ));
174900          IF ACTUAL-RESULT-C1 =
175000                     EXPECTED-RESULTSC1(II) THEN
175100             ADD 1 TO pass-count
175200          ELSE
175300             DISPLAY "COMP-1 TEST " II "," JJ " FAILED:"
175400             DISPLAY "test-value =      " TEST-VALUEC1(II, JJ)
175500             DISPLAY "expected-result = " EXPECTED-RESULTSC1(II)
175600             DISPLAY "actual-result =   " ACTUAL-RESULT-C1
175700             DISPLAY " "
175800             ADD 1 TO fail-count
175900             END-IF
176000        END-PERFORM;
176100      END-PERFORM;
176200
176300       IF fail-count NOT = ZERO AND
176400       pass-count NOT = NUM-OF-TEST * 3
176500       THEN
176600         DISPLAY "COMP-1 FAILURE";
176700         MOVE 1 TO ANY-FAILED;
176800       END-IF;
176900*-----------------------------------------------------------------
177000* 11301300                  COMP-2  (LONG FLOATING)
177100*-----------------------------------------------------------------
177200     MOVE NUM-COMP-2 TO NUM-OF-TEST;
177300      PERFORM VARYING II FROM 2 BY 1 UNTIL II = NUM-OF-TEST + 2;
177400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
177500          COMPUTE
177600               ACTUAL-RESULT-C2 =
177700               FUNCTION INTEGER(TEST-VALUEC2(II - 1, JJ));
177800          IF ACTUAL-RESULT-C2 = EXPECTED-RESULTSC2(II - 1)
177900           THEN
178000             ADD 1 TO pass-count
178100          ELSE
178200             DISPLAY "COMP-2 TEST " II "," JJ " FAILED:"
178300             DISPLAY "test-value = " TEST-VALUEC2(II - 1, JJ)
178400          DISPLAY "expected-result =  " EXPECTED-RESULTSC2(II - 1)
178500             DISPLAY "actual-result = " ACTUAL-RESULT-C2
178600             DISPLAY " "
178700             ADD 1 TO fail-count
178800          END-IF
178900        END-PERFORM;
179000      END-PERFORM;
179100
179200       IF fail-count NOT = ZERO AND
179300       pass-count NOT = NUM-OF-TEST * 3
179400       THEN
179500         DISPLAY "COMP-2 FAILURE";
179600         MOVE 1 TO ANY-FAILED;
179700       END-IF;
179800
179900*-----------------------------------------------------------------
180000* 11301400          COMP-3/PACKED-DECIMAL:           | |
180100*-----------------------------------------------------------------
180200     MOVE NUM-COMP-3 TO NUM-OF-TEST;
180300     MOVE 1 TO II;
180400
180500*  START OF TEST 1
180600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
180700          COMPUTE
180800               COMP-3-ACTUAL-RESULT-1 = FUNCTION
180900                  INTEGER(COMP-3-TEST-VALUE-1(JJ));
181000          IF COMP-3-ACTUAL-RESULT-1 =
181100                  COMP-3-EXPECTED-RESULT-1 THEN
181200             ADD 1 TO pass-count
181300          ELSE
181400         DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
181500         DISPLAY "test-value = " COMP-3-TEST-VALUE-1(JJ)
181600         DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-1
181700         DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-1
181800         DISPLAY " "
181900             ADD 1 TO fail-count
182000          END-IF;
182100       END-PERFORM;
182200       ADD 1 TO II;
182300*  START OF TEST 2
182400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
182500          COMPUTE
182600               COMP-3-ACTUAL-RESULT-2 = FUNCTION
182700                  INTEGER(COMP-3-TEST-VALUE-2(JJ));
182800          IF COMP-3-ACTUAL-RESULT-2 =
182900                  COMP-3-EXPECTED-RESULT-2 THEN
183000             ADD 1 TO pass-count
183100          ELSE
183200         DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
183300         DISPLAY "test-value = " COMP-3-TEST-VALUE-2(JJ)
183400         DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-2
183500         DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-2
183600         DISPLAY " "
183700             ADD 1 TO fail-count
183800          END-IF;
183900       END-PERFORM;
184000       ADD 1 TO II;
184100*  START OF TEST 3
184200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
184300          COMPUTE
184400               COMP-3-ACTUAL-RESULT-3 = FUNCTION
184500                  INTEGER(COMP-3-TEST-VALUE-3(JJ));
184600          IF COMP-3-ACTUAL-RESULT-3 =
184700                  COMP-3-EXPECTED-RESULT-3 THEN
184800             ADD 1 TO pass-count
184900          ELSE
185000         DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
185100         DISPLAY "test-value = " COMP-3-TEST-VALUE-3(JJ)
185200         DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-3
185300         DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-3
185400         DISPLAY " "
185500             ADD 1 TO fail-count
185600          END-IF;
185700       END-PERFORM;
185800       ADD 1 TO II;
185900*  START OF TEST 4
186000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
186100          COMPUTE
186200               COMP-3-ACTUAL-RESULT-4 = FUNCTION
186300                  INTEGER(COMP-3-TEST-VALUE-4(JJ));
186400          IF COMP-3-ACTUAL-RESULT-4 =
186500                  COMP-3-EXPECTED-RESULT-4 THEN
186600             ADD 1 TO pass-count
186700          ELSE
186800         DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
186900         DISPLAY "test-value = " COMP-3-TEST-VALUE-4(JJ)
187000         DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-4
187100         DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-4
187200         DISPLAY " "
187300             ADD 1 TO fail-count
187400          END-IF;
187500       END-PERFORM;
187600       ADD 1 TO II;
187700*  START OF TEST 5
187800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
187900          COMPUTE
188000               COMP-3-ACTUAL-RESULT-5 = FUNCTION
188100                  INTEGER(COMP-3-TEST-VALUE-5(JJ));
188200          IF COMP-3-ACTUAL-RESULT-5 =
188300                  COMP-3-EXPECTED-RESULT-5 THEN
188400             ADD 1 TO pass-count
188500          ELSE
188600         DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
188700         DISPLAY "test-value = " COMP-3-TEST-VALUE-5(JJ)
188800         DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-5
188900         DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-5
189000         DISPLAY " "
189100             ADD 1 TO fail-count
189200          END-IF;
189300       END-PERFORM;
189400       ADD 1 TO II;
189500*  START OF TEST 6
189600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
189700          COMPUTE
189800               COMP-3-ACTUAL-RESULT-6 = FUNCTION
189900                  INTEGER(COMP-3-TEST-VALUE-6(JJ));
190000          IF COMP-3-ACTUAL-RESULT-6 =
190100                  COMP-3-EXPECTED-RESULT-6 THEN
190200             ADD 1 TO pass-count
190300          ELSE
190400         DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
190500         DISPLAY "test-value = " COMP-3-TEST-VALUE-6(JJ)
190600         DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-6
190700         DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-6
190800         DISPLAY " "
190900             ADD 1 TO fail-count
191000          END-IF;
191100       END-PERFORM;
191200       ADD 1 TO II;
191300*  START OF TEST 7
191400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
191500          COMPUTE
191600               COMP-3-ACTUAL-RESULT-7 = FUNCTION
191700                  INTEGER(COMP-3-TEST-VALUE-7(JJ));
191800          IF COMP-3-ACTUAL-RESULT-7 =
191900                  COMP-3-EXPECTED-RESULT-7 THEN
192000             ADD 1 TO pass-count
192100          ELSE
192200         DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
192300         DISPLAY "test-value = " COMP-3-TEST-VALUE-7(JJ)
192400         DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-7
192500         DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-7
192600         DISPLAY " "
192700             ADD 1 TO fail-count
192800          END-IF;
192900       END-PERFORM;
193000       ADD 1 TO II;
193100*  START OF TEST 8
193200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
193300          COMPUTE
193400               COMP-3-ACTUAL-RESULT-8 = FUNCTION
193500                  INTEGER(COMP-3-TEST-VALUE-8(JJ));
193600          IF COMP-3-ACTUAL-RESULT-8 =
193700                  COMP-3-EXPECTED-RESULT-8 THEN
193800             ADD 1 TO pass-count
193900          ELSE
194000         DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
194100         DISPLAY "test-value = " COMP-3-TEST-VALUE-8(JJ)
194200         DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-8
194300         DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-8
194400         DISPLAY " "
194500             ADD 1 TO fail-count
194600          END-IF;
194700       END-PERFORM;
194800       ADD 1 TO II;
194900*  START OF TEST 9
195000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
195100          COMPUTE
195200               COMP-3-ACTUAL-RESULT-9 = FUNCTION
195300                  INTEGER(COMP-3-TEST-VALUE-9(JJ));
195400          IF COMP-3-ACTUAL-RESULT-9 =
195500                  COMP-3-EXPECTED-RESULT-9 THEN
195600             ADD 1 TO pass-count
195700          ELSE
195800         DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
195900         DISPLAY "test-value = " COMP-3-TEST-VALUE-9(JJ)
196000         DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-9
196100         DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-9
196200         DISPLAY " "
196300             ADD 1 TO fail-count
196400          END-IF;
196500       END-PERFORM;
196600       ADD 1 TO II;
196700*  START OF TEST 10
196800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
196900          COMPUTE
197000               COMP-3-ACTUAL-RESULT-10 = FUNCTION
197100                  INTEGER(COMP-3-TEST-VALUE-10(JJ));
197200          IF COMP-3-ACTUAL-RESULT-10 =
197300                  COMP-3-EXPECTED-RESULT-10 THEN
197400            ADD 1 TO pass-count
197500          ELSE
197600        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
197700        DISPLAY "test-value = " COMP-3-TEST-VALUE-10(JJ)
197800        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-10
197900        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-10
198000        DISPLAY " "
198100            ADD 1 TO fail-count
198200          END-IF;
198300       END-PERFORM;
198400       ADD 1 TO II;
198500*  START OF TEST 11
198600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
198700          COMPUTE
198800               COMP-3-ACTUAL-RESULT-11 = FUNCTION
198900                  INTEGER(COMP-3-TEST-VALUE-11(JJ));
199000          IF COMP-3-ACTUAL-RESULT-11 =
199100                  COMP-3-EXPECTED-RESULT-11 THEN
199200            ADD 1 TO pass-count
199300          ELSE
199400        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
199500        DISPLAY "test-value = " COMP-3-TEST-VALUE-11(JJ)
199600        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-11
199700        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-11
199800        DISPLAY " "
199900            ADD 1 TO fail-count
200000          END-IF;
200100       END-PERFORM;
200200       ADD 1 TO II;
200300*  START OF TEST 12
200400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
200500          COMPUTE
200600               COMP-3-ACTUAL-RESULT-12 = FUNCTION
200700                  INTEGER(COMP-3-TEST-VALUE-12(JJ));
200800          IF COMP-3-ACTUAL-RESULT-12 =
200900                  COMP-3-EXPECTED-RESULT-12 THEN
201000            ADD 1 TO pass-count
201100          ELSE
201200        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
201300        DISPLAY "test-value = " COMP-3-TEST-VALUE-12(JJ)
201400        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-12
201500        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-12
201600        DISPLAY " "
201700            ADD 1 TO fail-count
201800          END-IF;
201900       END-PERFORM;
202000       ADD 1 TO II;
202100*  START OF TEST 13
202200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
202300          COMPUTE
202400               COMP-3-ACTUAL-RESULT-13 = FUNCTION
202500                  INTEGER(COMP-3-TEST-VALUE-13(JJ));
202600          IF COMP-3-ACTUAL-RESULT-13 =
202700                  COMP-3-EXPECTED-RESULT-13 THEN
202800            ADD 1 TO pass-count
202900          ELSE
203000        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
203100        DISPLAY "test-value = " COMP-3-TEST-VALUE-13(JJ)
203200        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-13
203300        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-13
203400        DISPLAY " "
203500            ADD 1 TO fail-count
203600          END-IF;
203700       END-PERFORM;
203800       ADD 1 TO II;
203900*  START OF TEST 14
204000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
204100          COMPUTE
204200               COMP-3-ACTUAL-RESULT-14 = FUNCTION
204300                  INTEGER(COMP-3-TEST-VALUE-14(JJ));
204400          IF COMP-3-ACTUAL-RESULT-14 =
204500                  COMP-3-EXPECTED-RESULT-14 THEN
204600            ADD 1 TO pass-count
204700          ELSE
204800        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
204900        DISPLAY "test-value = " COMP-3-TEST-VALUE-14(JJ)
205000        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-14
205100        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-14
205200        DISPLAY " "
205300            ADD 1 TO fail-count
205400          END-IF;
205500       END-PERFORM;
205600       ADD 1 TO II;
205700*  START OF TEST 15
205800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
205900          COMPUTE
206000               COMP-3-ACTUAL-RESULT-15 = FUNCTION
206100                  INTEGER(COMP-3-TEST-VALUE-15(JJ));
206200          IF COMP-3-ACTUAL-RESULT-15 =
206300                  COMP-3-EXPECTED-RESULT-15 THEN
206400            ADD 1 TO pass-count
206500          ELSE
206600        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
206700        DISPLAY "test-value = " COMP-3-TEST-VALUE-15(JJ)
206800        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-15
206900        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-15
207000        DISPLAY " "
207100            ADD 1 TO fail-count
207200          END-IF;
207300       END-PERFORM;
207400       ADD 1 TO II;
207500*  START OF TEST 16
207600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
207700          COMPUTE
207800               COMP-3-ACTUAL-RESULT-16 = FUNCTION
207900                  INTEGER(COMP-3-TEST-VALUE-16(JJ));
208000          IF COMP-3-ACTUAL-RESULT-16 =
208100                  COMP-3-EXPECTED-RESULT-16 THEN
208200            ADD 1 TO pass-count
208300          ELSE
208400        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
208500        DISPLAY "test-value = " COMP-3-TEST-VALUE-16(JJ)
208600        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-16
208700        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-16
208800        DISPLAY " "
208900            ADD 1 TO fail-count
209000          END-IF;
209100       END-PERFORM;
209200       ADD 1 TO II;
209300*  START OF TEST 17
209400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
209500          COMPUTE
209600               COMP-3-ACTUAL-RESULT-17 = FUNCTION
209700                  INTEGER(COMP-3-TEST-VALUE-17(JJ));
209800          IF COMP-3-ACTUAL-RESULT-17 =
209900                  COMP-3-EXPECTED-RESULT-17 THEN
210000            ADD 1 TO pass-count
210100          ELSE
210200        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
210300        DISPLAY "test-value = " COMP-3-TEST-VALUE-17(JJ)
210400        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-17
210500        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-17
210600        DISPLAY " "
210700            ADD 1 TO fail-count
210800          END-IF;
210900       END-PERFORM;
211000       ADD 1 TO II;
211100*  START OF TEST 18
211200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
211300          COMPUTE
211400               COMP-3-ACTUAL-RESULT-18 = FUNCTION
211500                  INTEGER(COMP-3-TEST-VALUE-18(JJ));
211600          IF COMP-3-ACTUAL-RESULT-18 =
211700                  COMP-3-EXPECTED-RESULT-18 THEN
211800            ADD 1 TO pass-count
211900          ELSE
212000        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
212100        DISPLAY "test-value = " COMP-3-TEST-VALUE-18(JJ)
212200        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-18
212300        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-18
212400        DISPLAY " "
212500            ADD 1 TO fail-count
212600          END-IF;
212700       END-PERFORM;
212800       ADD 1 TO II;
212900*  START OF TEST 19
213000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
213100          COMPUTE
213200               COMP-3-ACTUAL-RESULT-19 = FUNCTION
213300                  INTEGER(COMP-3-TEST-VALUE-19(JJ));
213400          IF COMP-3-ACTUAL-RESULT-19 =
213500                  COMP-3-EXPECTED-RESULT-19 THEN
213600            ADD 1 TO pass-count
213700          ELSE
213800        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
213900        DISPLAY "test-value = " COMP-3-TEST-VALUE-19(JJ)
214000        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-19
214100        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-19
214200        DISPLAY " "
214300            ADD 1 TO fail-count
214400          END-IF;
214500       END-PERFORM;
214600       ADD 1 TO II;
214700*  START OF TEST 20
214800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
214900          COMPUTE
215000               COMP-3-ACTUAL-RESULT-20 = FUNCTION
215100                  INTEGER(COMP-3-TEST-VALUE-20(JJ));
215200          IF COMP-3-ACTUAL-RESULT-20 =
215300                  COMP-3-EXPECTED-RESULT-20 THEN
215400            ADD 1 TO pass-count
215500          ELSE
215600        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
215700        DISPLAY "test-value = " COMP-3-TEST-VALUE-20(JJ)
215800        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-20
215900        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-20
216000        DISPLAY " "
216100            ADD 1 TO fail-count
216200          END-IF;
216300       END-PERFORM;
216400       ADD 1 TO II;
216500*  START OF TEST 21
216600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
216700          COMPUTE
216800               COMP-3-ACTUAL-RESULT-21 = FUNCTION
216900                  INTEGER(COMP-3-TEST-VALUE-21(JJ));
217000          IF COMP-3-ACTUAL-RESULT-21 =
217100                  COMP-3-EXPECTED-RESULT-21 THEN
217200            ADD 1 TO pass-count
217300          ELSE
217400        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
217500        DISPLAY "test-value = " COMP-3-TEST-VALUE-21(JJ)
217600        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-21
217700        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-21
217800        DISPLAY " "
217900            ADD 1 TO fail-count
218000          END-IF;
218100       END-PERFORM;
218200       ADD 1 TO II;
218300*  START OF TEST 22
218400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
218500          COMPUTE
218600               COMP-3-ACTUAL-RESULT-22 = FUNCTION
218700                  INTEGER(COMP-3-TEST-VALUE-22(JJ));
218800          IF COMP-3-ACTUAL-RESULT-22 =
218900                  COMP-3-EXPECTED-RESULT-22 THEN
219000            ADD 1 TO pass-count
219100          ELSE
219200        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
219300        DISPLAY "test-value = " COMP-3-TEST-VALUE-22(JJ)
219400        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-22
219500        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-22
219600        DISPLAY " "
219700            ADD 1 TO fail-count
219800          END-IF;
219900       END-PERFORM;
220000       ADD 1 TO II;
220100*  START OF TEST 23
220200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
220300          COMPUTE
220400               COMP-3-ACTUAL-RESULT-23 = FUNCTION
220500                  INTEGER(COMP-3-TEST-VALUE-23(JJ));
220600          IF COMP-3-ACTUAL-RESULT-23 =
220700                  COMP-3-EXPECTED-RESULT-23 THEN
220800            ADD 1 TO pass-count
220900          ELSE
221000        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
221100        DISPLAY "test-value = " COMP-3-TEST-VALUE-23(JJ)
221200        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-23
221300        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-23
221400        DISPLAY " "
221500            ADD 1 TO fail-count
221600          END-IF;
221700       END-PERFORM;
221800       ADD 1 TO II;
221900*  START OF TEST 24
222000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
222100          COMPUTE
222200               COMP-3-ACTUAL-RESULT-24 = FUNCTION
222300                  INTEGER(COMP-3-TEST-VALUE-24(JJ));
222400          IF COMP-3-ACTUAL-RESULT-24 =
222500                  COMP-3-EXPECTED-RESULT-24 THEN
222600            ADD 1 TO pass-count
222700          ELSE
222800        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
222900        DISPLAY "test-value = " COMP-3-TEST-VALUE-24(JJ)
223000        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-24
223100        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-24
223200        DISPLAY " "
223300            ADD 1 TO fail-count
223400          END-IF;
223500       END-PERFORM;
223600       ADD 1 TO II;
223700*  START OF TEST 25
223800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
223900          COMPUTE
224000               COMP-3-ACTUAL-RESULT-25 = FUNCTION
224100                  INTEGER(COMP-3-TEST-VALUE-25(JJ));
224200          IF COMP-3-ACTUAL-RESULT-25 =
224300                  COMP-3-EXPECTED-RESULT-25 THEN
224400            ADD 1 TO pass-count
224500          ELSE
224600        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
224700        DISPLAY "test-value = " COMP-3-TEST-VALUE-25(JJ)
224800        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-25
224900        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-25
225000        DISPLAY " "
225100            ADD 1 TO fail-count
225200          END-IF;
225300       END-PERFORM;
225400       ADD 1 TO II;
225500*  START OF TEST 26
225600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
225700          COMPUTE
225800               COMP-3-ACTUAL-RESULT-26 = FUNCTION
225900                  INTEGER(COMP-3-TEST-VALUE-26(JJ));
226000          IF COMP-3-ACTUAL-RESULT-26 =
226100                  COMP-3-EXPECTED-RESULT-26 THEN
226200            ADD 1 TO pass-count
226300          ELSE
226400        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
226500        DISPLAY "test-value = " COMP-3-TEST-VALUE-26(JJ)
226600        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-26
226700        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-26
226800        DISPLAY " "
226900            ADD 1 TO fail-count
227000          END-IF;
227100       END-PERFORM;
227200       ADD 1 TO II;
227300*  START OF TEST 27
227400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
227500          COMPUTE
227600               COMP-3-ACTUAL-RESULT-27 = FUNCTION
227700                  INTEGER(COMP-3-TEST-VALUE-27(JJ));
227800          IF COMP-3-ACTUAL-RESULT-27 =
227900                  COMP-3-EXPECTED-RESULT-27 THEN
228000            ADD 1 TO pass-count
228100          ELSE
228200        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
228300        DISPLAY "test-value = " COMP-3-TEST-VALUE-27(JJ)
228400        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-27
228500        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-27
228600        DISPLAY " "
228700            ADD 1 TO fail-count
228800          END-IF;
228900       END-PERFORM;
229000       ADD 1 TO II;
229100*  START OF TEST 28
229200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
229300          COMPUTE
229400               COMP-3-ACTUAL-RESULT-28 = FUNCTION
229500                  INTEGER(COMP-3-TEST-VALUE-28(JJ));
229600          IF COMP-3-ACTUAL-RESULT-28 =
229700                  COMP-3-EXPECTED-RESULT-28 THEN
229800            ADD 1 TO pass-count
229900          ELSE
230000        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
230100        DISPLAY "test-value = " COMP-3-TEST-VALUE-28(JJ)
230200        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-28
230300        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-28
230400        DISPLAY " "
230500            ADD 1 TO fail-count
230600          END-IF;
230700       END-PERFORM;
230800       ADD 1 TO II;
230900*  START OF TEST 29
231000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
231100          COMPUTE
231200               COMP-3-ACTUAL-RESULT-29 = FUNCTION
231300                  INTEGER(COMP-3-TEST-VALUE-29(JJ));
231400          IF COMP-3-ACTUAL-RESULT-29 =
231500                  COMP-3-EXPECTED-RESULT-29 THEN
231600            ADD 1 TO pass-count
231700          ELSE
231800        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
231900        DISPLAY "test-value = " COMP-3-TEST-VALUE-29(JJ)
232000        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-29
232100        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-29
232200        DISPLAY " "
232300            ADD 1 TO fail-count
232400          END-IF;
232500       END-PERFORM;
232600       ADD 1 TO II;
232700*  START OF TEST 30
232800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
232900          COMPUTE
233000               COMP-3-ACTUAL-RESULT-30 = FUNCTION
233100                  INTEGER(COMP-3-TEST-VALUE-30(JJ));
233200          IF COMP-3-ACTUAL-RESULT-30 =
233300                  COMP-3-EXPECTED-RESULT-30 THEN
233400            ADD 1 TO pass-count
233500          ELSE
233600        DISPLAY "COMP-3 TEST " II "," JJ " FAILED:"
233700        DISPLAY "test-value = " COMP-3-TEST-VALUE-30(JJ)
233800        DISPLAY "expected-result = " COMP-3-EXPECTED-RESULT-30
233900        DISPLAY "actual-result =   " COMP-3-ACTUAL-RESULT-30
234000        DISPLAY " "
234100            ADD 1 TO fail-count
234200          END-IF;
234300       END-PERFORM;
234400       ADD 1 TO II;
234500
234600       IF fail-count NOT = ZERO AND
234700       pass-count NOT = NUM-OF-TEST * 3
234800       THEN
234900         DISPLAY "COMP-3 FAILURE";
235000         MOVE 1 TO ANY-FAILED;
235100       END-IF;
235200
235300*-----------------------------------------------------------------
235400* 11301900          DISPLAY:                         | |
235500* 11301950            External decimal (PIC 9 P S V):| |
235600* 11301951              Integer Picture              |f|
235700* 11301952              Non-integer picture          |f|
235800*-----------------------------------------------------------------
235900     MOVE NUM-DISPLAY TO NUM-OF-TEST;
236000     MOVE 1 TO II;
           COMPUTE TOTAL-FAIL = FAIL-COUNT;
           MOVE 0 TO FAIL-COUNT;
236100
236200*  START OF TEST 1
236300        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
236400          COMPUTE
236500               DISPLAY-ACTUAL-RESULT-1 = FUNCTION
236600                  INTEGER(DISPLAY-TEST-VALUE-1(JJ));
236700          IF DISPLAY-ACTUAL-RESULT-1 =
236800                  DISPLAY-EXPECTED-RESULT-1 THEN
236900             ADD 1 TO pass-count
237000          ELSE
237100         DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
237200         DISPLAY "test-value = " DISPLAY-TEST-VALUE-1(JJ)
237300         DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-1
237400         DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-1
237500         DISPLAY " "
237600             ADD 1 TO fail-count
237700          END-IF;
237800       END-PERFORM;
237900       ADD 1 TO II;
238000*  START OF TEST 2
238100        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
238200          COMPUTE
238300               DISPLAY-ACTUAL-RESULT-2 = FUNCTION
238400                  INTEGER(DISPLAY-TEST-VALUE-2(JJ));
238500          IF DISPLAY-ACTUAL-RESULT-2 =
238600                  DISPLAY-EXPECTED-RESULT-2 THEN
238700             ADD 1 TO pass-count
238800          ELSE
238900         DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
239000         DISPLAY "test-value = " DISPLAY-TEST-VALUE-2(JJ)
239100         DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-2
239200         DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-2
239300         DISPLAY " "
239400             ADD 1 TO fail-count
239500          END-IF;
239600       END-PERFORM;
239700       ADD 1 TO II;
239800*  START OF TEST 3
239900        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
240000          COMPUTE
240100               DISPLAY-ACTUAL-RESULT-3 = FUNCTION
240200                  INTEGER(DISPLAY-TEST-VALUE-3(JJ));
240300          IF DISPLAY-ACTUAL-RESULT-3 =
240400                  DISPLAY-EXPECTED-RESULT-3 THEN
240500             ADD 1 TO pass-count
240600          ELSE
240700         DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
240800         DISPLAY "test-value = " DISPLAY-TEST-VALUE-3(JJ)
240900         DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-3
241000         DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-3
241100         DISPLAY " "
241200             ADD 1 TO fail-count
241300          END-IF;
241400       END-PERFORM;
241500       ADD 1 TO II;
241600*  START OF TEST 4
241700        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
241800          COMPUTE
241900               DISPLAY-ACTUAL-RESULT-4 = FUNCTION
242000                  INTEGER(DISPLAY-TEST-VALUE-4(JJ));
242100          IF DISPLAY-ACTUAL-RESULT-4 =
242200                  DISPLAY-EXPECTED-RESULT-4 THEN
242300             ADD 1 TO pass-count
242400          ELSE
242500         DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
242600         DISPLAY "test-value = " DISPLAY-TEST-VALUE-4(JJ)
242700         DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-4
242800         DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-4
242900         DISPLAY " "
243000             ADD 1 TO fail-count
243100          END-IF;
243200       END-PERFORM;
243300       ADD 1 TO II;
243400*  START OF TEST 5
243500        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
243600          COMPUTE
243700               DISPLAY-ACTUAL-RESULT-5 = FUNCTION
243800                  INTEGER(DISPLAY-TEST-VALUE-5(JJ));
243900          IF DISPLAY-ACTUAL-RESULT-5 =
244000                  DISPLAY-EXPECTED-RESULT-5 THEN
244100             ADD 1 TO pass-count
244200          ELSE
244300         DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
244400         DISPLAY "test-value = " DISPLAY-TEST-VALUE-5(JJ)
244500         DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-5
244600         DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-5
244700         DISPLAY " "
244800             ADD 1 TO fail-count
244900          END-IF;
245000       END-PERFORM;
245100       ADD 1 TO II;
245200*  START OF TEST 6
245300        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
245400          COMPUTE
245500               DISPLAY-ACTUAL-RESULT-6 = FUNCTION
245600                  INTEGER(DISPLAY-TEST-VALUE-6(JJ));
245700          IF DISPLAY-ACTUAL-RESULT-6 =
245800                  DISPLAY-EXPECTED-RESULT-6 THEN
245900             ADD 1 TO pass-count
246000          ELSE
246100         DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
246200         DISPLAY "test-value = " DISPLAY-TEST-VALUE-6(JJ)
246300         DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-6
246400         DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-6
246500         DISPLAY " "
246600             ADD 1 TO fail-count
246700          END-IF;
246800       END-PERFORM;
246900       ADD 1 TO II;
247000*  START OF TEST 7
247100        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
247200          COMPUTE
247300               DISPLAY-ACTUAL-RESULT-7 = FUNCTION
247400                  INTEGER(DISPLAY-TEST-VALUE-7(JJ));
247500          IF DISPLAY-ACTUAL-RESULT-7 =
247600                  DISPLAY-EXPECTED-RESULT-7 THEN
247700             ADD 1 TO pass-count
247800          ELSE
247900         DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
248000         DISPLAY "test-value = " DISPLAY-TEST-VALUE-7(JJ)
248100         DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-7
248200         DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-7
248300         DISPLAY " "
248400             ADD 1 TO fail-count
248500          END-IF;
248600       END-PERFORM;
248700       ADD 1 TO II;
248800*  START OF TEST 8
248900        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
249000          COMPUTE
249100               DISPLAY-ACTUAL-RESULT-8 = FUNCTION
249200                  INTEGER(DISPLAY-TEST-VALUE-8(JJ));
249300          IF DISPLAY-ACTUAL-RESULT-8 =
249400                  DISPLAY-EXPECTED-RESULT-8 THEN
249500             ADD 1 TO pass-count
249600          ELSE
249700         DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
249800         DISPLAY "test-value = " DISPLAY-TEST-VALUE-8(JJ)
249900         DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-8
250000         DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-8
250100         DISPLAY " "
250200             ADD 1 TO fail-count
250300          END-IF;
250400       END-PERFORM;
250500       ADD 1 TO II;
250600*  START OF TEST 9
250700        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
250800          COMPUTE
250900               DISPLAY-ACTUAL-RESULT-9 = FUNCTION
251000                  INTEGER(DISPLAY-TEST-VALUE-9(JJ));
251100          IF DISPLAY-ACTUAL-RESULT-9 =
251200                  DISPLAY-EXPECTED-RESULT-9 THEN
251300             ADD 1 TO pass-count
251400          ELSE
251500         DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
251600         DISPLAY "test-value = " DISPLAY-TEST-VALUE-9(JJ)
251700         DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-9
251800         DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-9
251900         DISPLAY " "
252000             ADD 1 TO fail-count
252100          END-IF;
252200       END-PERFORM;
252300       ADD 1 TO II;
252400*  START OF TEST 10
252500        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
252600          COMPUTE
252700               DISPLAY-ACTUAL-RESULT-10 = FUNCTION
252800                  INTEGER(DISPLAY-TEST-VALUE-10(JJ));
252900          IF DISPLAY-ACTUAL-RESULT-10 =
253000                  DISPLAY-EXPECTED-RESULT-10 THEN
253100            ADD 1 TO pass-count
253200          ELSE
253300        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
253400        DISPLAY "test-value = " DISPLAY-TEST-VALUE-10(JJ)
253500        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-10
253600        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-10
253700        DISPLAY " "
253800            ADD 1 TO fail-count
253900          END-IF;
254000       END-PERFORM;
254100       ADD 1 TO II;
254200*  START OF TEST 11
254300        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
254400          COMPUTE
254500               DISPLAY-ACTUAL-RESULT-11 = FUNCTION
254600                  INTEGER(DISPLAY-TEST-VALUE-11(JJ));
254700          IF DISPLAY-ACTUAL-RESULT-11 =
254800                  DISPLAY-EXPECTED-RESULT-11 THEN
254900            ADD 1 TO pass-count
255000          ELSE
255100        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
255200        DISPLAY "test-value = " DISPLAY-TEST-VALUE-11(JJ)
255300        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-11
255400        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-11
255500        DISPLAY " "
255600            ADD 1 TO fail-count
255700          END-IF;
255800       END-PERFORM;
255900       ADD 1 TO II;
256000*  START OF TEST 12
256100        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
256200          COMPUTE
256300               DISPLAY-ACTUAL-RESULT-12 = FUNCTION
256400                  INTEGER(DISPLAY-TEST-VALUE-12(JJ));
256500          IF DISPLAY-ACTUAL-RESULT-12 =
256600                  DISPLAY-EXPECTED-RESULT-12 THEN
256700            ADD 1 TO pass-count
256800          ELSE
256900        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
257000        DISPLAY "test-value = " DISPLAY-TEST-VALUE-12(JJ)
257100        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-12
257200        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-12
257300        DISPLAY " "
257400            ADD 1 TO fail-count
257500          END-IF;
257600       END-PERFORM;
257700       ADD 1 TO II;
257800*  START OF TEST 13
257900        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
258000          COMPUTE
258100               DISPLAY-ACTUAL-RESULT-13 = FUNCTION
258200                  INTEGER(DISPLAY-TEST-VALUE-13(JJ));
258300          IF DISPLAY-ACTUAL-RESULT-13 =
258400                  DISPLAY-EXPECTED-RESULT-13 THEN
258500            ADD 1 TO pass-count
258600          ELSE
258700        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
258800        DISPLAY "test-value = " DISPLAY-TEST-VALUE-13(JJ)
258900        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-13
259000        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-13
259100        DISPLAY " "
259200            ADD 1 TO fail-count
259300          END-IF;
259400       END-PERFORM;
259500       ADD 1 TO II;
259600*  START OF TEST 14
259700        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
259800          COMPUTE
259900               DISPLAY-ACTUAL-RESULT-14 = FUNCTION
260000                  INTEGER(DISPLAY-TEST-VALUE-14(JJ));
260100          IF DISPLAY-ACTUAL-RESULT-14 =
260200                  DISPLAY-EXPECTED-RESULT-14 THEN
260300            ADD 1 TO pass-count
260400          ELSE
260500        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
260600        DISPLAY "test-value = " DISPLAY-TEST-VALUE-14(JJ)
260700        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-14
260800        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-14
260900        DISPLAY " "
261000            ADD 1 TO fail-count
261100          END-IF;
261200       END-PERFORM;
261300       ADD 1 TO II;
261400*  START OF TEST 15
261500        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
261600          COMPUTE
261700               DISPLAY-ACTUAL-RESULT-15 = FUNCTION
261800                  INTEGER(DISPLAY-TEST-VALUE-15(JJ));
261900          IF DISPLAY-ACTUAL-RESULT-15 =
262000                  DISPLAY-EXPECTED-RESULT-15 THEN
262100            ADD 1 TO pass-count
262200          ELSE
262300        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
262400        DISPLAY "test-value = " DISPLAY-TEST-VALUE-15(JJ)
262500        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-15
262600        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-15
262700        DISPLAY " "
262800            ADD 1 TO fail-count
262900          END-IF;
263000       END-PERFORM;
263100       ADD 1 TO II;
263200*  START OF TEST 16
263300        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
263400          COMPUTE
263500               DISPLAY-ACTUAL-RESULT-16 = FUNCTION
263600                  INTEGER(DISPLAY-TEST-VALUE-16(JJ));
263700          IF DISPLAY-ACTUAL-RESULT-16 =
263800                  DISPLAY-EXPECTED-RESULT-16 THEN
263900            ADD 1 TO pass-count
264000          ELSE
264100        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
264200        DISPLAY "test-value = " DISPLAY-TEST-VALUE-16(JJ)
264300        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-16
264400        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-16
264500        DISPLAY " "
264600            ADD 1 TO fail-count
264700          END-IF;
264800       END-PERFORM;
264900       ADD 1 TO II;
265000*  START OF TEST 17
265100        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
265200          COMPUTE
265300               DISPLAY-ACTUAL-RESULT-17 = FUNCTION
265400                  INTEGER(DISPLAY-TEST-VALUE-17(JJ));
265500          IF DISPLAY-ACTUAL-RESULT-17 =
265600                  DISPLAY-EXPECTED-RESULT-17 THEN
265700            ADD 1 TO pass-count
265800          ELSE
265900        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
266000        DISPLAY "test-value = " DISPLAY-TEST-VALUE-17(JJ)
266100        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-17
266200        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-17
266300        DISPLAY " "
266400            ADD 1 TO fail-count
266500          END-IF;
266600       END-PERFORM;
266700       ADD 1 TO II;
266800*  START OF TEST 18
266900        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
267000          COMPUTE
267100               DISPLAY-ACTUAL-RESULT-18 = FUNCTION
267200                  INTEGER(DISPLAY-TEST-VALUE-18(JJ));
267300          IF DISPLAY-ACTUAL-RESULT-18 =
267400                  DISPLAY-EXPECTED-RESULT-18 THEN
267500            ADD 1 TO pass-count
267600          ELSE
267700        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
267800        DISPLAY "test-value = " DISPLAY-TEST-VALUE-18(JJ)
267900        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-18
268000        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-18
268100        DISPLAY " "
268200            ADD 1 TO fail-count
268300          END-IF;
268400       END-PERFORM;
268500       ADD 1 TO II;
268600*  START OF TEST 19
268700        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
268800          COMPUTE
268900               DISPLAY-ACTUAL-RESULT-19 = FUNCTION
269000                  INTEGER(DISPLAY-TEST-VALUE-19(JJ));
269100          IF DISPLAY-ACTUAL-RESULT-19 =
269200                  DISPLAY-EXPECTED-RESULT-19 THEN
269300            ADD 1 TO pass-count
269400          ELSE
269500        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
269600        DISPLAY "test-value = " DISPLAY-TEST-VALUE-19(JJ)
269700        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-19
269800        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-19
269900        DISPLAY " "
270000            ADD 1 TO fail-count
270100          END-IF;
270200       END-PERFORM;
270300       ADD 1 TO II;
270400*  START OF TEST 20
270500        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
270600          COMPUTE
270700               DISPLAY-ACTUAL-RESULT-20 = FUNCTION
270800                  INTEGER(DISPLAY-TEST-VALUE-20(JJ));
270900          IF DISPLAY-ACTUAL-RESULT-20 =
271000                  DISPLAY-EXPECTED-RESULT-20 THEN
271100            ADD 1 TO pass-count
271200          ELSE
271300        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
271400        DISPLAY "test-value = " DISPLAY-TEST-VALUE-20(JJ)
271500        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-20
271600        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-20
271700        DISPLAY " "
271800            ADD 1 TO fail-count
271900          END-IF;
272000       END-PERFORM;
272100       ADD 1 TO II;
272200*  START OF TEST 21
272300        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
272400          COMPUTE
272500               DISPLAY-ACTUAL-RESULT-21 = FUNCTION
272600                  INTEGER(DISPLAY-TEST-VALUE-21(JJ));
272700          IF DISPLAY-ACTUAL-RESULT-21 =
272800                  DISPLAY-EXPECTED-RESULT-21 THEN
272900            ADD 1 TO pass-count
273000          ELSE
273100        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
273200        DISPLAY "test-value = " DISPLAY-TEST-VALUE-21(JJ)
273300        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-21
273400        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-21
273500        DISPLAY " "
273600            ADD 1 TO fail-count
273700          END-IF;
273800       END-PERFORM;
273900       ADD 1 TO II;
274000*  START OF TEST 22
274100        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
274200          COMPUTE
274300               DISPLAY-ACTUAL-RESULT-22 = FUNCTION
274400                  INTEGER(DISPLAY-TEST-VALUE-22(JJ));
274500          IF DISPLAY-ACTUAL-RESULT-22 =
274600                  DISPLAY-EXPECTED-RESULT-22 THEN
274700            ADD 1 TO pass-count
274800          ELSE
274900        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
275000        DISPLAY "test-value = " DISPLAY-TEST-VALUE-22(JJ)
275100        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-22
275200        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-22
275300        DISPLAY " "
275400            ADD 1 TO fail-count
275500          END-IF;
275600       END-PERFORM;
275700       ADD 1 TO II;
275800*  START OF TEST 23
275900        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
276000          COMPUTE
276100               DISPLAY-ACTUAL-RESULT-23 = FUNCTION
276200                  INTEGER(DISPLAY-TEST-VALUE-23(JJ));
276300          IF DISPLAY-ACTUAL-RESULT-23 =
276400                  DISPLAY-EXPECTED-RESULT-23 THEN
276500            ADD 1 TO pass-count
276600          ELSE
276700        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
276800        DISPLAY "test-value = " DISPLAY-TEST-VALUE-23(JJ)
276900        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-23
277000        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-23
277100        DISPLAY " "
277200            ADD 1 TO fail-count
277300          END-IF;
277400       END-PERFORM;
277500       ADD 1 TO II;
277600*  START OF TEST 24
277700        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
277800          COMPUTE
277900               DISPLAY-ACTUAL-RESULT-24 = FUNCTION
278000                  INTEGER(DISPLAY-TEST-VALUE-24(JJ));
278100          IF DISPLAY-ACTUAL-RESULT-24 =
278200                  DISPLAY-EXPECTED-RESULT-24 THEN
278300            ADD 1 TO pass-count
278400          ELSE
278500        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
278600        DISPLAY "test-value = " DISPLAY-TEST-VALUE-24(JJ)
278700        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-24
278800        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-24
278900        DISPLAY " "
279000            ADD 1 TO fail-count
279100          END-IF;
279200       END-PERFORM;
279300       ADD 1 TO II;
279400*  START OF TEST 25
279500        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
279600          COMPUTE
279700               DISPLAY-ACTUAL-RESULT-25 = FUNCTION
279800                  INTEGER(DISPLAY-TEST-VALUE-25(JJ));
279900          IF DISPLAY-ACTUAL-RESULT-25 =
280000                  DISPLAY-EXPECTED-RESULT-25 THEN
280100            ADD 1 TO pass-count
280200          ELSE
280300        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
280400        DISPLAY "test-value = " DISPLAY-TEST-VALUE-25(JJ)
280500        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-25
280600        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-25
280700        DISPLAY " "
280800            ADD 1 TO fail-count
280900          END-IF;
281000       END-PERFORM;
281100       ADD 1 TO II;
281200*  START OF TEST 26
281300        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
281400          COMPUTE
281500               DISPLAY-ACTUAL-RESULT-26 = FUNCTION
281600                  INTEGER(DISPLAY-TEST-VALUE-26(JJ));
281700          IF DISPLAY-ACTUAL-RESULT-26 =
281800                  DISPLAY-EXPECTED-RESULT-26 THEN
281900            ADD 1 TO pass-count
282000          ELSE
282100        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
282200        DISPLAY "test-value = " DISPLAY-TEST-VALUE-26(JJ)
282300        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-26
282400        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-26
282500        DISPLAY " "
282600            ADD 1 TO fail-count
282700          END-IF;
282800       END-PERFORM;
282900       ADD 1 TO II;
283000*  START OF TEST 27
283100        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
283200          COMPUTE
283300               DISPLAY-ACTUAL-RESULT-27 = FUNCTION
283400                  INTEGER(DISPLAY-TEST-VALUE-27(JJ));
283500          IF DISPLAY-ACTUAL-RESULT-27 =
283600                  DISPLAY-EXPECTED-RESULT-27 THEN
283700            ADD 1 TO pass-count
283800          ELSE
283900        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
284000        DISPLAY "test-value = " DISPLAY-TEST-VALUE-27(JJ)
284100        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-27
284200        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-27
284300        DISPLAY " "
284400            ADD 1 TO fail-count
284500          END-IF;
284600       END-PERFORM;
284700       ADD 1 TO II;
284800*  START OF TEST 28
284900        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
285000          COMPUTE
285100               DISPLAY-ACTUAL-RESULT-28 = FUNCTION
285200                  INTEGER(DISPLAY-TEST-VALUE-28(JJ));
285300          IF DISPLAY-ACTUAL-RESULT-28 =
285400                  DISPLAY-EXPECTED-RESULT-28 THEN
285500            ADD 1 TO pass-count
285600          ELSE
285700        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
285800        DISPLAY "test-value = " DISPLAY-TEST-VALUE-28(JJ)
285900        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-28
286000        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-28
286100        DISPLAY " "
286200            ADD 1 TO fail-count
286300          END-IF;
286400       END-PERFORM;
286500       ADD 1 TO II;
286600*  START OF TEST 29
286700        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
286800          COMPUTE
286900               DISPLAY-ACTUAL-RESULT-29 = FUNCTION
287000                  INTEGER(DISPLAY-TEST-VALUE-29(JJ));
287100          IF DISPLAY-ACTUAL-RESULT-29 =
287200                  DISPLAY-EXPECTED-RESULT-29 THEN
287300            ADD 1 TO pass-count
287400          ELSE
287500        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
287600        DISPLAY "test-value = " DISPLAY-TEST-VALUE-29(JJ)
287700        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-29
287800        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-29
287900        DISPLAY " "
288000            ADD 1 TO fail-count
288100          END-IF;
288200       END-PERFORM;
288300       ADD 1 TO II;
288400*  START OF TEST 30
288500        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
288600          COMPUTE
288700               DISPLAY-ACTUAL-RESULT-30 = FUNCTION
288800                  INTEGER(DISPLAY-TEST-VALUE-30(JJ));
288900          IF DISPLAY-ACTUAL-RESULT-30 =
289000                  DISPLAY-EXPECTED-RESULT-30 THEN
289100            ADD 1 TO pass-count
289200          ELSE
289300        DISPLAY "DISPLAY TEST " II "," JJ " FAILED:"
289400        DISPLAY "test-value = " DISPLAY-TEST-VALUE-30(JJ)
289500        DISPLAY "expected-result = " DISPLAY-EXPECTED-RESULT-30
289600        DISPLAY "actual-result =   " DISPLAY-ACTUAL-RESULT-30
289700        DISPLAY " "
289800            ADD 1 TO fail-count
289900          END-IF;
290000       END-PERFORM;
290100       ADD 1 TO II;
290200
290300       IF fail-count NOT = ZERO AND
290400       pass-count NOT = NUM-OF-TEST * 3
290500       THEN
290600         DISPLAY "DISPLAY FAILURE";
290700         MOVE 1 TO ANY-FAILED;
290800       END-IF;
290900* END OF DISPLAY RUN
291000
291100*-----------------------------------------------------------------
291200* 11301110            Halfword (1-4 digits)          | |
291300*-----------------------------------------------------------------
291400     MOVE NUM-HALFWD TO NUM-OF-TEST;
291500     MOVE 1 TO II;
           COMPUTE TOTAL-FAIL = TOTAL-FAIL + FAIL-COUNT;
           MOVE 0 TO FAIL-COUNT;
291600
291700*  START OF TEST 1
291800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
291900          COMPUTE
292000               HALFWD-ACTUAL-RESULT-1 = FUNCTION
292100                  INTEGER(HALFWD-TEST-VALUE-1(JJ));
292200          IF HALFWD-ACTUAL-RESULT-1 =
292300                  HALFWD-EXPECTED-RESULT-1 THEN
292400             ADD 1 TO pass-count
292500          ELSE
292600         DISPLAY "HALFWORD TEST " II "," JJ " FAILED:"
292700         DISPLAY "test-value = " HALFWD-TEST-VALUE-1(JJ)
292800         DISPLAY "expected-result = " HALFWD-EXPECTED-RESULT-1
292900         DISPLAY "actual-result =   " HALFWD-ACTUAL-RESULT-1
293000         DISPLAY " "
293100             ADD 1 TO fail-count
293200          END-IF;
293300       END-PERFORM;
293400       ADD 1 TO II;
293500*  START OF TEST 2
293600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
293700          COMPUTE
293800               HALFWD-ACTUAL-RESULT-2 = FUNCTION
293900                  INTEGER(HALFWD-TEST-VALUE-2(JJ));
294000          IF HALFWD-ACTUAL-RESULT-2 =
294100                  HALFWD-EXPECTED-RESULT-2 THEN
294200             ADD 1 TO pass-count
294300          ELSE
294400         DISPLAY "HALFWORD TEST " II "," JJ " FAILED:"
294500         DISPLAY "test-value = " HALFWD-TEST-VALUE-2(JJ)
294600         DISPLAY "expected-result = " HALFWD-EXPECTED-RESULT-2
294700         DISPLAY "actual-result =   " HALFWD-ACTUAL-RESULT-2
294800         DISPLAY " "
294900             ADD 1 TO fail-count
295000          END-IF;
295100       END-PERFORM;
295200       ADD 1 TO II;
295300*  START OF TEST 3
295400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
295500          COMPUTE
295600               HALFWD-ACTUAL-RESULT-3 = FUNCTION
295700                  INTEGER(HALFWD-TEST-VALUE-3(JJ));
295800          IF HALFWD-ACTUAL-RESULT-3 =
295900                  HALFWD-EXPECTED-RESULT-3 THEN
296000             ADD 1 TO pass-count
296100          ELSE
296200         DISPLAY "HALFWORD TEST " II "," JJ " FAILED:"
296300         DISPLAY "test-value = " HALFWD-TEST-VALUE-3(JJ)
296400         DISPLAY "expected-result = " HALFWD-EXPECTED-RESULT-3
296500         DISPLAY "actual-result =   " HALFWD-ACTUAL-RESULT-3
296600         DISPLAY " "
296700             ADD 1 TO fail-count
296800          END-IF;
296900       END-PERFORM;
297000       ADD 1 TO II;
297100*  START OF TEST 4
297200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
297300          COMPUTE
297400               HALFWD-ACTUAL-RESULT-4 = FUNCTION
297500                  INTEGER(HALFWD-TEST-VALUE-4(JJ));
297600          IF HALFWD-ACTUAL-RESULT-4 =
297700                  HALFWD-EXPECTED-RESULT-4 THEN
297800             ADD 1 TO pass-count
297900          ELSE
298000         DISPLAY "HALFWORD TEST " II "," JJ " FAILED:"
298100         DISPLAY "test-value = " HALFWD-TEST-VALUE-4(JJ)
298200         DISPLAY "expected-result = " HALFWD-EXPECTED-RESULT-4
298300         DISPLAY "actual-result =   " HALFWD-ACTUAL-RESULT-4
298400         DISPLAY " "
298500             ADD 1 TO fail-count
298600          END-IF;
298700       END-PERFORM;
298800       ADD 1 TO II;
298900*  START OF TEST 5
299000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
299100          COMPUTE
299200               HALFWD-ACTUAL-RESULT-5 = FUNCTION
299300                  INTEGER(HALFWD-TEST-VALUE-5(JJ));
299400          IF HALFWD-ACTUAL-RESULT-5 =
299500                  HALFWD-EXPECTED-RESULT-5 THEN
299600             ADD 1 TO pass-count
299700          ELSE
299800         DISPLAY "HALFWORD TEST " II "," JJ " FAILED:"
299900         DISPLAY "test-value = " HALFWD-TEST-VALUE-5(JJ)
300000         DISPLAY "expected-result = " HALFWD-EXPECTED-RESULT-5
300100         DISPLAY "actual-result =   " HALFWD-ACTUAL-RESULT-5
300200         DISPLAY " "
300300             ADD 1 TO fail-count
300400          END-IF;
300500       END-PERFORM;
300600       ADD 1 TO II;
300700*  START OF TEST 6
300800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
300900          COMPUTE
301000               HALFWD-ACTUAL-RESULT-6 = FUNCTION
301100                  INTEGER(HALFWD-TEST-VALUE-6(JJ));
301200          IF HALFWD-ACTUAL-RESULT-6 =
301300                  HALFWD-EXPECTED-RESULT-6 THEN
301400             ADD 1 TO pass-count
301500          ELSE
301600         DISPLAY "HALFWORD TEST " II "," JJ " FAILED:"
301700         DISPLAY "test-value = " HALFWD-TEST-VALUE-6(JJ)
301800         DISPLAY "expected-result = " HALFWD-EXPECTED-RESULT-6
301900         DISPLAY "actual-result =   " HALFWD-ACTUAL-RESULT-6
302000         DISPLAY " "
302100             ADD 1 TO fail-count
302200          END-IF;
302300       END-PERFORM;
302400       ADD 1 TO II;
302500*  START OF TEST 7
302600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
302700          COMPUTE
302800               HALFWD-ACTUAL-RESULT-7 = FUNCTION
302900                  INTEGER(HALFWD-TEST-VALUE-7(JJ));
303000          IF HALFWD-ACTUAL-RESULT-7 =
303100                  HALFWD-EXPECTED-RESULT-7 THEN
303200             ADD 1 TO pass-count
303300          ELSE
303400         DISPLAY "HALFWORD TEST " II "," JJ " FAILED:"
303500         DISPLAY "test-value = " HALFWD-TEST-VALUE-7(JJ)
303600         DISPLAY "expected-result = " HALFWD-EXPECTED-RESULT-7
303700         DISPLAY "actual-result =   " HALFWD-ACTUAL-RESULT-7
303800         DISPLAY " "
303900             ADD 1 TO fail-count
304000          END-IF;
304100       END-PERFORM;
304200       ADD 1 TO II;
304300*  START OF TEST 8
304400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
304500          COMPUTE
304600               HALFWD-ACTUAL-RESULT-8 = FUNCTION
304700                  INTEGER(HALFWD-TEST-VALUE-8(JJ));
304800          IF HALFWD-ACTUAL-RESULT-8 =
304900                  HALFWD-EXPECTED-RESULT-8 THEN
305000             ADD 1 TO pass-count
305100          ELSE
305200         DISPLAY "HALFWORD TEST " II "," JJ " FAILED:"
305300         DISPLAY "test-value = " HALFWD-TEST-VALUE-8(JJ)
305400         DISPLAY "expected-result = " HALFWD-EXPECTED-RESULT-8
305500         DISPLAY "actual-result =   " HALFWD-ACTUAL-RESULT-8
305600         DISPLAY " "
305700             ADD 1 TO fail-count
305800          END-IF;
305900       END-PERFORM;
306000       ADD 1 TO II;
306100
306200       IF fail-count NOT = ZERO AND
306300       pass-count NOT = NUM-OF-TEST * 3
306400       THEN
306500         DISPLAY "HALFWORD FAILURE";
306600         MOVE 1 TO ANY-FAILED;
306700       END-IF;
306800* END OF HALFWORD RUN
306900
307000*-----------------------------------------------------------------
307100* 11301120            Fullword (5-8 digits)          | |
307200*-----------------------------------------------------------------
307300*
307400     MOVE NUM-FULLWD TO NUM-OF-TEST;
           COMPUTE TOTAL-FAIL = TOTAL-FAIL + FAIL-COUNT;
           MOVE 0 TO FAIL-COUNT;
307500     MOVE 1 TO II;
307600
307700*  START OF TEST 1
307800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
307900          COMPUTE
308000               FULLWD-ACTUAL-RESULT-1 = FUNCTION
308100                  INTEGER(FULLWD-TEST-VALUE-1(JJ));
308200          IF FULLWD-ACTUAL-RESULT-1 =
308300                  FULLWD-EXPECTED-RESULT-1 THEN
308400             ADD 1 TO pass-count
308500          ELSE
308600         DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
308700         DISPLAY "test-value = " FULLWD-TEST-VALUE-1(JJ)
308800         DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-1
308900         DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-1
309000         DISPLAY " "
309100             ADD 1 TO fail-count
309200          END-IF;
309300       END-PERFORM;
309400       ADD 1 TO II;
309500*  START OF TEST 2
309600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
309700          COMPUTE
309800               FULLWD-ACTUAL-RESULT-2 = FUNCTION
309900                  INTEGER(FULLWD-TEST-VALUE-2(JJ));
310000          IF FULLWD-ACTUAL-RESULT-2 =
310100                  FULLWD-EXPECTED-RESULT-2 THEN
310200             ADD 1 TO pass-count
310300          ELSE
310400         DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
310500         DISPLAY "test-value = " FULLWD-TEST-VALUE-2(JJ)
310600         DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-2
310700         DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-2
310800         DISPLAY " "
310900             ADD 1 TO fail-count
311000          END-IF;
311100       END-PERFORM;
311200       ADD 1 TO II;
311300*  START OF TEST 3
311400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
311500          COMPUTE
311600               FULLWD-ACTUAL-RESULT-3 = FUNCTION
311700                  INTEGER(FULLWD-TEST-VALUE-3(JJ));
311800          IF FULLWD-ACTUAL-RESULT-3 =
311900                  FULLWD-EXPECTED-RESULT-3 THEN
312000             ADD 1 TO pass-count
312100          ELSE
312200         DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
312300         DISPLAY "test-value = " FULLWD-TEST-VALUE-3(JJ)
312400         DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-3
312500         DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-3
312600         DISPLAY " "
312700             ADD 1 TO fail-count
312800          END-IF;
312900       END-PERFORM;
313000       ADD 1 TO II;
313100*  START OF TEST 4
313200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
313300          COMPUTE
313400               FULLWD-ACTUAL-RESULT-4 = FUNCTION
313500                  INTEGER(FULLWD-TEST-VALUE-4(JJ));
313600          IF FULLWD-ACTUAL-RESULT-4 =
313700                  FULLWD-EXPECTED-RESULT-4 THEN
313800             ADD 1 TO pass-count
313900          ELSE
314000         DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
314100         DISPLAY "test-value = " FULLWD-TEST-VALUE-4(JJ)
314200         DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-4
314300         DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-4
314400         DISPLAY " "
314500             ADD 1 TO fail-count
314600          END-IF;
314700       END-PERFORM;
314800       ADD 1 TO II;
314900*  START OF TEST 5
315000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
315100          COMPUTE
315200               FULLWD-ACTUAL-RESULT-5 = FUNCTION
315300                  INTEGER(FULLWD-TEST-VALUE-5(JJ));
315400          IF FULLWD-ACTUAL-RESULT-5 =
315500                  FULLWD-EXPECTED-RESULT-5 THEN
315600             ADD 1 TO pass-count
315700          ELSE
315800         DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
315900         DISPLAY "test-value = " FULLWD-TEST-VALUE-5(JJ)
316000         DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-5
316100         DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-5
316200         DISPLAY " "
316300             ADD 1 TO fail-count
316400          END-IF;
316500       END-PERFORM;
316600       ADD 1 TO II;
316700*  START OF TEST 6
316800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
316900          COMPUTE
317000               FULLWD-ACTUAL-RESULT-6 = FUNCTION
317100                  INTEGER(FULLWD-TEST-VALUE-6(JJ));
317200          IF FULLWD-ACTUAL-RESULT-6 =
317300                  FULLWD-EXPECTED-RESULT-6 THEN
317400             ADD 1 TO pass-count
317500          ELSE
317600         DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
317700         DISPLAY "test-value = " FULLWD-TEST-VALUE-6(JJ)
317800         DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-6
317900         DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-6
318000         DISPLAY " "
318100             ADD 1 TO fail-count
318200          END-IF;
318300       END-PERFORM;
318400       ADD 1 TO II;
318500*  START OF TEST 7
318600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
318700          COMPUTE
318800               FULLWD-ACTUAL-RESULT-7 = FUNCTION
318900                  INTEGER(FULLWD-TEST-VALUE-7(JJ));
319000          IF FULLWD-ACTUAL-RESULT-7 =
319100                  FULLWD-EXPECTED-RESULT-7 THEN
319200             ADD 1 TO pass-count
319300          ELSE
319400         DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
319500         DISPLAY "test-value = " FULLWD-TEST-VALUE-7(JJ)
319600         DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-7
319700         DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-7
319800         DISPLAY " "
319900             ADD 1 TO fail-count
320000          END-IF;
320100       END-PERFORM;
320200       ADD 1 TO II;
320300*  START OF TEST 8
320400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
320500          COMPUTE
320600               FULLWD-ACTUAL-RESULT-8 = FUNCTION
320700                  INTEGER(FULLWD-TEST-VALUE-8(JJ));
320800          IF FULLWD-ACTUAL-RESULT-8 =
320900                  FULLWD-EXPECTED-RESULT-8 THEN
321000             ADD 1 TO pass-count
321100          ELSE
321200         DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
321300         DISPLAY "test-value = " FULLWD-TEST-VALUE-8(JJ)
321400         DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-8
321500         DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-8
321600         DISPLAY " "
321700             ADD 1 TO fail-count
321800          END-IF;
321900       END-PERFORM;
322000       ADD 1 TO II;
322100*  START OF TEST 9
322200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
322300          COMPUTE
322400               FULLWD-ACTUAL-RESULT-9 = FUNCTION
322500                  INTEGER(FULLWD-TEST-VALUE-9(JJ));
322600          IF FULLWD-ACTUAL-RESULT-9 =
322700                  FULLWD-EXPECTED-RESULT-9 THEN
322800             ADD 1 TO pass-count
322900          ELSE
323000         DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
323100         DISPLAY "test-value = " FULLWD-TEST-VALUE-9(JJ)
323200         DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-9
323300         DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-9
323400         DISPLAY " "
323500             ADD 1 TO fail-count
323600          END-IF;
323700       END-PERFORM;
323800       ADD 1 TO II;
323900*  START OF TEST 10
324000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
324100          COMPUTE
324200               FULLWD-ACTUAL-RESULT-10 = FUNCTION
324300                  INTEGER(FULLWD-TEST-VALUE-10(JJ));
324400          IF FULLWD-ACTUAL-RESULT-10 =
324500                  FULLWD-EXPECTED-RESULT-10 THEN
324600            ADD 1 TO pass-count
324700          ELSE
324800        DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
324900        DISPLAY "test-value = " FULLWD-TEST-VALUE-10(JJ)
325000        DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-10
325100        DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-10
325200        DISPLAY " "
325300            ADD 1 TO fail-count
325400          END-IF;
325500       END-PERFORM;
325600       ADD 1 TO II;
325700*  START OF TEST 11
325800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
325900          COMPUTE
326000               FULLWD-ACTUAL-RESULT-11 = FUNCTION
326100                  INTEGER(FULLWD-TEST-VALUE-11(JJ));
326200          IF FULLWD-ACTUAL-RESULT-11 =
326300                  FULLWD-EXPECTED-RESULT-11 THEN
326400            ADD 1 TO pass-count
326500          ELSE
326600        DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
326700        DISPLAY "test-value = " FULLWD-TEST-VALUE-11(JJ)
326800        DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-11
326900        DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-11
327000        DISPLAY " "
327100            ADD 1 TO fail-count
327200          END-IF;
327300       END-PERFORM;
327400       ADD 1 TO II;
327500*  START OF TEST 12
327600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
327700          COMPUTE
327800               FULLWD-ACTUAL-RESULT-12 = FUNCTION
327900                  INTEGER(FULLWD-TEST-VALUE-12(JJ));
328000          IF FULLWD-ACTUAL-RESULT-12 =
328100                  FULLWD-EXPECTED-RESULT-12 THEN
328200            ADD 1 TO pass-count
328300          ELSE
328400        DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
328500        DISPLAY "test-value = " FULLWD-TEST-VALUE-12(JJ)
328600        DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-12
328700        DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-12
328800        DISPLAY " "
328900            ADD 1 TO fail-count
329000          END-IF;
329100       END-PERFORM;
329200       ADD 1 TO II;
329300*  START OF TEST 13
329400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
329500          COMPUTE
329600               FULLWD-ACTUAL-RESULT-13 = FUNCTION
329700                  INTEGER(FULLWD-TEST-VALUE-13(JJ));
329800          IF FULLWD-ACTUAL-RESULT-13 =
329900                  FULLWD-EXPECTED-RESULT-13 THEN
330000            ADD 1 TO pass-count
330100          ELSE
330200        DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
330300        DISPLAY "test-value = " FULLWD-TEST-VALUE-13(JJ)
330400        DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-13
330500        DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-13
330600        DISPLAY " "
330700            ADD 1 TO fail-count
330800          END-IF;
330900       END-PERFORM;
331000       ADD 1 TO II;
331100*  START OF TEST 14
331200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
331300          COMPUTE
331400               FULLWD-ACTUAL-RESULT-14 = FUNCTION
331500                  INTEGER(FULLWD-TEST-VALUE-14(JJ));
331600          IF FULLWD-ACTUAL-RESULT-14 =
331700                  FULLWD-EXPECTED-RESULT-14 THEN
331800            ADD 1 TO pass-count
331900          ELSE
332000        DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
332100        DISPLAY "test-value = " FULLWD-TEST-VALUE-14(JJ)
332200        DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-14
332300        DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-14
332400        DISPLAY " "
332500            ADD 1 TO fail-count
332600          END-IF;
332700       END-PERFORM;
332800       ADD 1 TO II;
332900*  START OF TEST 15
333000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
333100          COMPUTE
333200               FULLWD-ACTUAL-RESULT-15 = FUNCTION
333300                  INTEGER(FULLWD-TEST-VALUE-15(JJ));
333400          IF FULLWD-ACTUAL-RESULT-15 =
333500                  FULLWD-EXPECTED-RESULT-15 THEN
333600            ADD 1 TO pass-count
333700          ELSE
333800        DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
333900        DISPLAY "test-value = " FULLWD-TEST-VALUE-15(JJ)
334000        DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-15
334100        DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-15
334200        DISPLAY " "
334300            ADD 1 TO fail-count
334400          END-IF;
334500       END-PERFORM;
334600       ADD 1 TO II;
334700*  START OF TEST 16
334800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
334900          COMPUTE
335000               FULLWD-ACTUAL-RESULT-16 = FUNCTION
335100                  INTEGER(FULLWD-TEST-VALUE-16(JJ));
335200          IF FULLWD-ACTUAL-RESULT-16 =
335300                  FULLWD-EXPECTED-RESULT-16 THEN
335400            ADD 1 TO pass-count
335500          ELSE
335600        DISPLAY "FULLWORD TEST " II "," JJ " FAILED:"
335700        DISPLAY "test-value = " FULLWD-TEST-VALUE-16(JJ)
335800        DISPLAY "expected-result = " FULLWD-EXPECTED-RESULT-16
335900        DISPLAY "actual-result =   " FULLWD-ACTUAL-RESULT-16
336000        DISPLAY " "
336100            ADD 1 TO fail-count
336200          END-IF;
336300       END-PERFORM;
336400       ADD 1 TO II;
336500
336600       IF fail-count NOT = ZERO AND
336700       pass-count NOT = NUM-OF-TEST * 3
336800       THEN
336900         DISPLAY "FULLWORD FAILURE";
337000         MOVE 1 TO ANY-FAILED;
337100       END-IF;
337200* END OF FULLWORD RUN
337300
337400*-----------------------------------------------------------------
337500* 11301130            Doubleword (9-18 digits)       | |
337600*-----------------------------------------------------------------
337700*
337800     MOVE NUM-TWINFW TO NUM-OF-TEST;
           COMPUTE TOTAL-FAIL = TOTAL-FAIL + FAIL-COUNT;
           MOVE 0 TO FAIL-COUNT;
337900     MOVE 1 TO II;
338000
338100*  START OF TEST 1
338200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
338300          COMPUTE
338400               TWINFW-ACTUAL-RESULT-1 = FUNCTION
338500                  INTEGER(TWINFW-TEST-VALUE-1(JJ));
338600          IF TWINFW-ACTUAL-RESULT-1 =
338700                  TWINFW-EXPECTED-RESULT-1 THEN
338800             ADD 1 TO pass-count
338900          ELSE
339000         DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
339100         DISPLAY "test-value = " TWINFW-TEST-VALUE-1(JJ)
339200         DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-1
339300         DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-1
339400         DISPLAY " "
339500             ADD 1 TO fail-count
339600          END-IF;
339700       END-PERFORM;
339800       ADD 1 TO II;
339900*  START OF TEST 2
340000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
340100          COMPUTE
340200               TWINFW-ACTUAL-RESULT-2 = FUNCTION
340300                  INTEGER(TWINFW-TEST-VALUE-2(JJ));
340400          IF TWINFW-ACTUAL-RESULT-2 =
340500                  TWINFW-EXPECTED-RESULT-2 THEN
340600             ADD 1 TO pass-count
340700          ELSE
340800         DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
340900         DISPLAY "test-value = " TWINFW-TEST-VALUE-2(JJ)
341000         DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-2
341100         DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-2
341200         DISPLAY " "
341300             ADD 1 TO fail-count
341400          END-IF;
341500       END-PERFORM;
341600       ADD 1 TO II;
341700*  START OF TEST 3
341800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
341900          COMPUTE
342000               TWINFW-ACTUAL-RESULT-3 = FUNCTION
342100                  INTEGER(TWINFW-TEST-VALUE-3(JJ));
342200          IF TWINFW-ACTUAL-RESULT-3 =
342300                  TWINFW-EXPECTED-RESULT-3 THEN
342400             ADD 1 TO pass-count
342500          ELSE
342600         DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
342700         DISPLAY "test-value = " TWINFW-TEST-VALUE-3(JJ)
342800         DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-3
342900         DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-3
343000         DISPLAY " "
343100             ADD 1 TO fail-count
343200          END-IF;
343300       END-PERFORM;
343400       ADD 1 TO II;
343500*  START OF TEST 4
343600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
343700          COMPUTE
343800               TWINFW-ACTUAL-RESULT-4 = FUNCTION
343900                  INTEGER(TWINFW-TEST-VALUE-4(JJ));
344000          IF TWINFW-ACTUAL-RESULT-4 =
344100                  TWINFW-EXPECTED-RESULT-4 THEN
344200             ADD 1 TO pass-count
344300          ELSE
344400         DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
344500         DISPLAY "test-value = " TWINFW-TEST-VALUE-4(JJ)
344600         DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-4
344700         DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-4
344800         DISPLAY " "
344900             ADD 1 TO fail-count
345000          END-IF;
345100       END-PERFORM;
345200       ADD 1 TO II;
345300*  START OF TEST 5
345400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
345500          COMPUTE
345600               TWINFW-ACTUAL-RESULT-5 = FUNCTION
345700                  INTEGER(TWINFW-TEST-VALUE-5(JJ));
345800          IF TWINFW-ACTUAL-RESULT-5 =
345900                  TWINFW-EXPECTED-RESULT-5 THEN
346000             ADD 1 TO pass-count
346100          ELSE
346200         DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
346300         DISPLAY "test-value = " TWINFW-TEST-VALUE-5(JJ)
346400         DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-5
346500         DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-5
346600         DISPLAY " "
346700             ADD 1 TO fail-count
346800          END-IF;
346900       END-PERFORM;
347000       ADD 1 TO II;
347100*  START OF TEST 6
347200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
347300          COMPUTE
347400               TWINFW-ACTUAL-RESULT-6 = FUNCTION
347500                  INTEGER(TWINFW-TEST-VALUE-6(JJ));
347600          IF TWINFW-ACTUAL-RESULT-6 =
347700                  TWINFW-EXPECTED-RESULT-6 THEN
347800             ADD 1 TO pass-count
347900          ELSE
348000         DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
348100         DISPLAY "test-value = " TWINFW-TEST-VALUE-6(JJ)
348200         DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-6
348300         DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-6
348400         DISPLAY " "
348500             ADD 1 TO fail-count
348600          END-IF;
348700       END-PERFORM;
348800       ADD 1 TO II;
348900*  START OF TEST 7
349000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
349100          COMPUTE
349200               TWINFW-ACTUAL-RESULT-7 = FUNCTION
349300                  INTEGER(TWINFW-TEST-VALUE-7(JJ));
349400          IF TWINFW-ACTUAL-RESULT-7 =
349500                  TWINFW-EXPECTED-RESULT-7 THEN
349600             ADD 1 TO pass-count
349700          ELSE
349800         DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
349900         DISPLAY "test-value = " TWINFW-TEST-VALUE-7(JJ)
350000         DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-7
350100         DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-7
350200         DISPLAY " "
350300             ADD 1 TO fail-count
350400          END-IF;
350500       END-PERFORM;
350600       ADD 1 TO II;
350700*  START OF TEST 8
350800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
350900          COMPUTE
351000               TWINFW-ACTUAL-RESULT-8 = FUNCTION
351100                  INTEGER(TWINFW-TEST-VALUE-8(JJ));
351200          IF TWINFW-ACTUAL-RESULT-8 =
351300                  TWINFW-EXPECTED-RESULT-8 THEN
351400             ADD 1 TO pass-count
351500          ELSE
351600         DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
351700         DISPLAY "test-value = " TWINFW-TEST-VALUE-8(JJ)
351800         DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-8
351900         DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-8
352000         DISPLAY " "
352100             ADD 1 TO fail-count
352200          END-IF;
352300       END-PERFORM;
352400       ADD 1 TO II;
352500*  START OF TEST 9
352600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
352700          COMPUTE
352800               TWINFW-ACTUAL-RESULT-9 = FUNCTION
352900                  INTEGER(TWINFW-TEST-VALUE-9(JJ));
353000          IF TWINFW-ACTUAL-RESULT-9 =
353100                  TWINFW-EXPECTED-RESULT-9 THEN
353200             ADD 1 TO pass-count
353300          ELSE
353400         DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
353500         DISPLAY "test-value = " TWINFW-TEST-VALUE-9(JJ)
353600         DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-9
353700         DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-9
353800         DISPLAY " "
353900             ADD 1 TO fail-count
354000          END-IF;
354100       END-PERFORM;
354200       ADD 1 TO II;
354300*  START OF TEST 10
354400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
354500          COMPUTE
354600               TWINFW-ACTUAL-RESULT-10 = FUNCTION
354700                  INTEGER(TWINFW-TEST-VALUE-10(JJ));
354800          IF TWINFW-ACTUAL-RESULT-10 =
354900                  TWINFW-EXPECTED-RESULT-10 THEN
355000            ADD 1 TO pass-count
355100          ELSE
355200        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
355300        DISPLAY "test-value = " TWINFW-TEST-VALUE-10(JJ)
355400        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-10
355500        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-10
355600        DISPLAY " "
355700            ADD 1 TO fail-count
355800          END-IF;
355900       END-PERFORM;
356000       ADD 1 TO II;
356100*  START OF TEST 11
356200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
356300          COMPUTE
356400               TWINFW-ACTUAL-RESULT-11 = FUNCTION
356500                  INTEGER(TWINFW-TEST-VALUE-11(JJ));
356600          IF TWINFW-ACTUAL-RESULT-11 =
356700                  TWINFW-EXPECTED-RESULT-11 THEN
356800            ADD 1 TO pass-count
356900          ELSE
357000        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
357100        DISPLAY "test-value = " TWINFW-TEST-VALUE-11(JJ)
357200        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-11
357300        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-11
357400        DISPLAY " "
357500            ADD 1 TO fail-count
357600          END-IF;
357700       END-PERFORM;
357800       ADD 1 TO II;
357900*  START OF TEST 12
358000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
358100          COMPUTE
358200               TWINFW-ACTUAL-RESULT-12 = FUNCTION
358300                  INTEGER(TWINFW-TEST-VALUE-12(JJ));
358400          IF TWINFW-ACTUAL-RESULT-12 =
358500                  TWINFW-EXPECTED-RESULT-12 THEN
358600            ADD 1 TO pass-count
358700          ELSE
358800        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
358900        DISPLAY "test-value = " TWINFW-TEST-VALUE-12(JJ)
359000        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-12
359100        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-12
359200        DISPLAY " "
359300            ADD 1 TO fail-count
359400          END-IF;
359500       END-PERFORM;
359600       ADD 1 TO II;
359700*  START OF TEST 13
359800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
359900          COMPUTE
360000               TWINFW-ACTUAL-RESULT-13 = FUNCTION
360100                  INTEGER(TWINFW-TEST-VALUE-13(JJ));
360200          IF TWINFW-ACTUAL-RESULT-13 =
360300                  TWINFW-EXPECTED-RESULT-13 THEN
360400            ADD 1 TO pass-count
360500          ELSE
360600        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
360700        DISPLAY "test-value = " TWINFW-TEST-VALUE-13(JJ)
360800        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-13
360900        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-13
361000        DISPLAY " "
361100            ADD 1 TO fail-count
361200          END-IF;
361300       END-PERFORM;
361400       ADD 1 TO II;
361500*  START OF TEST 14
361600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
361700          COMPUTE
361800               TWINFW-ACTUAL-RESULT-14 = FUNCTION
361900                  INTEGER(TWINFW-TEST-VALUE-14(JJ));
362000          IF TWINFW-ACTUAL-RESULT-14 =
362100                  TWINFW-EXPECTED-RESULT-14 THEN
362200            ADD 1 TO pass-count
362300          ELSE
362400        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
362500        DISPLAY "test-value = " TWINFW-TEST-VALUE-14(JJ)
362600        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-14
362700        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-14
362800        DISPLAY " "
362900            ADD 1 TO fail-count
363000          END-IF;
363100       END-PERFORM;
363200       ADD 1 TO II;
363300*  START OF TEST 15
363400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
363500          COMPUTE
363600               TWINFW-ACTUAL-RESULT-15 = FUNCTION
363700                  INTEGER(TWINFW-TEST-VALUE-15(JJ));
363800          IF TWINFW-ACTUAL-RESULT-15 =
363900                  TWINFW-EXPECTED-RESULT-15 THEN
364000            ADD 1 TO pass-count
364100          ELSE
364200        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
364300        DISPLAY "test-value = " TWINFW-TEST-VALUE-15(JJ)
364400        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-15
364500        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-15
364600        DISPLAY " "
364700            ADD 1 TO fail-count
364800          END-IF;
364900       END-PERFORM;
365000       ADD 1 TO II;
365100*  START OF TEST 16
365200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
365300          COMPUTE
365400               TWINFW-ACTUAL-RESULT-16 = FUNCTION
365500                  INTEGER(TWINFW-TEST-VALUE-16(JJ));
365600          IF TWINFW-ACTUAL-RESULT-16 =
365700                  TWINFW-EXPECTED-RESULT-16 THEN
365800            ADD 1 TO pass-count
365900          ELSE
366000        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
366100        DISPLAY "test-value = " TWINFW-TEST-VALUE-16(JJ)
366200        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-16
366300        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-16
366400        DISPLAY " "
366500            ADD 1 TO fail-count
366600          END-IF;
366700       END-PERFORM;
366800       ADD 1 TO II;
366900*  START OF TEST 17
367000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
367100          COMPUTE
367200               TWINFW-ACTUAL-RESULT-17 = FUNCTION
367300                  INTEGER(TWINFW-TEST-VALUE-17(JJ));
367400          IF TWINFW-ACTUAL-RESULT-17 =
367500                  TWINFW-EXPECTED-RESULT-17 THEN
367600            ADD 1 TO pass-count
367700          ELSE
367800        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
367900        DISPLAY "test-value = " TWINFW-TEST-VALUE-17(JJ)
368000        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-17
368100        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-17
368200        DISPLAY " "
368300            ADD 1 TO fail-count
368400          END-IF;
368500       END-PERFORM;
368600       ADD 1 TO II;
368700*  START OF TEST 18
368800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
368900          COMPUTE
369000               TWINFW-ACTUAL-RESULT-18 = FUNCTION
369100                  INTEGER(TWINFW-TEST-VALUE-18(JJ));
369200          IF TWINFW-ACTUAL-RESULT-18 =
369300                  TWINFW-EXPECTED-RESULT-18 THEN
369400            ADD 1 TO pass-count
369500          ELSE
369600        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
369700        DISPLAY "test-value = " TWINFW-TEST-VALUE-18(JJ)
369800        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-18
369900        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-18
370000        DISPLAY " "
370100            ADD 1 TO fail-count
370200          END-IF;
370300       END-PERFORM;
370400       ADD 1 TO II;
370500*  START OF TEST 19
370600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
370700          COMPUTE
370800               TWINFW-ACTUAL-RESULT-19 = FUNCTION
370900                  INTEGER(TWINFW-TEST-VALUE-19(JJ));
371000          IF TWINFW-ACTUAL-RESULT-19 =
371100                  TWINFW-EXPECTED-RESULT-19 THEN
371200            ADD 1 TO pass-count
371300          ELSE
371400        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
371500        DISPLAY "test-value = " TWINFW-TEST-VALUE-19(JJ)
371600        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-19
371700        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-19
371800        DISPLAY " "
371900            ADD 1 TO fail-count
372000          END-IF;
372100       END-PERFORM;
372200       ADD 1 TO II;
372300*  START OF TEST 20
372400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
372500          COMPUTE
372600               TWINFW-ACTUAL-RESULT-20 = FUNCTION
372700                  INTEGER(TWINFW-TEST-VALUE-20(JJ));
372800          IF TWINFW-ACTUAL-RESULT-20 =
372900                  TWINFW-EXPECTED-RESULT-20 THEN
373000            ADD 1 TO pass-count
373100          ELSE
373200        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
373300        DISPLAY "test-value = " TWINFW-TEST-VALUE-20(JJ)
373400        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-20
373500        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-20
373600        DISPLAY " "
373700            ADD 1 TO fail-count
373800          END-IF;
373900       END-PERFORM;
374000       ADD 1 TO II;
374100*  START OF TEST 21
374200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
374300          COMPUTE
374400               TWINFW-ACTUAL-RESULT-21 = FUNCTION
374500                  INTEGER(TWINFW-TEST-VALUE-21(JJ));
374600          IF TWINFW-ACTUAL-RESULT-21 =
374700                  TWINFW-EXPECTED-RESULT-21 THEN
374800            ADD 1 TO pass-count
374900          ELSE
375000        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
375100        DISPLAY "test-value = " TWINFW-TEST-VALUE-21(JJ)
375200        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-21
375300        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-21
375400        DISPLAY " "
375500            ADD 1 TO fail-count
375600          END-IF;
375700       END-PERFORM;
375800       ADD 1 TO II;
375900*  START OF TEST 22
376000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
376100          COMPUTE
376200               TWINFW-ACTUAL-RESULT-22 = FUNCTION
376300                  INTEGER(TWINFW-TEST-VALUE-22(JJ));
376400          IF TWINFW-ACTUAL-RESULT-22 =
376500                  TWINFW-EXPECTED-RESULT-22 THEN
376600            ADD 1 TO pass-count
376700          ELSE
376800        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
376900        DISPLAY "test-value = " TWINFW-TEST-VALUE-22(JJ)
377000        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-22
377100        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-22
377200        DISPLAY " "
377300            ADD 1 TO fail-count
377400          END-IF;
377500       END-PERFORM;
377600       ADD 1 TO II;
377700*  START OF TEST 23
377800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
377900          COMPUTE
378000               TWINFW-ACTUAL-RESULT-23 = FUNCTION
378100                  INTEGER(TWINFW-TEST-VALUE-23(JJ));
378200          IF TWINFW-ACTUAL-RESULT-23 =
378300                  TWINFW-EXPECTED-RESULT-23 THEN
378400            ADD 1 TO pass-count
378500          ELSE
378600        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
378700        DISPLAY "test-value = " TWINFW-TEST-VALUE-23(JJ)
378800        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-23
378900        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-23
379000        DISPLAY " "
379100            ADD 1 TO fail-count
379200          END-IF;
379300       END-PERFORM;
379400       ADD 1 TO II;
379500*  START OF TEST 24
379600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
379700          COMPUTE
379800               TWINFW-ACTUAL-RESULT-24 = FUNCTION
379900                  INTEGER(TWINFW-TEST-VALUE-24(JJ));
380000          IF TWINFW-ACTUAL-RESULT-24 =
380100                  TWINFW-EXPECTED-RESULT-24 THEN
380200            ADD 1 TO pass-count
380300          ELSE
380400        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
380500        DISPLAY "test-value = " TWINFW-TEST-VALUE-24(JJ)
380600        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-24
380700        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-24
380800        DISPLAY " "
380900            ADD 1 TO fail-count
381000          END-IF;
381100       END-PERFORM;
381200       ADD 1 TO II;
381300*  START OF TEST 25
381400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
381500          COMPUTE
381600               TWINFW-ACTUAL-RESULT-25 = FUNCTION
381700                  INTEGER(TWINFW-TEST-VALUE-25(JJ));
381800          IF TWINFW-ACTUAL-RESULT-25 =
381900                  TWINFW-EXPECTED-RESULT-25 THEN
382000            ADD 1 TO pass-count
382100          ELSE
382200        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
382300        DISPLAY "test-value = " TWINFW-TEST-VALUE-25(JJ)
382400        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-25
382500        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-25
382600        DISPLAY " "
382700            ADD 1 TO fail-count
382800          END-IF;
382900       END-PERFORM;
383000       ADD 1 TO II;
383100*  START OF TEST 26
383200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
383300          COMPUTE
383400               TWINFW-ACTUAL-RESULT-26 = FUNCTION
383500                  INTEGER(TWINFW-TEST-VALUE-26(JJ));
383600          IF TWINFW-ACTUAL-RESULT-26 =
383700                  TWINFW-EXPECTED-RESULT-26 THEN
383800            ADD 1 TO pass-count
383900          ELSE
384000        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
384100        DISPLAY "test-value = " TWINFW-TEST-VALUE-26(JJ)
384200        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-26
384300        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-26
384400        DISPLAY " "
384500            ADD 1 TO fail-count
384600          END-IF;
384700       END-PERFORM;
384800       ADD 1 TO II;
384900*  START OF TEST 27
385000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
385100          COMPUTE
385200               TWINFW-ACTUAL-RESULT-27 = FUNCTION
385300                  INTEGER(TWINFW-TEST-VALUE-27(JJ));
385400          IF TWINFW-ACTUAL-RESULT-27 =
385500                  TWINFW-EXPECTED-RESULT-27 THEN
385600            ADD 1 TO pass-count
385700          ELSE
385800        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
385900        DISPLAY "test-value = " TWINFW-TEST-VALUE-27(JJ)
386000        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-27
386100        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-27
386200        DISPLAY " "
386300            ADD 1 TO fail-count
386400          END-IF;
386500       END-PERFORM;
386600       ADD 1 TO II;
386700*  START OF TEST 28
386800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
386900          COMPUTE
387000               TWINFW-ACTUAL-RESULT-28 = FUNCTION
387100                  INTEGER(TWINFW-TEST-VALUE-28(JJ));
387200          IF TWINFW-ACTUAL-RESULT-28 =
387300                  TWINFW-EXPECTED-RESULT-28 THEN
387400            ADD 1 TO pass-count
387500          ELSE
387600        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
387700        DISPLAY "test-value = " TWINFW-TEST-VALUE-28(JJ)
387800        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-28
387900        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-28
388000        DISPLAY " "
388100            ADD 1 TO fail-count
388200          END-IF;
388300       END-PERFORM;
388400       ADD 1 TO II;
388500*  START OF TEST 29
388600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
388700          COMPUTE
388800               TWINFW-ACTUAL-RESULT-29 = FUNCTION
388900                  INTEGER(TWINFW-TEST-VALUE-29(JJ));
389000          IF TWINFW-ACTUAL-RESULT-29 =
389100                  TWINFW-EXPECTED-RESULT-29 THEN
389200            ADD 1 TO pass-count
389300          ELSE
389400        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
389500        DISPLAY "test-value = " TWINFW-TEST-VALUE-29(JJ)
389600        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-29
389700        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-29
389800        DISPLAY " "
389900            ADD 1 TO fail-count
390000          END-IF;
390100       END-PERFORM;
390200       ADD 1 TO II;
390300*  START OF TEST 30
390400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
390500          COMPUTE
390600               TWINFW-ACTUAL-RESULT-30 = FUNCTION
390700                  INTEGER(TWINFW-TEST-VALUE-30(JJ));
390800          IF TWINFW-ACTUAL-RESULT-30 =
390900                  TWINFW-EXPECTED-RESULT-30 THEN
391000            ADD 1 TO pass-count
391100          ELSE
391200        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
391300        DISPLAY "test-value = " TWINFW-TEST-VALUE-30(JJ)
391400        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-30
391500        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-30
391600        DISPLAY " "
391700            ADD 1 TO fail-count
391800          END-IF;
391900       END-PERFORM;
392000       ADD 1 TO II;
392100*  START OF TEST 31
392200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
392300          COMPUTE
392400               TWINFW-ACTUAL-RESULT-31 = FUNCTION
392500                  INTEGER(TWINFW-TEST-VALUE-31(JJ));
392600          IF TWINFW-ACTUAL-RESULT-31 =
392700                  TWINFW-EXPECTED-RESULT-31 THEN
392800            ADD 1 TO pass-count
392900          ELSE
393000        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
393100        DISPLAY "test-value = " TWINFW-TEST-VALUE-31(JJ)
393200        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-31
393300        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-31
393400        DISPLAY " "
393500            ADD 1 TO fail-count
393600          END-IF;
393700       END-PERFORM;
393800       ADD 1 TO II;
393900*  START OF TEST 32
394000        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
394100          COMPUTE
394200               TWINFW-ACTUAL-RESULT-32 = FUNCTION
394300                  INTEGER(TWINFW-TEST-VALUE-32(JJ));
394400          IF TWINFW-ACTUAL-RESULT-32 =
394500                  TWINFW-EXPECTED-RESULT-32 THEN
394600            ADD 1 TO pass-count
394700          ELSE
394800        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
394900        DISPLAY "test-value = " TWINFW-TEST-VALUE-32(JJ)
395000        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-32
395100        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-32
395200        DISPLAY " "
395300            ADD 1 TO fail-count
395400          END-IF;
395500       END-PERFORM;
395600       ADD 1 TO II;
395700*  START OF TEST 33
395800        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
395900          COMPUTE
396000               TWINFW-ACTUAL-RESULT-33 = FUNCTION
396100                  INTEGER(TWINFW-TEST-VALUE-33(JJ));
396200          IF TWINFW-ACTUAL-RESULT-33 =
396300                  TWINFW-EXPECTED-RESULT-33 THEN
396400            ADD 1 TO pass-count
396500          ELSE
396600        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
396700        DISPLAY "test-value = " TWINFW-TEST-VALUE-33(JJ)
396800        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-33
396900        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-33
397000        DISPLAY " "
397100            ADD 1 TO fail-count
397200          END-IF;
397300       END-PERFORM;
397400       ADD 1 TO II;
397500*  START OF TEST 34
397600        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
397700          COMPUTE
397800               TWINFW-ACTUAL-RESULT-34 = FUNCTION
397900                  INTEGER(TWINFW-TEST-VALUE-34(JJ));
398000          IF TWINFW-ACTUAL-RESULT-34 =
398100                  TWINFW-EXPECTED-RESULT-34 THEN
398200            ADD 1 TO pass-count
398300          ELSE
398400        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
398500        DISPLAY "test-value = " TWINFW-TEST-VALUE-34(JJ)
398600        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-34
398700        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-34
398800        DISPLAY " "
398900            ADD 1 TO fail-count
399000          END-IF;
399100       END-PERFORM;
399200       ADD 1 TO II;
399300*  START OF TEST 35
399400        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
399500          COMPUTE
399600               TWINFW-ACTUAL-RESULT-35 = FUNCTION
399700                  INTEGER(TWINFW-TEST-VALUE-35(JJ));
399800          IF TWINFW-ACTUAL-RESULT-35 =
399900                  TWINFW-EXPECTED-RESULT-35 THEN
400000            ADD 1 TO pass-count
400100          ELSE
400200        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
400300        DISPLAY "test-value = " TWINFW-TEST-VALUE-35(JJ)
400400        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-35
400500        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-35
400600        DISPLAY " "
400700            ADD 1 TO fail-count
400800          END-IF;
400900       END-PERFORM;
401000       ADD 1 TO II;
401100*  START OF TEST 36
401200        PERFORM VARYING JJ FROM 1 BY 1 UNTIL JJ > 3;
401300          COMPUTE
401400               TWINFW-ACTUAL-RESULT-36 = FUNCTION
401500                  INTEGER(TWINFW-TEST-VALUE-36(JJ));
401600          IF TWINFW-ACTUAL-RESULT-36 =
401700                  TWINFW-EXPECTED-RESULT-36 THEN
401800            ADD 1 TO pass-count
401900          ELSE
402000        DISPLAY "TWIN FULLWORD TEST " II "," JJ " FAILED:"
402100        DISPLAY "test-value = " TWINFW-TEST-VALUE-36(JJ)
402200        DISPLAY "expected-result = " TWINFW-EXPECTED-RESULT-36
402300        DISPLAY "actual-result =   " TWINFW-ACTUAL-RESULT-36
402400        DISPLAY " "
402500            ADD 1 TO fail-count
402600          END-IF;
402700       END-PERFORM;
402800       ADD 1 TO II;
402900
403000       IF fail-count NOT = ZERO AND
403100       pass-count NOT = NUM-OF-TEST * 3
403200       THEN
403300         DISPLAY "TWIN FULLWORD FAILURE";
403400         MOVE 1 TO ANY-FAILED;
403500       END-IF;
403600* END OF TWIN FULLWORD  RUN
403700
403800
403900*-----------------------------------------------------------------
404000* 11312000      SIGN IS .. SEPARATE CHARACTER:       | |
404100* 11312100        LEADING                            |f|
404200*-----------------------------------------------------------------
404300*
404400     MOVE 2 TO NUM-OF-TEST;
           COMPUTE TOTAL-FAIL = TOTAL-FAIL + FAIL-COUNT;
           MOVE 0 TO FAIL-COUNT;
404500
404600* TEST 1 FOR SIGN IS LEADING CLAUSE
404700     MOVE 123.9 TO LEADING-SIGN-ITEM;
404800     MOVE 123 TO LEAD-EXP-VAL;
404900     COMPUTE ACTUAL-RES-L = FUNCTION
405000     INTEGER(LEADING-SIGN-ITEM);
405100          IF ACTUAL-RES-L IS EQUAL
405200               TO LEAD-EXP-VAL THEN
405300            ADD 1 TO pass-count
405400          ELSE
405500        DISPLAY "LEADING SIGN TEST 1 FAILED:"
405600        DISPLAY "test-value = " LEADING-SIGN-ITEM
405700        DISPLAY "expected-result = " LEAD-EXP-VAL
405800        DISPLAY "actual-result =   " ACTUAL-RES-L
405900        DISPLAY " "
406000            ADD 1 TO fail-count
406100          END-IF;
406200
406300* TEST 2 FOR SIGN IS LEADING CLAUSE
406400     MOVE -123.4 TO LEADING-SIGN-ITEM;
406500     MOVE -124 TO LEAD-EXP-VAL;
406600     COMPUTE ACTUAL-RES-L = FUNCTION
406700     INTEGER(LEADING-SIGN-ITEM);
406800          IF ACTUAL-RES-L = LEAD-EXP-VAL THEN
406900            ADD 1 TO pass-count
407000          ELSE
407100        DISPLAY "LEADING SIGN TEST 2 FAILED:"
407200        DISPLAY "test-value = " LEADING-SIGN-ITEM
407300        DISPLAY "expected-result = " LEAD-EXP-VAL
407400        DISPLAY "actual-result =   " ACTUAL-RES-L
407500        DISPLAY " "
407600            ADD 1 TO fail-count
407700          END-IF;
407800
407900       IF fail-count NOT = ZERO AND
408000       pass-count NOT = NUM-OF-TEST
408100       THEN
408200         DISPLAY "SIGN IS LEADING CLAUSE FAILED";
               DISPLAY "PASS: " PASS-COUNT " FAIL: " FAIL-COUNT
408300         MOVE 1 TO ANY-FAILED;
408400       END-IF;
408500* END OF SIGN IS LEADING CLAUSE
408600
408700*-----------------------------------------------------------------
408800* 11312200        TRAILING                           |f|
408900*-----------------------------------------------------------------
409000     MOVE 2 TO NUM-OF-TEST;
           COMPUTE TOTAL-FAIL = TOTAL-FAIL + FAIL-COUNT;
           MOVE 0 TO FAIL-COUNT;
409100* TEST 1 FOR SIGN IS TRAILING CLAUSE
409200     MOVE 123.9 TO TRAILING-SIGN-ITEM;
409300     MOVE 123 TO TRAIL-EXP-VAL;
409400     COMPUTE ACTUAL-RES-T = FUNCTION
409500     INTEGER(TRAILING-SIGN-ITEM);
409600          IF ACTUAL-RES-T = TRAIL-EXP-VAL THEN
409700            ADD 1 TO pass-count
409800          ELSE
409900        DISPLAY "TRAILING SIGN TEST 1 FAILED:"
410000        DISPLAY "test-value = " TRAILING-SIGN-ITEM
410100        DISPLAY "expected-result = " TRAIL-EXP-VAL
410200        DISPLAY "actual-result =   " ACTUAL-RES-T
410300        DISPLAY " "
410400            ADD 1 TO fail-count
410500          END-IF;
410600
410700* TEST 2 FOR SIGN IS TRAILING CLAUSE
410800     MOVE -123.4 TO TRAILING-SIGN-ITEM;
410900     MOVE -124 TO TRAIL-EXP-VAL;
411000     COMPUTE ACTUAL-RES-T = FUNCTION
411100     INTEGER(TRAILING-SIGN-ITEM);
411200          IF ACTUAL-RES-T = TRAIL-EXP-VAL THEN
411300            ADD 1 TO pass-count
411400          ELSE
411500        DISPLAY "TRAILING SIGN TEST 2 FAILED:"
411600        DISPLAY "test-value = " TRAILING-SIGN-ITEM
411700        DISPLAY "expected-result = " TRAIL-EXP-VAL
411800        DISPLAY "actual-result =   " ACTUAL-RES-T
411900        DISPLAY " "
412000            ADD 1 TO fail-count
412100          END-IF;
412200
412300       IF fail-count NOT = ZERO AND
412400       pass-count NOT = NUM-OF-TEST
412500       THEN
412600         DISPLAY "SIGN IS TRAILING CLAUSE FAILED";
               DISPLAY "PASS: " PASS-COUNT " FAIL: " FAIL-COUNT
412700         MOVE 1 TO ANY-FAILED;
412800       END-IF;
412900* END OF SIGN IS TRAILING CLAUSE
413000
413100*-----------------------------------------------------------------
413200* 11303000      Qualified                            |f|
413300*-----------------------------------------------------------------
413400     MOVE 4 TO NUM-OF-TEST;
           COMPUTE TOTAL-FAIL = TOTAL-FAIL + FAIL-COUNT;
           MOVE 0 TO FAIL-COUNT;
413500
413600* TEST 1 FOR QUALIFIED STRUCTURE
413700     MOVE 123.9 TO element of Part-A;
413800     MOVE 123 TO QUALIFIED-COMP-3-EXP;
413900     COMPUTE QUALIFIED-COMP-3-RES =
414000      FUNCTION INTEGER(element of Part-A);
414100          IF QUALIFIED-COMP-3-RES =
414200                        QUALIFIED-COMP-3-EXP  THEN
414300            ADD 1 TO pass-count
414400          ELSE
414500        DISPLAY "QUALIFIED STRUCTURE TEST 1 FAILED:"
414600        DISPLAY "test-value = " element of Part-A
414700        DISPLAY "expected-result = " QUALIFIED-COMP-3-EXP
414800        DISPLAY "actual-result =   " QUALIFIED-COMP-3-RES
414900        DISPLAY " "
415000            ADD 1 TO fail-count
415100          END-IF;
415200
415300* TEST 2 FOR QUALIFIED STRUCTURE
415400     MOVE -123.4 TO element of Part-A;
415500     MOVE -124 TO QUALIFIED-COMP-3-EXP;
415600     COMPUTE QUALIFIED-COMP-3-RES =
415700      FUNCTION INTEGER(element of Part-A);
415800          IF QUALIFIED-COMP-3-RES =
415900                        QUALIFIED-COMP-3-EXP  THEN
416000            ADD 1 TO pass-count
416100          ELSE
416200        DISPLAY "QUALIFIED STRUCTURE TEST 2 FAILED:"
416300        DISPLAY "test-value = " element of Part-A
416400        DISPLAY "expected-result = " QUALIFIED-COMP-3-EXP
416500        DISPLAY "actual-result =   " QUALIFIED-COMP-3-RES
416600        DISPLAY " "
416700            ADD 1 TO fail-count
416800          END-IF;
416900
417000* TEST 3 FOR QUALIFIED STRUCTURE
417100     MOVE 123.9 TO element of Part-B;
417200     MOVE 123 TO QUALIFIED-COMP-3-EXP;
417300     COMPUTE QUALIFIED-COMP-3-RES =
417400      FUNCTION INTEGER(element of Part-B);
417500          IF QUALIFIED-COMP-3-RES =
417600                        QUALIFIED-COMP-3-EXP  THEN
417700            ADD 1 TO pass-count
417800          ELSE
417900        DISPLAY "QUALIFIED STRUCTURE TEST 3 FAILED:"
418000        DISPLAY "test-value = " element of Part-B
418100        DISPLAY "expected-result = " QUALIFIED-COMP-3-EXP
418200        DISPLAY "actual-result =   " QUALIFIED-COMP-3-RES
418300        DISPLAY " "
418400            ADD 1 TO fail-count
418500          END-IF;
418600
418700* TEST 4 FOR QUALIFIED STRUCTURE
418800     MOVE -123.4 TO element of Part-B;
418900     MOVE -124 TO QUALIFIED-COMP-3-EXP;
419000     COMPUTE QUALIFIED-COMP-3-RES =
419100      FUNCTION INTEGER(element of Part-B);
419200          IF QUALIFIED-COMP-3-RES =
419300                        QUALIFIED-COMP-3-EXP  THEN
419400            ADD 1 TO pass-count
419500          ELSE
419600        DISPLAY "QUALIFIED STRUCTURE TEST 4 FAILED:"
419700        DISPLAY "test-value = " element of Part-B
419800        DISPLAY "expected-result = " QUALIFIED-COMP-3-EXP
419900        DISPLAY "actual-result =   " QUALIFIED-COMP-3-RES
420000        DISPLAY " "
420100            ADD 1 TO fail-count
420200          END-IF;
420300
420400       IF fail-count NOT = ZERO AND
420500       pass-count NOT = NUM-OF-TEST
420600       THEN
420700         DISPLAY "QUALIFIED STRUCTURE FAILED";
               DISPLAY "PASS: " PASS-COUNT " FAIL: " FAIL-COUNT
420800         MOVE 1 TO ANY-FAILED;
420900       END-IF;
421000* END OF QUALIFIED STRUCTURE
421100
421200*-----------------------------------------------------------------
421300* 11310000      SYNC                         |f|
421400*-----------------------------------------------------------------
421500     MOVE 14 TO NUM-OF-TEST;
           COMPUTE TOTAL-FAIL = TOTAL-FAIL + FAIL-COUNT;
           MOVE 0 TO FAIL-COUNT;
421600
421700* TEST 1 FOR SYNC ITEMS
421800     MOVE 123.9 TO z-sync-item;
421900     MOVE 123 TO   Z-SYNC-EXP;
422000     COMPUTE Z-SYNC-RES = FUNCTION INTEGER(z-sync-item);
422100          IF Z-SYNC-RES = Z-SYNC-EXP THEN
422200            ADD 1 TO pass-count
422300          ELSE
422400        DISPLAY "SYNC ITEM 1 FAILED:"
422500        DISPLAY "test-value = " z-sync-item
422600        DISPLAY "expected-result = " Z-SYNC-EXP
422700        DISPLAY "actual-result =   " Z-SYNC-RES
422800        DISPLAY " "
422900            ADD 1 TO fail-count
423000          END-IF;
423100
423200* TEST 2 FOR SYNC ITEMS
423300     MOVE -123.9 TO z-sync-item;
423400     MOVE -124 TO   Z-SYNC-EXP;
423500     COMPUTE Z-SYNC-RES = FUNCTION INTEGER(z-sync-item);
423600          IF Z-SYNC-RES = Z-SYNC-EXP THEN
423700            ADD 1 TO pass-count
423800          ELSE
423900        DISPLAY "SYNC ITEM 2 FAILED:"
424000        DISPLAY "test-value = " z-sync-item
424100        DISPLAY "expected-result = " Z-SYNC-EXP
424200        DISPLAY "actual-result =   " Z-SYNC-RES
424300        DISPLAY " "
424400            ADD 1 TO fail-count
424500          END-IF;
424600
424700* TEST 3 FOR SYNC ITEMS
424800     MOVE 1234.9 TO h-sync-item;
424900     MOVE 1234 TO   H-SYNC-EXP;
425000     COMPUTE H-SYNC-RES = FUNCTION INTEGER(h-sync-item);
425100          IF H-SYNC-RES = H-SYNC-EXP THEN
425200            ADD 1 TO pass-count
425300          ELSE
425400        DISPLAY "SYNC ITEM 3 FAILED:"
425500        DISPLAY "test-value = " h-sync-item
425600        DISPLAY "expected-result = " H-SYNC-EXP
425700        DISPLAY "actual-result =   " H-SYNC-RES
425800        DISPLAY " "
425900            ADD 1 TO fail-count
426000          END-IF;
426100
426200* TEST 4 FOR SYNC ITEMS
426300     MOVE -1234.9 TO h-sync-item;
426400     MOVE -1235 TO   H-SYNC-EXP;
426500     COMPUTE H-SYNC-RES = FUNCTION INTEGER(h-sync-item);
426600          IF H-SYNC-RES = H-SYNC-EXP THEN
426700            ADD 1 TO pass-count
426800          ELSE
426900        DISPLAY "SYNC ITEM 4 FAILED:"
427000        DISPLAY "test-value = " h-sync-item
427100        DISPLAY "expected-result = " H-SYNC-EXP
427200        DISPLAY "actual-result =   " H-SYNC-RES
427300        DISPLAY " "
427400            ADD 1 TO fail-count
427500          END-IF;
427600
427700* TEST 5 FOR SYNC ITEMS
427800     MOVE 12345678.9 TO f-sync-item;
427900     MOVE 12345678 TO   F-SYNC-EXP;
428000     COMPUTE F-SYNC-RES = FUNCTION INTEGER(f-sync-item);
428100          IF F-SYNC-RES = F-SYNC-EXP THEN
428200            ADD 1 TO pass-count
428300          ELSE
428400        DISPLAY "SYNC ITEM 5 FAILED:"
428500        DISPLAY "test-value = " f-sync-item
428600        DISPLAY "expected-result = " F-SYNC-EXP
428700        DISPLAY "actual-result =   " F-SYNC-RES
428800        DISPLAY " "
428900            ADD 1 TO fail-count
429000          END-IF;
429100
429200* TEST 6 FOR SYNC ITEMS
429300     MOVE -12345678.9 TO f-sync-item;
429400     MOVE -12345679 TO   F-SYNC-EXP;
429500     COMPUTE F-SYNC-RES = FUNCTION INTEGER(f-sync-item);
429600          IF F-SYNC-RES = F-SYNC-EXP THEN
429700            ADD 1 TO pass-count
429800          ELSE
429900        DISPLAY "SYNC ITEM 6 FAILED:"
430000        DISPLAY "test-value = " f-sync-item
430100        DISPLAY "expected-result = " F-SYNC-EXP
430200        DISPLAY "actual-result =   " F-SYNC-RES
430300        DISPLAY " "
430400            ADD 1 TO fail-count
430500          END-IF;
430600
430700* TEST 7 FOR SYNC ITEMS
430800     MOVE 12345678909868546.9 TO ff-sync-item;
430900     MOVE 12345678909868546 TO   FF-SYNC-EXP;
431000     COMPUTE FF-SYNC-RES = FUNCTION INTEGER(ff-sync-item);
431100          IF FF-SYNC-RES = FF-SYNC-EXP THEN
431200            ADD 1 TO pass-count
431300          ELSE
431400        DISPLAY "SYNC ITEM 7 FAILED:"
431500        DISPLAY "test-value = " ff-sync-item
431600        DISPLAY "expected-result = " FF-SYNC-EXP
431700        DISPLAY "actual-result =   " FF-SYNC-RES
431800        DISPLAY " "
431900            ADD 1 TO fail-count
432000          END-IF;
432100
432200* TEST 8 FOR SYNC ITEMS
432300     MOVE -12345678909868546.9 TO ff-sync-item;
432400     MOVE -12345678909868547 TO   FF-SYNC-EXP;
432500     COMPUTE FF-SYNC-RES = FUNCTION INTEGER(ff-sync-item);
432600          IF FF-SYNC-RES = FF-SYNC-EXP THEN
432700            ADD 1 TO pass-count
432800          ELSE
432900        DISPLAY "SYNC ITEM 8 FAILED:"
433000        DISPLAY "test-value = " ff-sync-item
433100        DISPLAY "expected-result = " FF-SYNC-EXP
433200        DISPLAY "actual-result =   " FF-SYNC-RES
433300        DISPLAY " "
433400            ADD 1 TO fail-count
433500          END-IF;
433600
433700* TEST 9 FOR SYNC ITEMS
433800     MOVE 123.9 TO p-sync-item;
433900     MOVE 123 TO   P-SYNC-EXP;
434000     COMPUTE P-SYNC-RES = FUNCTION INTEGER(p-sync-item);
434100          IF P-SYNC-RES = P-SYNC-EXP THEN
434200            ADD 1 TO pass-count
434300          ELSE
434400        DISPLAY "SYNC ITEM 9 FAILED:"
434500        DISPLAY "test-value = " p-sync-item
434600        DISPLAY "expected-result = " P-SYNC-EXP
434700        DISPLAY "actual-result =   " P-SYNC-RES
434800        DISPLAY " "
434900            ADD 1 TO fail-count
435000          END-IF;
435100
435200* TEST 10 FOR SYNC ITEMS
435300     MOVE -123.9 TO p-sync-item;
435400     MOVE -124 TO   P-SYNC-EXP;
435500     COMPUTE P-SYNC-RES = FUNCTION INTEGER(p-sync-item);
435600          IF P-SYNC-RES = P-SYNC-EXP THEN
435700            ADD 1 TO pass-count
435800          ELSE
435900        DISPLAY "SYNC ITEM 10 FAILED:"
436000        DISPLAY "test-value = " p-sync-item
436100        DISPLAY "expected-result = " P-SYNC-EXP
436200        DISPLAY "actual-result =   " P-SYNC-RES
436300        DISPLAY " "
436400            ADD 1 TO fail-count
436500          END-IF;
436600
436700* TEST 11 FOR SYNC ITEMS
436800     MOVE 1048575.9 TO e-sync-item;
436900     MOVE 1048575 TO   E-SYNC-EXP;
437000     COMPUTE E-SYNC-RES = FUNCTION INTEGER(e-sync-item);
437100          IF E-SYNC-RES = E-SYNC-EXP THEN
437200            ADD 1 TO pass-count
437300          ELSE
437400        DISPLAY "SYNC ITEM 11 FAILED:"
437500        DISPLAY "test-value = " e-sync-item
437600        DISPLAY "expected-result = " E-SYNC-EXP
437700        DISPLAY "actual-result =   " E-SYNC-RES
437800        DISPLAY " "
437900            ADD 1 TO fail-count
438000          END-IF;
438100
438200* TEST 12 FOR SYNC ITEMS
438300     MOVE -1048575.9 TO e-sync-item;
438400     MOVE -1048576 TO   E-SYNC-EXP;
438500     COMPUTE E-SYNC-RES = FUNCTION INTEGER(e-sync-item);
438600          IF E-SYNC-RES = E-SYNC-EXP THEN
438700            ADD 1 TO pass-count
438800          ELSE
438900        DISPLAY "SYNC ITEM 12 FAILED:"
439000        DISPLAY "test-value = " e-sync-item
439100        DISPLAY "expected-result = " E-SYNC-EXP
439200        DISPLAY "actual-result =   " E-SYNC-RES
439300        DISPLAY " "
439400            ADD 1 TO fail-count
439500          END-IF;
439600
439700* TEST 13 FOR SYNC ITEMS
           MOVE 4503599627370495   TO d-sync-item;
      *    MOVE 4503599627370495.9 TO d-sync-item;
439900     MOVE 4503599627370495 TO   D-SYNC-EXP;
440000     COMPUTE D-SYNC-RES = FUNCTION INTEGER(d-sync-item);
440100          IF D-SYNC-RES = D-SYNC-EXP THEN
440200            ADD 1 TO pass-count
440300          ELSE
440400        DISPLAY "SYNC ITEM 13 FAILED:"
440500        DISPLAY "test-value = " d-sync-item
440600        DISPLAY "expected-result = " D-SYNC-EXP
440700        DISPLAY "actual-result =   " D-SYNC-RES
440800        DISPLAY " "
440900            ADD 1 TO fail-count
441000          END-IF;
441100
441200* TEST 14 FOR SYNC ITEMS
441300     MOVE -4503599627370495.9 TO d-sync-item;
441400     MOVE -4503599627370496 TO   D-SYNC-EXP;
441500     COMPUTE D-SYNC-RES = FUNCTION INTEGER(d-sync-item);
441600          IF D-SYNC-RES = D-SYNC-EXP THEN
441700            ADD 1 TO pass-count
441800          ELSE
441900        DISPLAY "SYNC ITEM 14 FAILED:"
442000        DISPLAY "test-value = " d-sync-item
442100        DISPLAY "expected-result = " D-SYNC-EXP
442200        DISPLAY "actual-result =   " D-SYNC-RES
442300        DISPLAY " "
442400            ADD 1 TO fail-count
442500          END-IF;
442600
442700       IF fail-count NOT = ZERO AND
442800       pass-count NOT = NUM-OF-TEST
442900       THEN
443000         DISPLAY "SYNC ITEMS FAILED";
               DISPLAY "PASS: " PASS-COUNT " FAIL: " FAIL-COUNT
443100         MOVE 1 TO ANY-FAILED;
443200       END-IF.
443300* END OF SYNC ITEMS
443400
443500 000-test00.
443600*--------------------- TEST BEGINNING ---------------------------
443700*11510000      Numeric Arguments:                   | |
443800*11512000        Zero:                              | |
443900*11512100            Literal                        |f|
444000*11513000        Positive:                          | |
444100*11513200          Valid values from +5.4E-79 to +1 | |
444200*11513210            Literal                        |f|
444300*11513400          Valid values from -1 to -5.4E-79 | |
444400*11513410            Literal                        |f|
444500*11513410            Distributed values:            | |
444600*11513410               +1000 up to +10,000         | |
444700*11513410               +1E+16 up to +1E+17         | |
444800*11513411              Literal                      |f|
444900*11513420            Sensitive points:              |f|
445000*11513421              Literal                      |f|
445100*----------------------------------------------------------------
445200     MOVE " test00 " TO test-type ;
445300
445400     COMPUTE actual =
445500        FUNCTION INTEGER(-10000.0000000000001);
445600     COMPUTE expected = -10001;
445700     PERFORM universal-ver ;
445800
445900     COMPUTE actual =
446000        FUNCTION INTEGER(0);
446100     COMPUTE expected = 0;
446200     PERFORM universal-ver ;
446300
446400     COMPUTE actual =
446500        FUNCTION INTEGER(+1)
446600     COMPUTE expected = 1;
446700     PERFORM universal-ver ;
446800
446900     COMPUTE actual =
447000        FUNCTION INTEGER(+100000000000.000001)
447100     COMPUTE expected = 100000000000
447200     PERFORM universal-ver ;
447300
447400     COMPUTE actual =
447500        FUNCTION INTEGER(.11E+16)
447600     COMPUTE expected = .11E+16;
447700     PERFORM universal-ver ;
447800
447900     COMPUTE actual =
448000        FUNCTION INTEGER(+2.1)
448100     COMPUTE expected = 2;
448200     PERFORM universal-ver ;
448300
448400     COMPUTE actual =
448500        FUNCTION INTEGER(+3.2)
448600     COMPUTE expected = 3;
448700     PERFORM universal-ver ;
448800
448900     COMPUTE actual =
449000        FUNCTION INTEGER(+4.3)
449100     COMPUTE expected = 4;
449200     PERFORM universal-ver ;
449300
449400     COMPUTE actual =
449500        FUNCTION INTEGER(+5.4)
449600     COMPUTE expected = 5;
449700     PERFORM universal-ver ;
449800
449900     COMPUTE actual =
450000        FUNCTION INTEGER(+6.5)
450100     COMPUTE expected = 6;
450200     PERFORM universal-ver ;
450300
450400     COMPUTE actual =
450500        FUNCTION INTEGER(+7.6)
450600     COMPUTE EXPECTED = 7;
450700     PERFORM universal-ver ;
450800
450900     COMPUTE actual =
451000        FUNCTION INTEGER(+8.7)
451100     COMPUTE expected = 8;
451200     PERFORM universal-ver ;
451300
451400     COMPUTE actual =
451500        FUNCTION INTEGER(+9.8)
451600     COMPUTE expected = 9;
451700     PERFORM universal-ver ;
451800
451900     COMPUTE expected = +1000000
452000     COMPUTE actual =
452100       FUNCTION INTEGER(+1000000);
452200     PERFORM universal-ver ;
452300
452400     COMPUTE expected = +1111111
452500     COMPUTE actual =
452600       FUNCTION INTEGER(+1111111.1);
452700     PERFORM universal-ver ;
452800
452900     COMPUTE expected = +1555555
453000     COMPUTE actual =
453100       FUNCTION INTEGER(+1555555.5);
453200     PERFORM universal-ver ;
453300
453400     COMPUTE expected = +1666666
453500     COMPUTE actual =
453600       FUNCTION INTEGER(+1666666.6);
453700     PERFORM universal-ver ;
453800
453900     COMPUTE expected = +1777777
454000     COMPUTE actual =
454100       FUNCTION INTEGER(+1777777.7);
454200     PERFORM universal-ver ;
454300
454400     COMPUTE expected = +1999999
454500     COMPUTE actual =
454600       FUNCTION INTEGER(+1999999.9);
454700     PERFORM universal-ver ;
454800
454900     COMPUTE expected = -1000
455000     COMPUTE actual =
455100       FUNCTION INTEGER(-999.999999999999999);
455200     PERFORM universal-ver ;
455300
455400     COMPUTE expected = +11111111111111111
455500     COMPUTE actual =
455600       FUNCTION INTEGER(+11111111111111111.1);
455700     PERFORM universal-ver ;
455800
455900     COMPUTE expected = +12222222222222222
456000     COMPUTE actual =
456100       FUNCTION INTEGER(+12222222222222222.2);
456200     PERFORM universal-ver ;
456300
456400     COMPUTE expected = +1333333333333333
456500     COMPUTE actual =
456600       FUNCTION INTEGER(+1333333333333333.3);
456700     PERFORM universal-ver ;
456800
456900     COMPUTE expected = +18888888888888888
457000     COMPUTE actual =
457100       FUNCTION INTEGER(+18888888888888888.8);
457200     PERFORM universal-ver ;
457300
457400     COMPUTE expected = +19999999999999999
457500     COMPUTE actual =
457600       FUNCTION INTEGER(+19999999999999999.9);
457700     PERFORM universal-ver ;
457800
457900     COMPUTE expected = -1;
458000     COMPUTE actual =
458100       FUNCTION INTEGER(-1.0E-1);
458200     PERFORM universal-ver ;
458300
458400     COMPUTE expected = -1;
458500     COMPUTE actual =
458600       FUNCTION INTEGER(-1.0E-5);
458700     PERFORM universal-ver ;
458800
458900     COMPUTE expected = -1;
459000     COMPUTE actual =
459100       FUNCTION INTEGER(-1.0E-9);
459200     PERFORM universal-ver ;
459300
459400     COMPUTE expected = -1 ;
459500     COMPUTE actual =
459600       FUNCTION INTEGER(-1.0E-13);
459700     PERFORM universal-ver ;
459800
459900     COMPUTE expected = -1;
460000     COMPUTE actual =
460100       FUNCTION INTEGER(-1.0E-33);
460200     PERFORM universal-ver ;
460300
460400     COMPUTE expected = 0;
460500     COMPUTE actual =
460600       FUNCTION INTEGER(+1.0E-1);
460700     PERFORM universal-ver ;
460800
460900     COMPUTE expected = 0;
461000     COMPUTE actual =
461100       FUNCTION INTEGER(+1.0E-5);
461200     PERFORM universal-ver ;
461300
461400     COMPUTE expected = 0;
461500     COMPUTE actual =
461600       FUNCTION INTEGER(+1.0E-28);
461700     PERFORM universal-ver ;
461800
461900     COMPUTE expected = 0;
462000     COMPUTE actual =
462100       FUNCTION INTEGER(+1.0E-33);
462200     PERFORM universal-ver ;
462300
462400     COMPUTE expected = -1000
462500     COMPUTE actual =
462600       FUNCTION INTEGER(-999.999999999999999);
462700     PERFORM universal-ver ;
462800
462900     COMPUTE expected = -10;
463000     COMPUTE actual =
463100       FUNCTION INTEGER(-9.99999999999999999);
463200     PERFORM universal-ver ;
463300
463400     COMPUTE expected = -1;
463500     COMPUTE actual =
463600       FUNCTION INTEGER(-1.00000000000000000);
463700     PERFORM universal-ver ;
463800
463900     COMPUTE expected = -10000
464000     COMPUTE actual =
464100       FUNCTION INTEGER(-10000.0000000000000);
464200     PERFORM universal-ver ;
464300
464400     COMPUTE expected =  9;
464500     COMPUTE actual =
464600       FUNCTION INTEGER(+9.99999999999999999);
464700     PERFORM universal-ver ;
464800
464900     COMPUTE expected = 9999999999;
465000     COMPUTE actual =
465100       FUNCTION INTEGER(+9999999999.99999999);
465200     PERFORM universal-ver ;
465300
465400     COMPUTE expected = 99999999999;
465500     COMPUTE actual =
465600       FUNCTION INTEGER(+99999999999.9999999);
465700     PERFORM universal-ver ;
465800
465900     COMPUTE expected = 100000;
466000     COMPUTE actual =
466100       FUNCTION INTEGER(+100000.000000000001);
466200     PERFORM universal-ver ;
466300
466400     COMPUTE expected = 10000000000;
466500     COMPUTE actual =
466600       FUNCTION INTEGER(+10000000000.0000001);
466700     PERFORM universal-ver ;
466800
466900     COMPUTE expected = 100000000000;
467000     COMPUTE actual =
467100       FUNCTION INTEGER(+100000000000.000001);
467200     PERFORM universal-ver .
467300
467400 000-test01.
467500*--------------------- TEST BEGINNING ---------------------------
467600*11304200          Variable-length table:           | |
467700*11304210            literal:                       | |
467800*11304213              Subscript = 1                |f|
467900*11304214              Subscript = length/2 & > 1   |f|
468000*11304215              Subscript = length - 1       |f|
468100*11304216              Subscript = length           |f|
468200*11304220            data-name [¤+|-‡ integer]:     | |
468300*11304223              Subscript = 1                |f|
468400*11304224              Subscript = length/2 & > 1   |f|
468500*11304225              Subscript = length - 1       |f|
468600*11304226              Subscript = length           |f|
468700*11313200        integer-2 TO integer-3 TIMES       | |
468800*11313201           DEPENDING ON data-name-1        | |
468900*11313202           (variable-length table):        | |
469000*11313210          data-name-1 positive (>=1):      | |
469100*11313212            data-name-1 >= integer-2       | |
469200*11313213                      & <= integer-3       |f|
469300*---------------------------- FUNCTION TEST ----------------------
469400     MOVE " test01 " TO test-type;
469500     COMPUTE expected = 19;
469600     COMPUTE var-val(1) = 19.987;
469700     COMPUTE actual = FUNCTION INTEGER(var-val(1));
469800     PERFORM universal-ver ;
469900
470000     COMPUTE var-val(8) = 19.987;
470100     COMPUTE actual = FUNCTION INTEGER(var-val(8));
470200     PERFORM universal-ver ;
470300
470400     COMPUTE var-val(7) = 19.987;
470500     COMPUTE actual = FUNCTION INTEGER(var-val(7));
470600     PERFORM universal-ver ;
470700
470800     COMPUTE var-val(4) = 19.987;
470900     COMPUTE actual = FUNCTION INTEGER(var-val(4));
471000     PERFORM universal-ver ;
471100
471200     COMPUTE var-val(Sb - 7) = 19.987;
471300     COMPUTE actual = FUNCTION INTEGER(var-val(Sb - 7));
471400     PERFORM universal-ver ;
471500
471600     COMPUTE var-val(Sb) = 19.987;
471700     COMPUTE actual = FUNCTION INTEGER(var-val(Sb));
471800     PERFORM universal-ver ;
471900
472000     COMPUTE var-val(Sb - 4) = 19.987;
472100     COMPUTE actual = FUNCTION INTEGER(var-val(Sb - 4));
472200     PERFORM universal-ver ;
472300
472400     COMPUTE var-val(Sb - 1) = 19.987;
472500     COMPUTE actual = FUNCTION INTEGER(var-val(Sb - 1));
472600     PERFORM universal-ver .
472700
472800 000-test02.
472900*--------------------- TEST BEGINNING ---------------------------
473000*11410200        ANNUITY /*=>numeric*/              |f|
473100*11413000        PRESENT-VALUE /*=>numeric*/        |f|
473200*---------------------------- FUNCTION TEST ----------------------
473300     MOVE " test02 " TO test-type;
473400     COMPUTE expected = 19190;
473500     COMPUTE actual = FUNCTION INTEGER(
473600     FUNCTION PRESENT-VALUE(-.9 1919));
473700     PERFORM universal-ver .
           COMPUTE actual = FUNCTION INTEGER(
             FUNCTION PRESENT-VALUE(-.9 1919));
473800
473900     COMPUTE expected = 1;
474000     COMPUTE actual = FUNCTION INTEGER(
474100     FUNCTION ANNUITY(1 123455555));
474200     PERFORM universal-ver .
474300
474400 000-test03.
474500*--------------------- TEST BEGINNING ---------------------------
474600*11120000        Numeric Literal Argument:          | |
474700*11121000          Fixed-point:                     | |
474800*11121100            Integer                        |f|
474900*11121100            Non-integer (decimal fraction) |f|
475000*11122000          Floating-point /*IBM*/           |f|
475100*11412400        MOD (integer)                      |f|
475200*11413300        REM /*=>numeric*/                  |f|
475300*11433000        Numeric function arith-operator    | |
475400*11433001           integer function                |f|
475500*---------------------------- FUNCTION TEST ----------------------
475600     MOVE " test03 " TO test-type;
475700
475720     COMPUTE expected = 0;
475800     COMPUTE actual = FUNCTION INTEGER(FUNCTION REM(6 2)
475900     + FUNCTION MOD(3 3));
476000     PERFORM universal-ver ;
476100
476200     COMPUTE expected = 0;
476300     COMPUTE actual = FUNCTION INTEGER(FUNCTION REM(6 2));
476400     PERFORM universal-ver ;
476500
476600     COMPUTE expected = 0;
476700     COMPUTE actual = FUNCTION INTEGER(FUNCTION MOD(6 2));
476800     PERFORM universal-ver ;
476900
477000     COMPUTE expected = +1234;
477100     COMPUTE actual = FUNCTION INTEGER(+1234);
477200     PERFORM universal-ver ;
477300
477400     COMPUTE expected = +1234;
477500     COMPUTE actual = FUNCTION INTEGER(+1234.99);
477600     PERFORM universal-ver ;
477700
477800     COMPUTE expected = 38;
477900     COMPUTE actual = FUNCTION INTEGER(.3883E+02);
478000     PERFORM universal-ver .
478100
478200 000-test04.
478300*----------------------- TEST BEGINNING -------------------------
478400*11411200        INTEGER-OF-DAY /*=>integer*/       |f|
478500*11411300        INTEGER-OF-DATE /*=>integer*/      |f|
478600*---------------------------- FUNCTION TEST ----------------------
478700     MOVE " test04 " TO test-type;
478800     COMPUTE expected = 10;
478900     COMPUTE actual = FUNCTION INTEGER(
479000     FUNCTION INTEGER-OF-DAY(1601010));
479100     PERFORM universal-ver ;
479200
479300     COMPUTE expected = 1;
479400     COMPUTE actual = FUNCTION INTEGER(
479500     FUNCTION INTEGER-OF-DATE(16010101));
479600     PERFORM universal-ver.
479700
479800 000-test05.
479900*--------------------- TEST BEGINNING ---------------------------
480000*11410800        DATE-OF-INTEGER /*=>integer*/      |f|
480100*11410900        DAY-OF-INTEGER /*=>integer*/       |f|
480200*---------------------------- FUNCTION TEST ----------------------
480300     MOVE " test05 " TO test-type;
480400     COMPUTE expected = 1601123 ;
480500     COMPUTE actual = FUNCTION INTEGER(
480600      FUNCTION DAY-OF-INTEGER(123));
480700     PERFORM universal-ver ;
480800
480900     COMPUTE expected = 16010118;
481000     COMPUTE actual = FUNCTION INTEGER(
481100      FUNCTION DATE-OF-INTEGER(18));
481200     PERFORM universal-ver .
481300
481400 000-test06.
481500*--------------------- TEST BEGINNING ---------------------------
481600*11413600        SQRT /*=>numeric*/                 |f|
481700*---------------------------- FUNCTION TEST ----------------------
481800     MOVE " test06 " TO test-type;
481900     COMPUTE expected = 4;
482000     COMPUTE actual = FUNCTION INTEGER(
482100     FUNCTION SQRT(16));
482200     PERFORM universal-ver .
482300
482400 000-test07.
482500*----------------------- TEST BEGINNING -------------------------
482600*11412000        MEAN /*=>numeric*/                 |f|
482700*11412100        MEDIAN /*=>numeric*/               |f|
482800*---------------------------- FUNCTION TEST ----------------------
482900     MOVE " test07 " TO test-type;
483000     COMPUTE actual = FUNCTION INTEGER(FUNCTION MEDIAN(
483100      1 +7.297488235509698E+01 100));
483200     COMPUTE expected = 72;
483300     PERFORM universal-ver ;
483400
483500     COMPUTE expected = 0;
483600     COMPUTE actual = FUNCTION INTEGER(FUNCTION MEAN(- 2 2));
483700     PERFORM universal-ver .
483800
483900 000-test08.
484000*----------------------- TEST BEGINNING -------------------------
484100*11512000 ³      Zero:                              | |
484200*11512100            Literal                        |f|
484300*----------------------------------------------------------------
484400     MOVE " test08 " TO test-type;
484500     COMPUTE actual   = FUNCTION INTEGER(0);
484600     COMPUTE expected = 0;
484700     PERFORM universal-ver.
484800
484900 000-test09.
485000*----------------------- TEST BEGINNING -------------------------
485100*11421000        Addition (infix +):                | |
485200*11421100          Integer operands                 |f|
485300*11421200          Numeric operands                 |f|
485400*11422000        Subtraction (infix -):             | |
485500*11422100          Integer operands                 |f|
485600*11422200          Numeric operands                 |f|
485700*11423000        Multiplication (infix *):          | |
485800*11423100          Integer operands                 |f|
485900*11423200          Numeric operands                 |f|
486000*11424000        Division (infix /):                | |
486100*11424100          Integer operands                 |f|
486200*11424200          Numeric operands                 |f|
486300*11425000        Exponentiation (infix **):         | |
486400*11425100          Integer operands                 |f|
486500*11425200          Numeric operands                 |f|
486600*11427000        Negation (prefix -):               | |
486700*11427100          Integer operand                  |f|
486800*11427200          Numeric operand                  |f|
486900*---------------------------- FUNCTION TEST ----------------------
487000     MOVE " test09" TO test-type;
487100     COMPUTE expected = 1;
487200     COMPUTE actual = FUNCTION INTEGER((1 ** 1));
487300     PERFORM universal-ver ;
487400
487500     COMPUTE expected = 0;
487600     COMPUTE actual = FUNCTION INTEGER(3.1 - 3.1);
487700     PERFORM universal-ver ;
487800
487900     COMPUTE expected = 5;
488000     COMPUTE actual = FUNCTION INTEGER((.6 * 9) - (.1 * 1));
488100     PERFORM universal-ver ;
488200
488300     COMPUTE expected = 1;
488400     COMPUTE actual = FUNCTION INTEGER((3.1 / 1.1) - 1);
488500     PERFORM universal-ver ;
488600
488700     COMPUTE expected = 4;
488800     COMPUTE actual = FUNCTION INTEGER( - 3.1 + 7.1);
488900     PERFORM universal-ver ;
489000
489100     COMPUTE expected = -1;
489200     COMPUTE actual = FUNCTION INTEGER(2 - 3);
489300     PERFORM universal-ver ;
489400
489500     COMPUTE expected = 0;
489600     COMPUTE actual = FUNCTION INTEGER(.2 * 0.0);
489700     PERFORM universal-ver ;
489800
489900     COMPUTE expected = 0;
490000     COMPUTE actual = FUNCTION INTEGER((2 / 333) - (1 / 333))
490100     PERFORM universal-ver ;
490200
490300     COMPUTE expected = 0;
490400     COMPUTE actual = FUNCTION INTEGER( - 3 + 3);
490500     PERFORM universal-ver .
490600
490700 000-test10.
490800*----------------------- TEST BEGINNING -------------------------
490900*11208000        LINAGE-COUNTER (num)               |f|
491000*11210000        LENGTH OF (num) /*IBM*/            |f|
491100*11211000        RETURN-CODE (num) /*IBM*/          |f|
491200*11215000        SORT-RETURN  (num) /*IBM*/         |f|
491300*11216000        SORT-CORE-SIZE (num) /*IBM*/       |f|
491400*11217000        SORT-FILE-SIZE (num) /*IBM*/       |f|
491500*11219000        SORT-MODE-SIZE (num) /*IBM*/       |f|
491600*11220000        TALLY (num) /*IBM*/                |f|
491700*-----------------------------------------------------------------
491800     MOVE " test10 " TO test-type;
491900     COMPUTE expected = 2;
492000     COMPUTE actual =
492100     FUNCTION INTEGER(LENGTH OF Sb );
492200     PERFORM universal-ver;
492300
492400     COMPUTE expected = 0;
492500     COMPUTE actual =
492600     FUNCTION INTEGER(RETURN-CODE);
492700     PERFORM universal-ver;
492800
492900     COMPUTE expected = 1;
493000     COMPUTE RETURN-CODE = 1;
493100     COMPUTE actual = FUNCTION INTEGER(RETURN-CODE);
493200     PERFORM universal-ver;
493300
493400     COMPUTE expected = 8;
493500     MOVE  8.8        TO SORT-RETURN;
493600     COMPUTE actual = FUNCTION INTEGER(SORT-RETURN);
493700     PERFORM universal-ver;
493800
493900     COMPUTE expected = 1;
494000     COMPUTE SORT-CORE-SIZE = 1.2;
494100     COMPUTE actual = FUNCTION INTEGER(SORT-CORE-SIZE);
494200     PERFORM universal-ver;
494300
494400     COMPUTE expected = 1;
494500     COMPUTE SORT-MODE-SIZE = 1.2;
494600     COMPUTE actual = FUNCTION INTEGER(SORT-MODE-SIZE)
494700     PERFORM universal-ver;
494800
494900     COMPUTE SORT-FILE-SIZE = 1.2;
495000     COMPUTE expected = 1;
495100     COMPUTE actual = FUNCTION INTEGER(SORT-FILE-SIZE)
495200     PERFORM universal-ver;
495300
495400     COMPUTE expected = 1;
495500     COMPUTE TALLY = 1.2;
495600     COMPUTE actual = FUNCTION INTEGER(TALLY)
495700     PERFORM universal-ver.
495800
495900 000-test11.
496000*--------------------- TEST BEGINNING ---------------------------
496100*11412500        NUMVAL /*=>numeric*/               |f|
496200*11412600        NUMVAL-C /*=>numeric*/             |f|
496300*11413100        RANDOM /*=>numeric*/               |f|
496400*---------------------------- FUNCTION TEST ----------------------
496500     MOVE " test11 " TO test-type;
496600     COMPUTE expected = 0;
496700     COMPUTE actual = FUNCTION INTEGER(FUNCTION NUMVAL("0"));
496800     PERFORM universal-ver ;
496900
497000     COMPUTE expected = 3;
497100     COMPUTE actual = FUNCTION INTEGER(
497200     FUNCTION NUMVAL-C("$3"));
497300     PERFORM universal-ver ;
497400
497500     COMPUTE expected = 0;
497600     COMPUTE actual = FUNCTION INTEGER(FUNCTION RANDOM(0));
497700     PERFORM universal-ver .
497800
497900 000-test12.
498000*--------------------- TEST BEGINNING ---------------------------
498100*11410100        ACOS /*=>numeric*/                 |f|
498200*11410300        ASIN /*=>numeric*/                 |f|
498300*11410400        ATAN /*=>numeric*/                 |f|
498400*11410600        COS /*=>numeric*/                  |f|
498500*11411600        LOG /*=>numeric*/                  |f|
498600*11411700        LOG10 /*=>numeric*/                |f|
498700*11413500        SIN /*=>numeric*/                  |f|
498800*11413900        TAN /*=>numeric*/                  |f|
498900*11431000        Integer function arith-operator    | |
499000*                   integer function                |f|
499100*---------------------------- FUNCTION TEST ----------------------
499200     MOVE " test12 " TO test-type;
499300     COMPUTE expected = -181;
499400     COMPUTE actual = FUNCTION INTEGER(FUNCTION LOG(.54E-78))
499500     PERFORM universal-ver ;
499600
499700     COMPUTE expected = 0;
499800     COMPUTE actual = FUNCTION INTEGER(FUNCTION LOG10(1.4));
499900     PERFORM universal-ver ;
500000
500100     COMPUTE expected = 0;
500200     COMPUTE actual = FUNCTION INTEGER(FUNCTION COS(1.3));
500300     PERFORM universal-ver ;
500400
500500     COMPUTE expected = 1;
500600     COMPUTE actual = FUNCTION INTEGER(FUNCTION ACOS(.1));
500700     PERFORM universal-ver ;
500800
500900     COMPUTE expected = 1;
501000     COMPUTE actual = FUNCTION INTEGER(FUNCTION TAN(1.1));
501100     PERFORM universal-ver ;
501200
501300     COMPUTE expected = 0;
501400     COMPUTE actual = FUNCTION INTEGER(FUNCTION ASIN(0.7));
501500     PERFORM universal-ver ;
501600
501700     COMPUTE expected = 0;
501800     COMPUTE actual = FUNCTION INTEGER(FUNCTION SIN(1.4));
501900     PERFORM universal-ver .
502000
502100 000-test13.
502200*----------------------- TEST BEGINNING -------------------------
502300*11412200        MIDRANGE /*=>numeric*/             |f|
502400*11413700        STANDARD-DEVIATION /*=>numeric*/   |f|
502500*11414100        VARIANCE /*=>numeric*/             |f|
502600*---------------------------- FUNCTION TEST ----------------------
502700     MOVE " test13 " TO test-type;
502800     COMPUTE expected = 3;
502900     COMPUTE actual = FUNCTION INTEGER(
503000     FUNCTION MIDRANGE(12 6 - 12));
503100     PERFORM universal-ver ;
503200
503300     COMPUTE expected = 1056;
503400     COMPUTE actual = FUNCTION INTEGER(
503500     FUNCTION VARIANCE(12 77));
503600     PERFORM universal-ver ;
503700
503800     COMPUTE expected = 0;
503900     COMPUTE actual = FUNCTION INTEGER(
504000     FUNCTION STANDARD-DEVIATION(15));
504100     PERFORM universal-ver .
504200
504300 000-test14.
504400*----------------------- TEST BEGINNING -------------------------
504500*11413200        RANGE (generic):                   | |
504600*11413210          All integer arguments            |f|
504700*11413220          All numeric arguments            |f|
504800*11413230          Mixed numeric & integer arguments|f|
504900*--------------------------- FUNCTION TEST -----------------------
505000     MOVE " test14 " TO test-type;
505100     COMPUTE expected = 0;
505200     COMPUTE actual = FUNCTION INTEGER(
505300     FUNCTION RANGE(19  19));
505400     PERFORM universal-ver ;
505500
505600     COMPUTE expected = 0;
505700     COMPUTE actual = FUNCTION INTEGER(
505800     FUNCTION RANGE(19.3 - 19.3));
505900     PERFORM universal-ver ;
506000
506100     COMPUTE expected = 0;
506200     COMPUTE actual = FUNCTION INTEGER(
506300     FUNCTION RANGE(19  19.00));
506400     PERFORM universal-ver .
506500
506600 000-test15.
506700*--------------------------- TEST BEGINNING --------------------*
506800*11413800        SUM (generic):                     | |
506900*11413810          All integer arguments            |f|
507000*11413820          All numeric arguments            |f|
507100*11413830          Mixed numeric & integer arguments|f|
507200*11432000        Numeric function arith-operator    | |
507300*                   numeric function                |f|
507400*---------------------------- FUNCTION TEST ----------------------
507500     MOVE " test15 " TO test-type;
507600     COMPUTE expected = 0;
507700     COMPUTE actual = FUNCTION INTEGER(
507800     FUNCTION SUM(19 - 19));
507900     PERFORM universal-ver ;
508000
508100     COMPUTE expected = 0;
508200     COMPUTE actual = FUNCTION INTEGER(
508300     FUNCTION SUM(1.9 - 1.9));
508400     PERFORM universal-ver ;
508500
508600     COMPUTE expected = 0;
508700     COMPUTE actual = FUNCTION INTEGER(
508800     FUNCTION SUM(19.0 - 19));
508900     PERFORM universal-ver .
509000
509100 000-test16.
509200*--------------------------- TEST BEGINNING --------------------*
509300*11301960            External floating point        |f|
509400*11313300        Table size:                        | |
509500*11313310          Under 64K                        |f|
509600*11313400        Dimensionality:                    | |
509700*11313410          1 through 7                      |f|
509800*11314100        FD                                 |f|
509900*------------------------ SET THE ARRAY -------------------------*
510000     COMPUTE ar-multi(1 1 1 1 1 1 2) =  8.999;
510100     COMPUTE ar-multi3(1 1 2) =  8.999;
510200     COMPUTE ar-multi(1 1 1 1 1 1 3) = 8;
510300     COMPUTE ar-multi3(1 1 3) = 8;
510400*---------------------------- FUNCTION TEST ----------------------
510500     MOVE " test16 " TO test-type;
510600     COMPUTE ar-multi(1 1 1 1 1 1 1) = FUNCTION INTEGER(
510700     ar-multi(1 1 1 1 1 1 2));
510800     COMPUTE actual = ar-multi(1 1 1 1 1 1 1)
510900     COMPUTE expected = ar-multi(1 1 1 1 1 1 3)
511000     PERFORM universal-ver;
511100
511200     COMPUTE ar-multi3(1 1 1) = FUNCTION INTEGER(
511300     ar-multi3(1 1 2));
511400     COMPUTE actual = ar-multi3(1 1 1)
511500     COMPUTE expected = ar-multi3(1 1 3)
511600     PERFORM universal-ver;
511700
512500 000-test17.
512600*------------------- TEST BEGINNING *---------------------------*
512700*11411900        MAX (generic):                     | |
512800*11411920          All integer arguments            |f|
512900*11411930          All numeric arguments            |f|
513000*11411940          Mixed numeric & integer arguments|f|
513100*11412300        MIN (generic):                     | |
513200*11412320          All integer arguments            |f|
513300*11412330          All numeric arguments            |f|
513400*11412340          Mixed numeric & integer arguments|f|
513500*--------------------------- SET THE ARRAY -----------------------
513600     MOVE " test17 " TO test-type;
513700     COMPUTE expected = 3;
513800     COMPUTE actual = FUNCTION INTEGER(
513900     FUNCTION MAX(-1 3));
514000     PERFORM universal-ver ;
514100
514200     COMPUTE expected = 0;
514300     COMPUTE actual = FUNCTION INTEGER(
514400     FUNCTION MAX(-1.2 0.1));
514500     PERFORM universal-ver ;
514600
514700     COMPUTE expected = 0;
514800     COMPUTE actual = FUNCTION INTEGER(
514900     FUNCTION MAX(-1 0.9));
515000     PERFORM universal-ver ;
515100
515200     COMPUTE expected = 3;
515300     COMPUTE actual = FUNCTION INTEGER(
515400     FUNCTION MIN(11 3));
515500     PERFORM universal-ver ;
515600
515700     COMPUTE expected = 1;
515800     COMPUTE actual = FUNCTION INTEGER(
515900     FUNCTION MIN(1.2 1.4));
516000     PERFORM universal-ver ;
516100
516200     COMPUTE expected = 1;
516300     COMPUTE actual = FUNCTION INTEGER(
516400     FUNCTION MIN(1.1 6));
516500     PERFORM universal-ver .
516600
516700 000-test18.
516800*----------------------- TEST BEGINNING -------------------------
516900*11411100        INTEGER /*=>integer*/              |f|
517000*11411400        INTEGER-PART /*=>integer*/         |f|
517100*---------------------------- FUNCTION TEST ----------------------
517200     MOVE " test18 " TO test-type;
517300     COMPUTE expected = 0;
517400     COMPUTE actual = FUNCTION INTEGER(
517500     FUNCTION INTEGER(0.2));
517600     PERFORM universal-ver ;
517700
517800     COMPUTE expected = 0;
517900     COMPUTE actual = FUNCTION INTEGER(
518000     FUNCTION INTEGER-PART(0.2));
518100     PERFORM universal-ver .
518200
518300 000-test19.
518400*----------------------- TEST BEGINNING -------------------------
518500*11301500          COMP-4/BINARY                    |f|
518600*11411000        FACTORIAL /*=>integer*/            |f|
518700*11411500        LENGTH /*=>integer*/               |f|
518800*---------------------------- FUNCTION TEST ----------------------
518900     MOVE " test19 " TO test-type;
519000     COMPUTE expected = 6;
519100*    COMPUTE actual = FUNCTION INTEGER(FUNCTION FACTORIAL(3));
519200*    PERFORM universal-ver;
519300
519400     COMPUTE expected = 8;
519500     COMPUTE actual = FUNCTION INTEGER(
519600     FUNCTION LENGTH(var-val(4)));
519700     PERFORM universal-ver;
519800
519900     COMPUTE Sb = 8;
520000     COMPUTE expected = 8;
520100     COMPUTE actual = FUNCTION INTEGER(Sb);
520200     PERFORM universal-ver.
520300
520400 000-test20.
520500*----------------------- TEST BEGINNING -------------------------
520600*11412800        ORD-MAX /*=>integer*/              |f|
520700*11412900        ORD-MIN /*=>integer*/              |f|
520800*---------------------------- FUNCTION TEST ----------------------
520900     MOVE " test20 " TO test-type;
521000     COMPUTE expected = 1;
521100     COMPUTE actual = FUNCTION INTEGER(
521200     FUNCTION ORD-MAX(0));
521300     PERFORM universal-ver ;
521400
521500     COMPUTE expected = 1;
521600     COMPUTE actual = FUNCTION INTEGER(
521700     FUNCTION ORD-MIN(0));
521800     PERFORM universal-ver .
521900
522000 000-test21.
522100*----------------------- TEST BEGINNING -------------------------
522200*11412700        ORD /*=>integer*/                  |f|
522300*---------------------------- FUNCTION TEST ----------------------
522400     MOVE " test21 " TO test-type;
      *    COMPUTE expected = 98;
           COMPUTE expected = 130;
522600     COMPUTE actual = FUNCTION INTEGER(
522700     FUNCTION ORD("a"));
522800     PERFORM universal-ver .
522900
523000*--------------------------------------------------------
523100 universal-ver.
523200     IF (actual = expected)  THEN
523300          ADD 1 to pass-count
523400     ELSE
523500          ADD 1 TO fail-count
523600          DISPLAY test-type;
523700          DISPLAY " actual result   "  actual;
523800          DISPLAY " expected result "  expected;
523900     END-IF.
524000
524100 END PROGRAM FNINT01.
524200*--------------------------------------------------------

