       PROCESS SYNC.
       IDENTIFICATION DIVISION.                                         LB200020
                                                                        LB200030
      ******************************************************************LB200040
      *  2/21/89                    TESTCASE DOCUMENTATION              LB200050
      *                                                                 LB200060
      * TESTCASE NAME: LB2G341      LIBRARY: CB0R210     PRODUCT: SLCB LB200070
      *                                                                 LB200080
      * DESCRIPTION:                                                    LB200090
      *                                                                 LB200100
      *   SYNCHRONIZED CLAUSE - THE ALIGNMENT OF AN comp-5 ELEMENTARY I LB200110
      *   ON ITS NATURAL BOUNDARY IS TESTED WITH THE SYNCHRONIZED CLAUSELB200120
      *   SPECIFIED FOR THAT ITEM. THE RESULTS OF THE SYNCHRONIZED CLAUSLB200130
      *   IS VERIFIED BY CHECKING THE VALUES OF DATA ITEMS AFTER A MOVE LB200140
      *   THESE ITEMS ARE PERFORMED. SEE CONDITIONS.                    LB200150
      *                                                                 LB200160
      * ANALYSIS METHOD:     SLFCHK         FUNCTIONAL: X      OPERATOR LB200170
      * SYSTEM VIEW:         400            COMPILE:           TAPE:    LB200180
      * ENVIRONMENT:         BTH            RUN TIME:          DISKETTE:LB200190
      * TESTCASE INITIATION: RUNATEST       SYNTAX:            MESSAGE: LB200200
      *                                                                 LB200210
      * FEATURES:                                                       LB200220
      *                                                                 LB200230
      * SYNC          SYNCHRONIZED CLAUSE                               LB200240
      *                                                                 LB200250
      * SUB FEATURES:                                                   LB200260
      *                                                                 LB200270
      *   ELEMENTARY/SUBORDINATE DATA ITEM                              LB200280
      *        NUMERIC ITEM                                             LB200290
      *   MORE THAN ONE  comp-5 ITEMS SPECIFIED                         LB200300
      *   SYNCHRONIZED / SYNC WITH LEFT / RIGHT                         LB200310
      *   SYNCHRONIZED / SYNC WITHOUT LEFT / RIGHT                      LB200320
      *   USAGE IS                                                      LB200330
      *          comp-5                                                 LB200340
      *         comp-5                                                  LB200350
      *         COMPUTATIONAL-5                                         LB200360
      *   WITH PICTURE                                                  LB200370
      *         S9(1)                                                   LB200380
      *         S9(3)                                                   LB200390
      *         S9(4)                                                   LB200400
      *         S9(5)                                                   LB200410
      *         S9(6)                                                   LB200420
      *         S9(9)                                                   LB200430
      *         S9(10)                                                  LB200440
      *         S9(15)                                                  LB200450
      *         S9(18)                                                  LB200460
      *                                                                 LB200470
      * SPECIAL INSTRUCTIONS:                                           LB200480
      *                                                                 LB200490
      *   IT IS RECOMENDED THAT RUNATEST BE USED TO RUN THIS TESTCASE.  LB200500
      *                                                                 LB200510
      * EXPECTED RESULTS:                                               LB200520
      *                                                                 LB200530
      *   SEE OUTPUT RESULTS. RUNATEST SHOULD RETURN PASS/FAIL RESULT.  LB200540
      *                                                                 LB200550
      *     REQUIRED SOURCE                 DEPENDENT          DEPENDENTLB200560
      * MEMBER NAME  SOURCE FILE            TESTCASES          OBJECTS  LB200570
      *                                                                 LB200580
      * LB2 341       QLBLSRC                                           LB200590
      *                                                                 LB200600
      ******************************************************************LB200610
                                                                        LB200620
       PROGRAM-ID. LB2G341.                                             LB200630
       ENVIRONMENT DIVISION.                                            LB200640
       CONFIGURATION SECTION.                                           LB200650
       SOURCE-COMPUTER. IBM-AS400.                                      LB200660
       OBJECT-COMPUTER. IBM-AS400.                                      LB200670
                                                                        LB200680
       INPUT-OUTPUT SECTION.                                            LB200690
       FILE-CONTROL.                                                    LB200700
           SELECT PRTG341 ASSIGN TO PRINTER-qprint.                     LB200710
                                                                        LB200720
       DATA DIVISION.                                                   LB200730
                                                                        LB200740
       FILE SECTION.                                                    LB200750
                                                                        LB200760
       FD  PRTG341                                                      LB200770
             LABEL RECORDS OMITTED.                                     LB200780
       01   REPORT-RECORD              PIC X(80).                       LB200790
                                                                        LB200800
       WORKING-STORAGE SECTION.                                         LB200810
                                                                        LB200820
      *                                                                 LB200830
      *   ACTUAL VALUE OF DATA TO BE MOVED IS IN "SEND-DATA"            LB200840
      *                                                                 LB200850
       01  SEND-DATA PIC 9(18) VALUE 123456789876543219.                LB200860
      *                                                                 LB200870
      *  GROUP FIELDS FOR MOVES TO EVALUATE  INCLUSION OF SLACK BYTES   LB200880
      *  IN  comp-5 FIELDS WHERE SYNC SPECIFIED                         LB200890
      *  DATA NAMES CONSTRUCTED AS FOLLOWS:-                            LB200900
      *  G = GROUP, N FOR NUMBER OF  comp-5 DIGITS: S/R SENDING OR      LB200910
      *  RECEIVING FLD: B = " comp-5", C="comp-5", C4="COMPUTATIONAL-5" LB200920
      *  S="SYNC", SD="SYNCHRONIZED, L="LEFT", R="RIGHT".               LB200930
      *  FIELDS USE SAME CODES WITH PREFIX F.                           LB200940
      *  FILLER AT START OF GROUP TO FORCE INCLUSION OF SLACK BYTES     LB200950
      *  BEFORE START OF  comp-5 SYNC FIELD.  IN THE RECEIVING          LB200960
      *  GROUP THE SLACK BYTES ARE SPECIFIED.                           LB200970
                                                                        LB200980
       01  G1-S-BSD.                                                    LB200990
           03 FILLER           PIC X.                                   LB201000
           03 F1-S-BSD         PIC S9  comp-5 SYNCHRONIZED.             LB201010
       01  G1-S-BSDL.                                                   LB201020
           05 FILLER           PIC X.                                   LB201030
           05 F1-S-BSDL        PIC S9  comp-5 SYNCHRONIZED LEFT.        LB201040
       01  G1-S-BSDR.                                                   LB201050
           03 FILLER           PIC X.                                   LB201060
           03 F1-S-BSDR        PIC S9  comp-5 SYNCHRONIZED RIGHT.       LB201070
       01  G1-S-BS.                                                     LB201080
           06 FILLER           PIC X.                                   LB201090
           06 F1-S-BS          PIC S9  comp-5 SYNC.                     LB201100
       01  G1-S-BSL.                                                    LB201110
           03 FILLA            PIC X.                                   LB201120
           03 F1-S-BSL         PIC S9  comp-5 SYNC LEFT.                LB201130
       01  G1-S-BSR.                                                    LB201140
           03 FILLER           PIC X.                                   LB201150
           03 F1-S-BSR         PIC S9  comp-5 SYNC RIGHT.               LB201160
       01  G1-S-CSD.                                                    LB201170
           07 FRED             PIC X.                                   LB201180
           07 F1-S-CSD         PIC S9 comp-5 SYNCHRONIZED.              LB201190
       01  G1-S-CSDL.                                                   LB201200
           03 FILLER           PIC X.                                   LB201210
           03 F1-S-CSDL        PIC S9 comp-5 SYNCHRONIZED LEFT.         LB201220
       01  G1-S-CSDR.                                                   LB201230
           03 FILLER           PIC X.                                   LB201240
           03 F1-S-CSDR        PIC S9 comp-5 SYNCHRONIZED RIGHT.        LB201250
       01  G1-S-CS.                                                     LB201260
           03 FILLER           PIC X.                                   LB201270
           03 F1-S-CS          PIC S9 comp-5 SYNC.                      LB201280
       77  FLY-IN-OINTMENT  comp-5 SYNC PIC 9(5).                       LB201290
       01  G1-S-CSL.                                                    LB201300
           08 FILLER           PIC X.                                   LB201310
           08 F1-S-CSL         PIC S9 comp-5 SYNC LEFT.                 LB201320
       01  G1-S-CSR.                                                    LB201330
           03 FILLER           PIC X.                                   LB201340
           03 F1-S-CSR         PIC S9 comp-5 SYNC RIGHT.                LB201350
       01  G1-S-C4S.                                                    LB201360
           09 A                PIC X.                                   LB201370
           09 F1-S-C4S         PIC S9 COMPUTATIONAL-5 SYNC.             LB201380
       01  G1-S-C4SL.                                                   LB201390
           03 FILLER           PIC X.                                   LB201400
           03 F1-S-C4SL        PIC S9 COMPUTATIONAL-5 SYNC LEFT.        LB201410
       01  G1-S-C4SR.                                                   LB201420
           03 FILLER           PIC X.                                   LB201430
           03 F1-S-C4SR        PIC S9 COMPUTATIONAL-5 SYNC RIGHT.       LB201440
       01  G1-S-C4SD.                                                   LB201450
           10 FILLER           PIC X.                                   LB201460
           10 F1-S-C4SD        PIC S9 COMPUTATIONAL-5 SYNCHRONIZED.     LB201470
       01  G1-S-C4SDL.                                                  LB201480
           03 FILLER           PIC X.                                   LB201490
           03 F1-S-C4SDL       PIC S9 COMPUTATIONAL-5 SYNCHRONIZED      LB201500
                                                      LEFT.             LB201510
       01  G1-S-C4SDR.                                                  LB201520
           03 FILLER           PIC X.                                   LB201530
           03 F1-S-C4SDR       PIC S9 COMPUTATIONAL-5 SYNCHRONIZED      LB201540
                                                      RIGHT.            LB201550
       01  G1-R-B.                                                      LB201560
           21 B                PIC X.                                   LB201570
           21 SLACK-BYTES      PIC X.                                   LB201580
           21 F1-R-B           PIC S9  comp-5.                          LB201590
       01  G1-R-C.                                                      LB201600
           03 FILLER           PIC X.                                   LB201610
           03 SLACK-BYTES      PIC X.                                   LB201620
           03 F1-R-C           PIC S9 comp-5.                           LB201630
       77  ANOTHER-FLY comp-5 SYNCHRONIZED RIGHT PIC S9(8).             LB201640
       01  G1-R-C4.                                                     LB201650
           03 FILLER           PIC X.                                   LB201660
           03 SLACK-BYTES      PIC X.                                   LB201670
           03 F1-R-C4          PIC S9 COMPUTATIONAL-5.                  LB201680
       01  G3-S-BSD.                                                    LB201690
           03 FILLER           PIC X.                                   LB201700
           03 F3-S-BSD         PIC S9  comp-5 SYNCHRONIZED.             LB201710
       01  G3-S-BSDL.                                                   LB201720
           03 FILLER           PIC X.                                   LB201730
           03 F3-S-BSDL        PIC S999  comp-5 SYNCHRONIZED LEFT.      LB201740
       01  G3-S-BSDR.                                                   LB201750
           35 FILLER           PIC X.                                   LB201760
           35 F3-S-BSDR        PIC S999  comp-5 SYNCHRONIZED RIGHT.     LB201770
       01  G3-S-BS.                                                     LB201780
           03 FILLER           PIC X.                                   LB201790
           03 F3-S-BS          PIC S999  comp-5 SYNC.                   LB201800
       01  G3-S-BSL.                                                    LB201810
           03 C                PIC X.                                   LB201820
           03 F3-S-BSL         PIC S999  comp-5 SYNC LEFT.              LB201830
       01  G3-S-BSR.                                                    LB201840
           03 FILLER           PIC X.                                   LB201850
           03 F3-S-BSR         PIC S999  comp-5 SYNC RIGHT.             LB201860
       01  G3-S-CSD.                                                    LB201870
           03 FILLER           PIC X.                                   LB201880
           03 F3-S-CSD         PIC S999 comp-5 SYNCHRONIZED.            LB201890
       01  G3-S-CSDL.                                                   LB201900
           03 FILLER           PIC X.                                   LB201910
           03 F3-S-CSDL        PIC S999 comp-5 SYNCHRONIZED LEFT.       LB201920
       01  G3-S-CSDR.                                                   LB201930
           46 FILLER           PIC X.                                   LB201940
           46 F3-S-CSDR        PIC S999 comp-5 SYNCHRONIZED RIGHT.      LB201950
       01  G3-S-CS.                                                     LB201960
           03 FILLER           PIC X.                                   LB201970
           03 F3-S-CS          PIC S999 comp-5 SYNC.                    LB201980
       01  G3-S-CSL.                                                    LB201990
           03 D                PIC X.                                   LB202000
           03 F3-S-CSL         PIC S999 comp-5 SYNC LEFT.               LB202010
       01  G3-S-CSR.                                                    LB202020
           03 FILLER           PIC X.                                   LB202030
           03 F3-S-CSR         PIC S999 comp-5 SYNC RIGHT.              LB202040
       01  G3-S-C4SD.                                                   LB202050
           03 FILLER           PIC X.                                   LB202060
           03 F3-S-C4SD        PIC S999 COMPUTATIONAL-5 SYNCHRONIZED.   LB202070
       01  G3-S-C4SDL.                                                  LB202080
           03 FILLER           PIC X.                                   LB202090
           03 F3-S-C4SDL       PIC S999 COMPUTATIONAL-5 SYNCHRONIZED    LB202100
                                                        LEFT.           LB202110
       01  G3-S-C4SDR.                                                  LB202120
           48 FILLER           PIC X.                                   LB202130
           48 F3-S-C4SDR       PIC S999 COMPUTATIONAL-5 SYNCHRONIZED    LB202140
                                                        RIGHT.          LB202150
       01  G3-S-C4S.                                                    LB202160
           03 FILLER           PIC X.                                   LB202170
           03 F3-S-C4S         PIC S999 COMPUTATIONAL-5 SYNC.           LB202180
       01  G3-S-C4SL.                                                   LB202190
           03 E                PIC X.                                   LB202200
           03 F3-S-C4SL        PIC S999 COMPUTATIONAL-5 SYNC LEFT.      LB202210
       01  G3-S-C4SR.                                                   LB202220
           03 FILLER           PIC X.                                   LB202230
           03 F3-S-C4SR        PIC S999 COMPUTATIONAL-5 SYNC RIGHT.     LB202240
       01  G3-R-B.                                                      LB202250
           03 FILLER           PIC X.                                   LB202260
           03 SLACK-BYTES      PIC X.                                   LB202270
           03 F3-R-B           PIC S999  comp-5.                        LB202280
       01  G3-R-C.                                                      LB202290
           03 FILLER           PIC X.                                   LB202300
           03 SLACK-BYTES      PIC X.                                   LB202310
           03 F3-R-C           PIC S999 comp-5.                         LB202320
       01  G3-R-C4.                                                     LB202330
           49 FILLER           PIC X.                                   LB202340
           49 SLACK-BYTES      PIC X.                                   LB202350
           49 F3-R-C4          PIC S999 COMPUTATIONAL-5.                LB202360
       77  THIRD-FLY PIC S9 COMPUTATIONAL-5 SYNC.                       LB202370
       01  G4-S-BSD.                                                    LB202380
           03 FILLER           PIC X.                                   LB202390
           03 F4-S-BSD         PIC S9  comp-5 SYNCHRONIZED.             LB202400
       01  G4-S-BSDL.                                                   LB202410
           03 FILLER           PIC X.                                   LB202420
           03 F4-S-BSDL        PIC S9(4)  comp-5 SYNCHRONIZED LEFT.     LB202430
       01  G4-S-BSDR.                                                   LB202440
           03 FILLER           PIC X.                                   LB202450
           03 F4-S-BSDR        PIC S9(4)  comp-5 SYNCHRONIZED RIGHT.    LB202460
       01  G4-S-BS.                                                     LB202470
           03 F                PIC X.                                   LB202480
           03 F4-S-BS          PIC S9(4)  comp-5 SYNC.                  LB202490
       01  G4-S-BSL.                                                    LB202500
           03 FILLER           PIC X.                                   LB202510
           03 F4-S-BSL         PIC S9(4)  comp-5 SYNC LEFT.             LB202520
       01  G4-S-BSR.                                                    LB202530
           03 FILLER           PIC X.                                   LB202540
           03 F4-S-BSR         PIC S9(4)  comp-5 SYNC RIGHT.            LB202550
       01  G4-S-CSD.                                                    LB202560
           11 FILLER           PIC X.                                   LB202570
           11 F4-S-CSD         PIC S9(4) comp-5 SYNCHRONIZED.           LB202580
       01  G4-S-CSDL.                                                   LB202590
           03 FILLER           PIC X.                                   LB202600
           03 F4-S-CSDL        PIC S9(4) comp-5 SYNCHRONIZED LEFT.      LB202610
       01  G4-S-CSDR.                                                   LB202620
           03 FILLER           PIC X.                                   LB202630
           03 F4-S-CSDR        PIC S9(4) comp-5 SYNCHRONIZED RIGHT.     LB202640
       01  G4-S-CS.                                                     LB202650
           22 G                PIC X.                                   LB202660
           22 F4-S-CS          PIC S9(4) comp-5 SYNC.                   LB202670
       01  G4-S-CSL.                                                    LB202680
           03 FILLER           PIC X.                                   LB202690
           03 F4-S-CSL         PIC S9(4) comp-5 SYNC LEFT.              LB202700
       77  FLY-NUM-4   comp-5 SYNCHRONIZED PIC S999.                    LB202710
       01  G4-S-CSR.                                                    LB202720
           03 FILLER           PIC X.                                   LB202730
           03 F4-S-CSR         PIC S9(4) comp-5 SYNC RIGHT.             LB202740
       01  G4-S-C4SD.                                                   LB202750
           03 FILLER           PIC X.                                   LB202760
           03 F4-S-C4SD        PIC S9(4) COMPUTATIONAL-5 SYNCHRONIZED.  LB202770
       01  G4-S-C4SDL.                                                  LB202780
           03 FILLER           PIC X.                                   LB202790
           03 F4-S-C4SDL       PIC S9(4) COMPUTATIONAL-5 SYNCHRONIZED   LB202800
                                                        LEFT.           LB202810
       01  G4-S-C4SDR.                                                  LB202820
           03 FILLER           PIC X.                                   LB202830
           03 F4-S-C4SDR       PIC S9(4) COMPUTATIONAL-5 SYNCHRONIZED   LB202840
                                                        RIGHT.          LB202850
       01  G4-S-C4S.                                                    LB202860
           29 FILLER           PIC X.                                   LB202870
           29 F4-S-C4S         PIC S9(4) COMPUTATIONAL-5 SYNC.          LB202880
       01  G4-S-C4SL.                                                   LB202890
           03 FILLER           PIC X.                                   LB202900
           03 F4-S-C4SL        PIC S9(4) COMPUTATIONAL-5 SYNC LEFT.     LB202910
       01  G4-S-C4SR.                                                   LB202920
           03 H                PIC X.                                   LB202930
           03 F4-S-C4SR        PIC S9(4) COMPUTATIONAL-5 SYNC RIGHT.    LB202940
       01  G4-R-B.                                                      LB202950
           03 FILLER           PIC X.                                   LB202960
           03 SLACK-BYTES      PIC X.                                   LB202970
           03 F4-R-B           PIC S9(4)  comp-5.                       LB202980
       01  G4-R-C.                                                      LB202990
           03 FILLER           PIC X.                                   LB203000
           03 SLACK-BYTES      PIC X.                                   LB203010
           03 F4-R-C           PIC S9(4) comp-5.                        LB203020
       01  G4-R-C4.                                                     LB203030
           33 FILLER           PIC X.                                   LB203040
           33 SLACK-BYTES      PIC X.                                   LB203050
           33 F4-R-C4          PIC S9(4) COMPUTATIONAL-5.               LB203060
       01  G5-S-BSD.                                                    LB203070
           03 FILLER           PIC X.                                   LB203080
           03 F5-S-BSD         PIC S9(5)  comp-5 SYNCHRONIZED.          LB203090
       01  G5-S-BSDL.                                                   LB203100
           03 J                PIC X.                                   LB203110
           03 F5-S-BSDL        PIC S9(5)  comp-5 SYNCHRONIZED LEFT.     LB203120
       01  G5-S-BSDR.                                                   LB203130
           03 FILLER           PIC X.                                   LB203140
           03 F5-S-BSDR        PIC S9(5)  comp-5 SYNCHRONIZED RIGHT.    LB203150
       01  G5-S-BS.                                                     LB203160
           03 FILLER           PIC X.                                   LB203170
           03 F5-S-BS          PIC S9(5)  comp-5 SYNC.                  LB203180
       01  G5-S-BSL.                                                    LB203190
           27 FILLER           PIC X.                                   LB203200
           27 F5-S-BSL         PIC S9(5)  comp-5 SYNC LEFT.             LB203210
       01  G5-S-BSR.                                                    LB203220
           03 FILLER           PIC X.                                   LB203230
           03 F5-S-BSR         PIC S9(5)  comp-5 SYNC RIGHT.            LB203240
       77  FLY-5  comp-5 PIC S999 SYNCHRONIZED LEFT.                    LB203250
       01  G5-S-CSD.                                                    LB203260
           03 FILLER           PIC X.                                   LB203270
           03 F5-S-CSD         PIC S9(5) comp-5 SYNCHRONIZED.           LB203280
       01  G5-S-CSDL.                                                   LB203290
           03 FILLER           PIC X.                                   LB203300
           03 F5-S-CSDL        PIC S9(5) comp-5 SYNCHRONIZED LEFT.      LB203310
       01  G5-S-CSDR.                                                   LB203320
           03 FILLER           PIC X.                                   LB203330
           03 F5-S-CSDR        PIC S9(5) comp-5 SYNCHRONIZED RIGHT.     LB203340
       01  G5-S-CS.                                                     LB203350
           03 FILLER           PIC X.                                   LB203360
           03 F5-S-CS          PIC S9(5) comp-5 SYNC.                   LB203370
       01  G5-S-CSL.                                                    LB203380
           03 KILLER           PIC X.                                   LB203390
           03 F5-S-CSL         PIC S9(5) comp-5 SYNC LEFT.              LB203400
       01  G5-S-CSR.                                                    LB203410
           03 FILLER           PIC X.                                   LB203420
           03 F5-S-CSR         PIC S9(5) comp-5 SYNC RIGHT.             LB203430
       01  G5-S-C4SD.                                                   LB203440
           03 FILLER           PIC X.                                   LB203450
           03 F5-S-C4SD        PIC S9(5) COMPUTATIONAL-5 SYNCHRONIZED.  LB203460
       01  G5-S-C4SDL.                                                  LB203470
           03 FILLER           PIC X.                                   LB203480
           03 F5-S-C4SDL       PIC S9(5) COMPUTATIONAL-5 SYNCHRONIZED   LB203490
                                                        LEFT.           LB203500
       01  G5-S-C4SDR.                                                  LB203510
           03 FILLER           PIC X.                                   LB203520
           03 F5-S-C4SDR       PIC S9(5) COMPUTATIONAL-5 SYNCHRONIZED   LB203530
                                                        RIGHT.          LB203540
       01  G5-S-C4S.                                                    LB203550
           03 LILLER           PIC X.                                   LB203560
           03 F5-S-C4S         PIC S9(5) COMPUTATIONAL-5 SYNC.          LB203570
       01  G5-S-C4SL.                                                   LB203580
           43 FILLER           PIC X.                                   LB203590
           43 F5-S-C4SL        PIC S9(5) COMPUTATIONAL-5 SYNC LEFT.     LB203600
       01  G5-S-C4SR.                                                   LB203610
           03 FILLER           PIC X.                                   LB203620
           03 F5-S-C4SR        PIC S9(5) COMPUTATIONAL-5 SYNC RIGHT.    LB203630
       01  G5-R-B.                                                      LB203640
           03 FILLER           PIC X.                                   LB203650
           03 SLACK-BYTES      PIC XXX.                                 LB203660
           03 F5-R-B           PIC S9(5)  comp-5.                       LB203670
       01  G5-R-C.                                                      LB203680
           03 FILLER           PIC X.                                   LB203690
           03 SLACK-BYTES      PIC XXX.                                 LB203700
           03 F5-R-C           PIC S9(5) comp-5.                        LB203710
       77  FLY-6  comp-5 PIC 9999999 SYNC RIGHT.                        LB203720
       01  G5-R-C4.                                                     LB203730
           03 FILLER           PIC X.                                   LB203740
           03 SLACK-BYTES      PIC XXX.                                 LB203750
           03 F5-R-C4           PIC S9(5) COMPUTATIONAL-5.              LB203760
       01  G6-S-BSD.                                                    LB203770
           23 MILLER           PIC X.                                   LB203780
           23 F6-S-BSD         PIC S9(6)  comp-5 SYNCHRONIZED.          LB203790
       01  G6-S-BSDL.                                                   LB203800
           03 FILLER           PIC X.                                   LB203810
           03 F6-S-BSDL        PIC S9(6)  comp-5 SYNCHRONIZED LEFT.     LB203820
       01  G6-S-BSDR.                                                   LB203830
           03 FILLER           PIC X.                                   LB203840
           03 F6-S-BSDR        PIC S9(6)  comp-5 SYNCHRONIZED RIGHT.    LB203850
       01  G6-S-BS.                                                     LB203860
           03 FILLER           PIC X.                                   LB203870
           03 F6-S-BS          PIC S9(6)  comp-5 SYNC.                  LB203880
       01  G6-S-BSL.                                                    LB203890
           03 FILLER           PIC X.                                   LB203900
           03 F6-S-BSL         PIC S9(6)  comp-5 SYNC LEFT.             LB203910
       01  G6-S-BSR.                                                    LB203920
           03 NILLER           PIC X.                                   LB203930
           03 F6-S-BSR         PIC S9(6)  comp-5 SYNC RIGHT.            LB203940
       01  G6-S-CSD.                                                    LB203950
           03 FILLER           PIC X.                                   LB203960
           03 F6-S-CSD         PIC S9(6) comp-5 SYNCHRONIZED.           LB203970
       01  G6-S-CSDL.                                                   LB203980
           03 FILLER           PIC X.                                   LB203990
           03 F6-S-CSDL        PIC S9(6) comp-5 SYNCHRONIZED LEFT.      LB204000
       01  G6-S-CSDR.                                                   LB204010
           03 FILLER           PIC X.                                   LB204020
           03 F6-S-CSDR        PIC S9(6) comp-5 SYNCHRONIZED RIGHT.     LB204030
       01  G6-S-CS.                                                     LB204040
           42 FILLER           PIC X.                                   LB204050
           42 F6-S-CS          PIC S9(6) comp-5 SYNC.                   LB204060
       01  G6-S-CSL.                                                    LB204070
           03 FILLER           PIC X.                                   LB204080
           03 F6-S-CSL         PIC S9(6) comp-5 SYNC LEFT.              LB204090
       01  G6-S-CSR.                                                    LB204100
           03 FILLER           PIC X.                                   LB204110
           03 F6-S-CSR         PIC S9(6) comp-5 SYNC RIGHT.             LB204120
       01  G6-S-C4SD.                                                   LB204130
           03 FILLER           PIC X.                                   LB204140
           03 F6-S-C4SD        PIC S9(6) COMPUTATIONAL-5 SYNCHRONIZED.  LB204150
       01  G6-S-C4SDL.                                                  LB204160
           03 FILLER           PIC X.                                   LB204170
           03 F6-S-C4SDL       PIC S9(6) COMPUTATIONAL-5 SYNCHRONIZED   LB204180
                                                        LEFT.           LB204190
       01  G6-S-C4SDR.                                                  LB204200
           03 OILLER           PIC X.                                   LB204210
           03 F6-S-C4SDR       PIC S9(6) COMPUTATIONAL-5 SYNCHRONIZED   LB204220
                                                        RIGHT.          LB204230
       01  G6-S-C4S.                                                    LB204240
           03 FILLER           PIC X.                                   LB204250
           03 F6-S-C4S         PIC S9(6) COMPUTATIONAL-5 SYNC.          LB204260
       01  G6-S-C4SL.                                                   LB204270
           03 FILLER           PIC X.                                   LB204280
           03 F6-S-C4SL        PIC S9(6) COMPUTATIONAL-5 SYNC LEFT.     LB204290
       01  G6-S-C4SR.                                                   LB204300
           13 FILLER           PIC X.                                   LB204310
           13 F6-S-C4SR        PIC S9(6) COMPUTATIONAL-5 SYNC RIGHT.    LB204320
       01  G6-R-B.                                                      LB204330
           03 FILLER           PIC X.                                   LB204340
           03 SLACK-BYTES      PIC XXX.                                 LB204350
           03 F6-R-B           PIC S9(6)  comp-5.                       LB204360
       01  G6-R-C.                                                      LB204370
           03 FILLER           PIC X.                                   LB204380
           03 SLACK-BYTES      PIC XXX.                                 LB204390
           03 F6-R-C           PIC S9(6) comp-5.                        LB204400
       01  G6-R-C4.                                                     LB204410
           03 FILLER           PIC X.                                   LB204420
           03 SLACK-BYTES      PIC XXX.                                 LB204430
           03 F6-R-C4           PIC S9(6) COMPUTATIONAL-5.              LB204440
       01  G9-S-BSD.                                                    LB204450
           03 FILLER           PIC X.                                   LB204460
           03 F9-S-BSD         PIC S9(9)  comp-5 SYNCHRONIZED.          LB204470
       01  G9-S-BSDL.                                                   LB204480
           03 PILLER           PIC X.                                   LB204490
           03 F9-S-BSDL        PIC S9(9)  comp-5 SYNCHRONIZED LEFT.     LB204500
       01  G9-S-BSDR.                                                   LB204510
           03 FILLER           PIC X.                                   LB204520
           03 F9-S-BSDR        PIC S9(9)  comp-5 SYNCHRONIZED RIGHT.    LB204530
       01  G9-S-BS.                                                     LB204540
           03 FILLER           PIC X.                                   LB204550
           03 F9-S-BS          PIC S9(9)  comp-5 SYNC.                  LB204560
       01  G9-S-BSL.                                                    LB204570
           03 FILLER           PIC X.                                   LB204580
           03 F9-S-BSL         PIC S9(9)  comp-5 SYNC LEFT.             LB204590
       77  NO-9-FLY     SYNCHRONIZED LEFT PIC 9(5) comp-5.              LB204600
       01  G9-S-BSR.                                                    LB204610
           03 FILLER           PIC X.                                   LB204620
           03 F9-S-BSR         PIC S9(9)  comp-5 SYNC RIGHT.            LB204630
       01  G9-S-CSD.                                                    LB204640
           03 FILLER           PIC X.                                   LB204650
           03 F9-S-CSD         PIC S9(9) comp-5 SYNCHRONIZED.           LB204660
       01  G9-S-CSDL.                                                   LB204670
           39 FILLER           PIC X.                                   LB204680
           39 F9-S-CSDL        PIC S9(9) comp-5 SYNCHRONIZED LEFT.      LB204690
       01  G9-S-CSDR.                                                   LB204700
           03 FILLER           PIC X.                                   LB204710
           03 F9-S-CSDR        PIC S9(9) comp-5 SYNCHRONIZED RIGHT.     LB204720
       01  G9-S-CS.                                                     LB204730
           03 FILLER           PIC X.                                   LB204740
           03 F9-S-CS          PIC S9(9) comp-5 SYNC.                   LB204750
       01  G9-S-CSL.                                                    LB204760
           03 QILLER           PIC X.                                   LB204770
           03 F9-S-CSL         PIC S9(9) comp-5 SYNC LEFT.              LB204780
       01  G9-S-CSR.                                                    LB204790
           03 FILLER           PIC X.                                   LB204800
           03 F9-S-CSR         PIC S9(9) comp-5 SYNC RIGHT.             LB204810
       01  G9-S-C4SD.                                                   LB204820
           03 FILLER           PIC X.                                   LB204830
           03 F9-S-C4SD        PIC S9(9) COMPUTATIONAL-5 SYNCHRONIZED.  LB204840
       01  G9-S-C4SDL.                                                  LB204850
           03 FILLER           PIC X.                                   LB204860
           03 F9-S-C4SDL       PIC S9(9) COMPUTATIONAL-5 SYNCHRONIZED   LB204870
                                                        LEFT.           LB204880
       01  G9-S-C4SDR.                                                  LB204890
           03 FILLER           PIC X.                                   LB204900
           03 F9-S-C4SDR       PIC S9(9) COMPUTATIONAL-5 SYNCHRONIZED   LB204910
                                                        RIGHT.          LB204920
       01  G9-S-C4S.                                                    LB204930
           03 SILLER           PIC X.                                   LB204940
           03 F9-S-C4S         PIC S9(9) COMPUTATIONAL-5 SYNC.          LB204950
       01  G9-S-C4SL.                                                   LB204960
           03 FILLER           PIC X.                                   LB204970
           03 F9-S-C4SL        PIC S9(9) COMPUTATIONAL-5 SYNC LEFT.     LB204980
       01  G9-S-C4SR.                                                   LB204990
           03 FILLER           PIC X.                                   LB205000
           03 F9-S-C4SR        PIC S9(9) COMPUTATIONAL-5 SYNC RIGHT.    LB205010
       01  G9-R-B.                                                      LB205020
           03 FILLER           PIC X.                                   LB205030
           03 SLACK-BYTES      PIC XXX.                                 LB205040
           03 F9-R-B           PIC S9(9)  comp-5.                       LB205050
       01  G9-R-C.                                                      LB205060
           03 FILLER           PIC X.                                   LB205070
           03 SLACK-BYTES      PIC XXX.                                 LB205080
           03 F9-R-C           PIC S9(9) comp-5.                        LB205090
       01  G9-R-C4.                                                     LB205100
           03 FILLER           PIC X.                                   LB205110
           03 SLACK-BYTES      PIC XXX.                                 LB205120
           03 F9-R-C4           PIC S9(9) COMPUTATIONAL-5.              LB205130
       01  G10-S-BSD.                                                   LB205140
           03 FILLER           PIC X.                                   LB205150
           03 F10-S-BSD         PIC S9(10)  comp-5 SYNCHRONIZED.        LB205160
       01  G10-S-BSDL.                                                  LB205170
           03 FILLER           PIC X.                                   LB205180
           03 F10-S-BSDL        PIC S9(10)  comp-5 SYNCHRONIZED LEFT.   LB205190
       01  G10-S-BSDR.                                                  LB205200
           03 TILLER           PIC X.                                   LB205210
           03 F10-S-BSDR        PIC S9(10)  comp-5 SYNCHRONIZED RIGHT.  LB205220
       77  FLY-10  PIC XX.                                              LB205230
       01  G10-S-BS.                                                    LB205240
           03 FILLER           PIC X.                                   LB205250
           03 F10-S-BS          PIC S9(10)  comp-5 SYNC.                LB205260
       01  G10-S-BSL.                                                   LB205270
           03 FILLER           PIC X.                                   LB205280
           03 F10-S-BSL         PIC S9(10)  comp-5 SYNC LEFT.           LB205290
       01  G10-S-BSR.                                                   LB205300
           03 FILLER           PIC X.                                   LB205310
           03 F10-S-BSR         PIC S9(10)  comp-5 SYNC RIGHT.          LB205320
       01  G10-S-CSD.                                                   LB205330
           03 FILLER           PIC X.                                   LB205340
           03 F10-S-CSD         PIC S9(10) comp-5 SYNCHRONIZED.         LB205350
       01  G10-S-CSDL.                                                  LB205360
           03 FILLER           PIC X.                                   LB205370
           03 F10-S-CSDL        PIC S9(10) comp-5 SYNCHRONIZED LEFT.    LB205380
       01  G10-S-CSDR.                                                  LB205390
           36 FILLER           PIC X.                                   LB205400
           36 F10-S-CSDR        PIC S9(10) comp-5 SYNCHRONIZED RIGHT.   LB205410
       01  G10-S-CS.                                                    LB205420
           03 FILLER           PIC X.                                   LB205430
           03 F10-S-CS          PIC S9(10) comp-5 SYNC.                 LB205440
       01  G10-S-CSL.                                                   LB205450
           03 FILLER           PIC X.                                   LB205460
           03 F10-S-CSL         PIC S9(10) comp-5 SYNC LEFT.            LB205470
       01  G10-S-CSR.                                                   LB205480
           03 UILLER           PIC X.                                   LB205490
           03 F10-S-CSR         PIC S9(10) comp-5 SYNC RIGHT.           LB205500
       01  G10-S-C4SD.                                                  LB205510
           03 FILLER           PIC X.                                   LB205520
           03 F10-S-C4SD        PIC S9(10) COMPUTATIONAL-5 SYNCHRONIZED.LB205530
       01  G10-S-C4SDL.                                                 LB205540
           03 FILLER           PIC X.                                   LB205550
           03 F10-S-C4SDL       PIC S9(10) COMPUTATIONAL-5 SYNCHRONIZED LB205560
                                                        LEFT.           LB205570
       01  G10-S-C4SDR.                                                 LB205580
           03 FILLER           PIC X.                                   LB205590
           03 F10-S-C4SDR       PIC S9(10) COMPUTATIONAL-5 SYNCHRONIZED LB205600
                                                        RIGHT.          LB205610
       01  G10-S-C4S.                                                   LB205620
           03 FILLER           PIC X.                                   LB205630
           03 F10-S-C4S         PIC S9(10) COMPUTATIONAL-5 SYNC.        LB205640
       01  G10-S-C4SL.                                                  LB205650
           03 FILLER           PIC X.                                   LB205660
           03 F10-S-C4SL        PIC S9(10) COMPUTATIONAL-5 SYNC LEFT.   LB205670
       01  G10-S-C4SR.                                                  LB205680
           03 FILLER           PIC X.                                   LB205690
           03 F10-S-C4SR        PIC S9(10) COMPUTATIONAL-5 SYNC RIGHT.  LB205700
       01  G10-R-B.                                                     LB205710
           03 FILLER           PIC X.                                   LB205720
           03 SLACK-BYTES      PIC XXX.                                 LB205730
      * different from OPM - 4 extra bytes required
           03 FILLER           PIC X(4).
           03 F10-R-B           PIC S9(10)  comp-5.                     LB205740
       01  G10-R-C.                                                     LB205750
           03 VILLER           PIC X.                                   LB205760
           03 SLACK-BYTES      PIC XXX.                                 LB205770
      * different from OPM - 4 extra bytes required
           03 FILLER           PIC X(4).
           03 F10-R-C           PIC S9(10) comp-5.                      LB205780
       01  G10-R-C4.                                                    LB205790
           45 FILLER           PIC X.                                   LB205800
           45 SLACK-BYTES      PIC XXX.                                 LB205810
      * different from OPM - 4 extra bytes required
           45 FILLER           PIC X(4).
           45 F10-R-C4           PIC S9(10) COMPUTATIONAL-5.            LB205820
       01  G15-S-BSD.                                                   LB205830
           03 FILLER           PIC X.                                   LB205840
           03 F15-S-BSD         PIC S9(15)  comp-5 SYNCHRONIZED.        LB205850
       01  G15-S-BSDL.                                                  LB205860
           03 FILLER           PIC X.                                   LB205870
           03 F15-S-BSDL       PIC S9(15)  comp-5 SYNCHRONIZED LEFT.    LB205880
       01  G15-S-BSDR.                                                  LB205890
           03 FILLER           PIC X.                                   LB205900
           03 F15-S-BSDR        PIC S9(15)  comp-5 SYNCHRONIZED RIGHT.  LB205910
       01  G15-S-BS.                                                    LB205920
           03 FILLER           PIC X.                                   LB205930
           03 F15-S-BS          PIC S9(15)  comp-5 SYNC.                LB205940
       01  G15-S-BSL.                                                   LB205950
           03 FILLER           PIC X.                                   LB205960
           03 F15-S-BSL         PIC S9(15)  comp-5 SYNC LEFT.           LB205970
       01  G15-S-BSR.                                                   LB205980
           03 FILLER           PIC X.                                   LB205990
           03 F15-S-BSR         PIC S9(15)  comp-5 SYNC RIGHT.          LB206000
       01  G15-S-CSD.                                                   LB206010
           17 WILLER           PIC X.                                   LB206020
           17 F15-S-CSD         PIC S9(15) comp-5 SYNCHRONIZED.         LB206030
       77  FLY-11    COMPUTATIONAL-5 PIC 9(18) SYNC.                    LB206040
       01  G15-S-CSDL.                                                  LB206050
           03 FILLER           PIC X.                                   LB206060
           03 F15-S-CSDL        PIC S9(15) comp-5 SYNCHRONIZED LEFT.    LB206070
       01  G15-S-CSDR.                                                  LB206080
           03 FILLER           PIC X.                                   LB206090
           03 F15-S-CSDR        PIC S9(15) comp-5 SYNCHRONIZED RIGHT.   LB206100
       01  G15-S-CS.                                                    LB206110
           03 FILLER           PIC X.                                   LB206120
           03 F15-S-CS          PIC S9(15) comp-5 SYNC.                 LB206130
       01  G15-S-CSL.                                                   LB206140
           03 FILLER           PIC X.                                   LB206150
           03 F15-S-CSL         PIC S9(15) comp-5 SYNC LEFT.            LB206160
       01  G15-S-CSR.                                                   LB206170
           03 FILLER           PIC X.                                   LB206180
           03 F15-S-CSR         PIC S9(15) comp-5 SYNC RIGHT.           LB206190
       01  G15-S-C4SD.                                                  LB206200
           03 XILLER           PIC X.                                   LB206210
           03 F15-S-C4SD        PIC S9(15) COMPUTATIONAL-5 SYNCHRONIZED.LB206220
       01  G15-S-C4SDL.                                                 LB206230
           03 FILLER           PIC X.                                   LB206240
           03 F15-S-C4SDL       PIC S9(15) COMPUTATIONAL-5 SYNCHRONIZED LB206250
                                                        LEFT.           LB206260
       01  G15-S-C4SDR.                                                 LB206270
           03 FILLER           PIC X.                                   LB206280
           03 F15-S-C4SDR       PIC S9(15) COMPUTATIONAL-5 SYNCHRONIZED LB206290
                                                        RIGHT.          LB206300
       01  G15-S-C4S.                                                   LB206310
           03 FILLER           PIC X.                                   LB206320
           03 F15-S-C4S         PIC S9(15) COMPUTATIONAL-5 SYNC.        LB206330
       01  G15-S-C4SL.                                                  LB206340
           03 FILLER           PIC X.                                   LB206350
           03 F15-S-C4SL        PIC S9(15) COMPUTATIONAL-5 SYNC LEFT.   LB206360
       01  G15-S-C4SR.                                                  LB206370
           03 FILLER           PIC X.                                   LB206380
           03 F15-S-C4SR        PIC S9(15) COMPUTATIONAL-5 SYNC RIGHT.  LB206390
       01  G15-R-B.                                                     LB206400
           03 FILLER           PIC X.                                   LB206410
           03 SLACK-BYTES      PIC XXX.                                 LB206420
      * different from OPM - 4 extra bytes required
           03 FILLER           PIC X(4).
           03 F15-R-B           PIC S9(15)  comp-5.                     LB206430
       01  G15-R-C.                                                     LB206440
           03 FILLER           PIC X.                                   LB206450
           03 SLACK-BYTES      PIC XXX.                                 LB206460
      * different from OPM - 4 extra bytes required
           03 FILLER           PIC X(4).
           03 F15-R-C          PIC S9(15) comp-5.                       LB206470
       01  G15-R-C4.                                                    LB206480
           03 YILLER           PIC X.                                   LB206490
           03 SLACK-BYTES      PIC XXX.                                 LB206500
      * different from OPM - 4 extra bytes required
           03 FILLER           PIC X(4).
           03 F15-R-C4           PIC S9(15) COMPUTATIONAL-5.            LB206510
       01  G18-S-BSD.                                                   LB206520
           03 FILLER           PIC X.                                   LB206530
           03 F18-S-BSD         PIC S9(18)  comp-5 SYNCHRONIZED.        LB206540
       01  G18-S-BSDL.                                                  LB206550
           03 FILLER           PIC X.                                   LB206560
           03 F18-S-BSDL       PIC S9(18)  comp-5 SYNCHRONIZED LEFT.    LB206570
       01  G18-S-BSDR.                                                  LB206580
           03 FILLER           PIC X.                                   LB206590
           03 F18-S-BSDR        PIC S9(18)  comp-5 SYNCHRONIZED RIGHT.  LB206600
       01  G18-S-BS.                                                    LB206610
           03 FILLER           PIC X.                                   LB206620
           03 F18-S-BS          PIC S9(18)  comp-5 SYNC.                LB206630
       01  G18-S-BSL.                                                   LB206640
           03 FILLER           PIC X.                                   LB206650
           03 F18-S-BSL         PIC S9(18)  comp-5 SYNC LEFT.           LB206660
       01  G18-S-BSR.                                                   LB206670
           44 FILLER           PIC X.                                   LB206680
           44 F18-S-BSR         PIC S9(18)  comp-5 SYNC RIGHT.          LB206690
       01  G18-S-CSD.                                                   LB206700
           03 FILLER           PIC X.                                   LB206710
           03 F18-S-CSD         PIC S9(18) comp-5 SYNCHRONIZED.         LB206720
       01  G18-S-CSDL.                                                  LB206730
           03 FILLER           PIC X.                                   LB206740
           03 F18-S-CSDL        PIC S9(18) comp-5 SYNCHRONIZED LEFT.    LB206750
       01  G18-S-CSDR.                                                  LB206760
           03 FILLER           PIC X.                                   LB206770
           03 F18-S-CSDR        PIC S9(18) comp-5 SYNCHRONIZED RIGHT.   LB206780
       01  G18-S-CS.                                                    LB206790
           03 FILLER           PIC X.                                   LB206800
           03 F18-S-CS          PIC S9(18) comp-5 SYNC.                 LB206810
       01  G18-S-CSL.                                                   LB206820
           03 FILLER           PIC X.                                   LB206830
           03 F18-S-CSL         PIC S9(18) comp-5 SYNC LEFT.            LB206840
       01  G18-S-CSR.                                                   LB206850
           03 YILLER           PIC X.                                   LB206860
           03 F18-S-CSR         PIC S9(18) comp-5 SYNC RIGHT.           LB206870
       01  G18-S-C4SD.                                                  LB206880
           03 FILLER           PIC X.                                   LB206890
           03 F18-S-C4SD        PIC S9(18) COMPUTATIONAL-5 SYNCHRONIZED.LB206900
       01  G18-S-C4SDL.                                                 LB206910
           03 FILLER           PIC X.                                   LB206920
           03 F18-S-C4SDL       PIC S9(18) COMPUTATIONAL-5 SYNCHRONIZED LB206930
                                                        LEFT.           LB206940
       01  G18-S-C4SDR.                                                 LB206950
           03 FILLER           PIC X.                                   LB206960
           03 F18-S-C4SDR       PIC S9(18) COMPUTATIONAL-5 SYNCHRONIZED LB206970
                                                        RIGHT.          LB206980
       01  G18-S-C4S.                                                   LB206990
           03 FILLER           PIC X.                                   LB207000
           03 F18-S-C4S         PIC S9(18) COMPUTATIONAL-5 SYNC.        LB207010
       01  G18-S-C4SL.                                                  LB207020
           03 FILLER           PIC X.                                   LB207030
           03 F18-S-C4SL        PIC S9(18) COMPUTATIONAL-5 SYNC LEFT.   LB207040
       01  G18-S-C4SR.                                                  LB207050
           03 FILLER           PIC X.                                   LB207060
           03 F18-S-C4SR        PIC S9(18) COMPUTATIONAL-5 SYNC RIGHT.  LB207070
       01  G18-R-B.                                                     LB207080
           03 FILLER           PIC X.                                   LB207090
           03 SLACK-BYTES      PIC XXX.                                 LB207100
      * different from OPM - 4 extra bytes required
           03 FILLER           PIC X(4).
           03 F18-R-B           PIC S9(18)  comp-5.                     LB207110
       01  G18-R-C.                                                     LB207120
           03 ZILLER           PIC X.                                   LB207130
           03 SLACK-BYTES      PIC XXX.                                 LB207140
      * different from OPM - 4 extra bytes required
           03 FILLER           PIC X(4).
           03 F18-R-C           PIC S9(18) comp-5.                      LB207150
       01  G18-R-C4.                                                    LB207160
           03 FILLER           PIC X.                                   LB207170
           03 SLACK-BYTES      PIC XXX.                                 LB207180
      * different from OPM - 4 extra bytes required
           03 FILLER           PIC X(4).
           03 F18-R-C4           PIC S9(18) COMPUTATIONAL-5.            LB207190
       01  MULTIPLE-GROUP.                                              LB207200
           03 JUNQUE PIC X.                                             LB207210
           03 M-S-1   SYNC LEFT  comp-5   PIC S9(6).                    LB207220
           03 MGA.                                                      LB207230
               06 FILLER PIC XXX.                                       LB207240
               06 M-S-2 comp-5 SYNC RIGHT PIC S99.                      LB207250
               06 MGB.                                                  LB207260
                      33 M-S-3 SYNCHRONIZED LEFT comp-5 PIC S9999.      LB207270
                      33 FILLER PIC X.                                  LB207280
           03 MORE-JUNK PIC 9999.                                       LB207290
           03 M-S-4 COMPUTATIONAL-5 SYNC RIGHT PIC S9(18).              LB207300
           03 MGC.                                                      LB207310
                10 MGD.                                                 LB207320
                   20 FILLER PIC X.                                     LB207330
                   20 M-S-5 SYNC RIGHT  comp-5 PIC S9(9).               LB207340
                10 M-S-6  comp-5 SYNCHRONIZED RIGHT PIC S9(7).          LB207350
           03 FILLER PIC XX.                                            LB207360
           03 MGE.                                                      LB207370
                     49 M-S-7 SYNC RIGHT COMPUTATIONAL-5                LB207380
                            PIC S9(15).                                 LB207390
       01  MULT-GROUP-RCV.                                              LB207400
           08 FILLER PIC XXXX.                                          LB207410
           08 M-R-1 PIC S9(6) comp-5.                                   LB207420
           08 FILLER PIC XXXX.                                          LB207430
           08 M-R-2 PIC S99  comp-5.                                    LB207440
           08 M-R-3 PIC S9999 COMPUTATIONAL-5.                          LB207450
           08 FILLER PIC XXXX.                                          LB207460
           08 YET-MORE-JUNK PIC XXXX.                                   LB207470
           08 M-R-4 PIC S9(18)  comp-5.                                 LB207480
           08 FILLER PIC XXXX.                                          LB207490
           08 M-R-5 PIC S9(9) COMPUTATIONAL-5.                          LB207500
           08 FILLER PIC XXXX.                                          LB207510
           08 M-R-6 PIC S9(7)  comp-5.                                  LB207520
           08 M-R-7 PIC S9(15) comp-5.                                  LB207530
      * REPORT ITEMS                                                    LB207540
                                                                        LB207550
       01   SELF-CHECKING-AIDES.                                        LB207560
                                                                        LB207570
           05  VAR-COUNT                 PIC 999 VALUE 0.               LB207580
           05  PASS-COUNT                PIC 999 VALUE 0.               LB207590
           05  FAIL-COUNT                PIC 999 VALUE 0.               LB207600
           05  PGM-STATUS                PIC X VALUE SPACES.            LB207610
                                                                        LB207620
      *   HEADING                                                       LB207630
      *                                                                 LB207640
       01  HED-1.                                                       LB207650
           03 FILLER PIC X(20)                                          LB207660
                 VALUE "RUN REPORT TESTCASE ".                          LB207670
           03 PGM-ID  PIC X(10)  VALUE "LB2G341".                       LB207680
           03 FILLER PIC X(10) VALUE SPACES.                            LB207690
           03 DATER PIC 99/99/99.                                       LB207700
           03 FILLER PIC XX VALUE SPACES.                               LB207710
           03 TIMER PIC 99B99B99B99.                                    LB207720
           03 FILLER PIC XX VALUE SPACES.                               LB207730
           03 FILLER PIC X(8) VALUE "   PAGE ".                         LB207740
           03 HED-COUNT PIC ZZ9.                                        LB207750
       01  PAGE-COUNT PIC 999 VALUE 0.                                  LB207760
       01  SUMM-HED-1.                                                  LB207770
           03 FILLER PIC X(20)                                          LB207780
                 VALUE "NUMBER OF TESTS ".                              LB207790
           03 TEST-COUNT PIC ZZZ9.                                      LB207800
       01  SUMM-HED-2.                                                  LB207810
           03 FILLER PIC X(20) VALUE "NUMBER OF PASSES ".               LB207820
           03 PRETTY-PASS PIC ZZZ9.                                     LB207830
       01  SUMM-HED-3.                                                  LB207840
           03 FILLER PIC X(20) VALUE "NUMBER OF FAILS ".                LB207850
           03 PRETTY-FAIL PIC ZZZ9.                                     LB207860
       01  ERR-LINE.                                                    LB207870
           03 FILLER PIC X(14) VALUE "*** FAIL ***".                    LB207880
           03 TEST-ID PIC X(10).                                        LB207890
           03 FILLER PIC X(10) VALUE "DATA SENT".                       LB207900
           03 SENT-VAL PIC X(18).                                       LB207910
           03 FILLER PIC X(10) VALUE "DATA RCVD".                       LB207920
           03 RCVD-VAL PIC X(18).                                       LB207930
                                                                        LB207940
       01  DIAG-LINE.                                                   LB207950
           03 D-DATA-NAME PIC X(20).                                    LB207960
           03 D-VALUE  PIC X(30).                                       LB207970
                                                                        LB207980
       01  DIAG-LINE2.                                                  LB207990
           03 FILLER PIC XXX VALUE "BNS".                               LB208000
           03 FRED PIC S9  comp-5 SYNC VALUE 8.                         LB208010
           03 FILLWE PIC X(7) VALUE "comp-5S".                          LB208020
           03 FINK PIC S9(5) VALUE 12345 SYNC comp-5.                   LB208030
           03 FILLER PIC X(9) VALUE "COMPNL-4S".                        LB208040
           03 JANW PIC S9(18) COMPUTATIONAL-5 SYNCHRONIZED              LB208050
                 VALUE 1123456.                                         LB208060
       01  DIAG-LINE3.                                                  LB208070
           03 FILLER PIC XXX VALUE "BN ".                               LB208080
           03 FRED PIC S9  comp-5      VALUE 8.                         LB208090
           03 FILLWE PIC X(7) VALUE "comp-5 ".                          LB208100
           03 FINK PIC S9(5) VALUE 12345      comp-5.                   LB208110
           03 FILLER PIC X(9) VALUE "COMPNL-4 ".                        LB208120
           03 JANW PIC S9(18) COMPUTATIONAL-5                           LB208130
                 VALUE 1123456.                                         LB208140
                                                                        LB208150
       77  LINE-COUNT PIC 99.                                           LB208160
                                                                        LB208170
       PROCEDURE DIVISION.                                              LB208180
                                                                        LB208190
       START-PARA.                                                      LB208200
           display "START-PARA".                                        LB208210
           OPEN OUTPUT PRTG341.                                         LB208220
           ACCEPT DATER FROM DATE.                                      LB208230
           ACCEPT TIMER FROM TIME.                                      LB208240
           INSPECT TIMER REPLACING ALL SPACES BY ":".                   LB208250
           PERFORM HED-RTN THRU HED-OUT.                                LB208260
      *    WRITE REPORT-RECORD FROM DIAG-LINE2.                         LB208270
      *    WRITE REPORT-RECORD FROM DIAG-LINE3.                         LB208280
      *    STOP RUN.                                                    LB208290
           GO TO DO-THE-TESTS.                                          LB208300
       HED-RTN.                                                         LB208310
           ADD 1 TO PAGE-COUNT.                                         LB208320
           MOVE PAGE-COUNT TO HED-COUNT.                                LB208330
           WRITE REPORT-RECORD FROM HED-1 AFTER PAGE.                   LB208340
           MOVE SPACES TO REPORT-RECORD.                                LB208350
           WRITE REPORT-RECORD AFTER 2.                                 LB208360
           MOVE 2 TO LINE-COUNT.                                        LB208370
       HED-OUT.                                                         LB208380
           EXIT.                                                        LB208390
                                                                        LB208400
       PRINT-ERRS.                                                      LB208410
           WRITE REPORT-RECORD FROM ERR-LINE.                           LB208420
           ADD 1 TO LINE-COUNT.                                         LB208430
           IF LINE-COUNT LESS 55 GO TO PR-OUT.                          LB208440
           PERFORM HED-RTN THRU HED-OUT.                                LB208450
       PR-OUT.                                                          LB208460
           EXIT.                                                        LB208470
                                                                        LB208480
       DO-THE-TESTS.                                                    LB208490
           MOVE "DO THE TESTS" TO REPORT-RECORD.                        LB208500
           WRITE REPORT-RECORD.                                         LB208510
                                                                        LB208520
       SYNC-PARA1.                                                      LB208530
            MOVE ZERO TO PASS-COUNT FAIL-COUNT.                         LB208540
                                                                        LB208550
      *********************************************************         LB208560
      *                                                        *        LB208570
      *    MOVE 18 VARIATIONS OF 1 DIGIT FIELD TO A " comp-5"   *       LB208580
      *                  RECEIVING FIELD                       *        LB208590
      *                                                        *        LB208600
      **********************************************************        LB208610
                                                                        LB208620
            MOVE SEND-DATA TO F1-S-BSD                                  LB208630
            MOVE "SEND-DATA " TO D-DATA-NAME.                           LB208640
            MOVE SEND-DATA TO D-VALUE.                                  LB208650
            WRITE REPORT-RECORD FROM DIAG-LINE.                         LB208660
            ADD 1 TO LINE-COUNT.                                        LB208670
            MOVE "G1-S-BSD" TO D-DATA-NAME.                             LB208680
            MOVE G1-S-BSD TO D-VALUE.                                   LB208690
            WRITE REPORT-RECORD FROM DIAG-LINE.                         LB208700
            ADD 1 TO LINE-COUNT.                                        LB208710
            MOVE G1-S-BSD TO G1-R-B.                                    LB208720
            MOVE "G1-R-B" TO D-DATA-NAME.                               LB208730
            MOVE G1-R-B TO D-VALUE.                                     LB208740
            WRITE REPORT-RECORD FROM DIAG-LINE.                         LB208750
            ADD 1 TO LINE-COUNT.                                        LB208760
            MOVE G1-S-BSD TO G1-R-B.                                    LB208770
            IF F1-S-BSD NOT = F1-R-B                                    LB208780
                MOVE "F1-S-BSD" TO TEST-ID                              LB208790
                MOVE F1-S-BSD TO SENT-VAL                               LB208800
                MOVE F1-R-B TO RCVD-VAL                                 LB208810
                ADD 1 TO FAIL-COUNT                                     LB208820
                PERFORM PRINT-ERRS THRU PR-OUT                          LB208830
            ELSE                                                        LB208840
               ADD 1 TO PASS-COUNT.                                     LB208850
                                                                        LB208860
            MOVE SEND-DATA TO F1-S-BSDL                                 LB208870
            MOVE G1-S-BSDL TO G1-R-B.                                   LB208880
            IF F1-S-BSDL NOT = F1-R-B                                   LB208890
                MOVE "F1-S-BSDL" TO TEST-ID                             LB208900
                MOVE F1-S-BSDL TO SENT-VAL                              LB208910
                MOVE F1-R-B TO RCVD-VAL                                 LB208920
                ADD 1 TO FAIL-COUNT                                     LB208930
                PERFORM PRINT-ERRS THRU PR-OUT                          LB208940
            ELSE                                                        LB208950
                ADD 1 TO PASS-COUNT.                                    LB208960
                                                                        LB208970
            MOVE SEND-DATA TO F1-S-BSDR                                 LB208980
            MOVE G1-S-BSDR TO G1-R-B.                                   LB208990
            IF F1-S-BSDR NOT = F1-R-B                                   LB209000
                MOVE "F1-S-BSDR" TO TEST-ID                             LB209010
                MOVE F1-S-BSDR TO SENT-VAL                              LB209020
                MOVE F1-R-B TO RCVD-VAL                                 LB209030
                ADD 1 TO FAIL-COUNT                                     LB209040
                PERFORM PRINT-ERRS THRU PR-OUT                          LB209050
            ELSE                                                        LB209060
               ADD 1 TO PASS-COUNT.                                     LB209070
                                                                        LB209080
            MOVE SEND-DATA TO F1-S-BS                                   LB209090
            MOVE G1-S-BS TO G1-R-B.                                     LB209100
            IF F1-S-BS NOT = F1-R-B                                     LB209110
                MOVE "F1-S-BS" TO TEST-ID                               LB209120
                MOVE F1-S-BS TO SENT-VAL                                LB209130
                MOVE F1-R-B TO RCVD-VAL                                 LB209140
                ADD 1 TO FAIL-COUNT                                     LB209150
                PERFORM PRINT-ERRS THRU PR-OUT                          LB209160
            ELSE                                                        LB209170
                ADD 1 TO PASS-COUNT.                                    LB209180
                                                                        LB209190
            MOVE SEND-DATA TO F1-S-BSL                                  LB209200
            MOVE G1-S-BSL TO G1-R-B.                                    LB209210
            IF F1-S-BSL NOT = F1-R-B                                    LB209220
                MOVE "F1-S-BSL" TO TEST-ID                              LB209230
                MOVE F1-S-BSL TO SENT-VAL                               LB209240
                MOVE F1-R-B TO RCVD-VAL                                 LB209250
                ADD 1 TO FAIL-COUNT                                     LB209260
                PERFORM PRINT-ERRS THRU PR-OUT                          LB209270
            ELSE                                                        LB209280
                ADD 1 TO PASS-COUNT.                                    LB209290
                                                                        LB209300
            MOVE SEND-DATA TO F1-S-BSR                                  LB209310
            MOVE G1-S-BSR TO G1-R-B.                                    LB209320
            IF F1-S-BSR NOT = F1-R-B                                    LB209330
                MOVE "F1-S-BSR" TO TEST-ID                              LB209340
                MOVE F1-S-BSR TO SENT-VAL                               LB209350
                MOVE F1-R-B TO RCVD-VAL                                 LB209360
                ADD 1 TO FAIL-COUNT                                     LB209370
                PERFORM PRINT-ERRS THRU PR-OUT                          LB209380
            ELSE                                                        LB209390
                ADD 1 TO PASS-COUNT.                                    LB209400
                                                                        LB209410
            MOVE SEND-DATA TO F1-S-CSD                                  LB209420
            MOVE G1-S-CSD TO G1-R-B.                                    LB209430
            IF F1-S-CSD NOT = F1-R-B                                    LB209440
                MOVE "F1-S-CSD" TO TEST-ID                              LB209450
                MOVE F1-S-CSD TO SENT-VAL                               LB209460
                MOVE F1-R-B TO RCVD-VAL                                 LB209470
                ADD 1 TO FAIL-COUNT                                     LB209480
                PERFORM PRINT-ERRS THRU PR-OUT                          LB209490
            ELSE                                                        LB209500
                ADD 1 TO PASS-COUNT.                                    LB209510
                                                                        LB209520
            MOVE SEND-DATA TO F1-S-CSDL                                 LB209530
            MOVE G1-S-CSDL TO G1-R-B.                                   LB209540
            IF F1-S-CSDL NOT = F1-R-B                                   LB209550
                MOVE "F1-S-CSDL" TO TEST-ID                             LB209560
                MOVE F1-S-CSDL TO SENT-VAL                              LB209570
                MOVE F1-R-B TO RCVD-VAL                                 LB209580
                ADD 1 TO FAIL-COUNT                                     LB209590
                PERFORM PRINT-ERRS THRU PR-OUT                          LB209600
            ELSE                                                        LB209610
                ADD 1 TO PASS-COUNT.                                    LB209620
                                                                        LB209630
            MOVE SEND-DATA TO F1-S-CSDR                                 LB209640
            MOVE G1-S-CSDR TO G1-R-B.                                   LB209650
            IF F1-S-CSDR NOT = F1-R-B                                   LB209660
                MOVE "F1-S-CSDR" TO TEST-ID                             LB209670
                MOVE F1-S-CSDR TO SENT-VAL                              LB209680
                MOVE F1-R-B TO RCVD-VAL                                 LB209690
                ADD 1 TO FAIL-COUNT                                     LB209700
                PERFORM PRINT-ERRS THRU PR-OUT                          LB209710
            ELSE                                                        LB209720
                ADD 1 TO PASS-COUNT.                                    LB209730
                                                                        LB209740
            MOVE SEND-DATA TO F1-S-CS                                   LB209750
            MOVE G1-S-CS TO G1-R-B.                                     LB209760
            IF F1-S-CS NOT = F1-R-B                                     LB209770
                MOVE "F1-S-CS" TO TEST-ID                               LB209780
                MOVE F1-S-CS TO SENT-VAL                                LB209790
                MOVE F1-R-B TO RCVD-VAL                                 LB209800
                ADD 1 TO FAIL-COUNT                                     LB209810
                PERFORM PRINT-ERRS THRU PR-OUT                          LB209820
            ELSE                                                        LB209830
              ADD 1 TO PASS-COUNT.                                      LB209840
                                                                        LB209850
            MOVE SEND-DATA TO F1-S-CSL                                  LB209860
            MOVE G1-S-CSL TO G1-R-B.                                    LB209870
            IF F1-S-CSL NOT = F1-R-B                                    LB209880
                MOVE "F1-S-CSL" TO TEST-ID                              LB209890
                MOVE F1-S-CSL TO SENT-VAL                               LB209900
                MOVE F1-R-B TO RCVD-VAL                                 LB209910
                ADD 1 TO FAIL-COUNT                                     LB209920
                PERFORM PRINT-ERRS THRU PR-OUT                          LB209930
            ELSE                                                        LB209940
              ADD 1 TO PASS-COUNT.                                      LB209950
                                                                        LB209960
            MOVE SEND-DATA TO F1-S-CSR                                  LB209970
            MOVE G1-S-CSR TO G1-R-B.                                    LB209980
            IF F1-S-CSR NOT = F1-R-B                                    LB209990
                MOVE "F1-S-CSR" TO TEST-ID                              LB210000
                MOVE F1-S-CSR TO SENT-VAL                               LB210010
                MOVE F1-R-B TO RCVD-VAL                                 LB210020
                ADD 1 TO FAIL-COUNT                                     LB210030
                PERFORM PRINT-ERRS THRU PR-OUT                          LB210040
            ELSE                                                        LB210050
              ADD 1 TO PASS-COUNT.                                      LB210060
                                                                        LB210070
            MOVE SEND-DATA TO F1-S-C4SD                                 LB210080
            MOVE G1-S-C4SD TO G1-R-B.                                   LB210090
            IF F1-S-C4SD NOT = F1-R-B                                   LB210100
                MOVE "F1-S-C4SD" TO TEST-ID                             LB210110
                MOVE F1-S-C4SD TO SENT-VAL                              LB210120
                MOVE F1-R-B TO RCVD-VAL                                 LB210130
                ADD 1 TO FAIL-COUNT                                     LB210140
                PERFORM PRINT-ERRS THRU PR-OUT                          LB210150
            ELSE                                                        LB210160
              ADD 1 TO PASS-COUNT.                                      LB210170
                                                                        LB210180
            MOVE SEND-DATA TO F1-S-C4SDL                                LB210190
            MOVE G1-S-C4SDL TO G1-R-B.                                  LB210200
            IF F1-S-C4SDL NOT = F1-R-B                                  LB210210
                MOVE "F1-S-C4SDL" TO TEST-ID                            LB210220
                MOVE F1-S-C4SDL TO SENT-VAL                             LB210230
                MOVE F1-R-B TO RCVD-VAL                                 LB210240
                ADD 1 TO FAIL-COUNT                                     LB210250
                PERFORM PRINT-ERRS THRU PR-OUT                          LB210260
            ELSE                                                        LB210270
              ADD 1 TO PASS-COUNT.                                      LB210280
                                                                        LB210290
            MOVE SEND-DATA TO F1-S-C4SDR                                LB210300
            MOVE G1-S-C4SDR TO G1-R-B.                                  LB210310
            IF F1-S-C4SDR NOT = F1-R-B                                  LB210320
                MOVE "F1-S-C4SDR" TO TEST-ID                            LB210330
                MOVE F1-S-C4SDR TO SENT-VAL                             LB210340
                MOVE F1-R-B TO RCVD-VAL                                 LB210350
                ADD 1 TO FAIL-COUNT                                     LB210360
                PERFORM PRINT-ERRS THRU PR-OUT                          LB210370
            ELSE                                                        LB210380
              ADD 1 TO PASS-COUNT.                                      LB210390
                                                                        LB210400
            MOVE SEND-DATA TO F1-S-C4S                                  LB210410
            MOVE G1-S-C4S TO G1-R-B.                                    LB210420
            IF F1-S-C4S NOT = F1-R-B                                    LB210430
                MOVE "F1-S-C4S" TO TEST-ID                              LB210440
                MOVE F1-S-C4S TO SENT-VAL                               LB210450
                MOVE F1-R-B TO RCVD-VAL                                 LB210460
                ADD 1 TO FAIL-COUNT                                     LB210470
                PERFORM PRINT-ERRS THRU PR-OUT                          LB210480
            ELSE                                                        LB210490
              ADD 1 TO PASS-COUNT.                                      LB210500
                                                                        LB210510
            MOVE SEND-DATA TO F1-S-C4SL                                 LB210520
            MOVE G1-S-C4SL TO G1-R-B.                                   LB210530
            IF F1-S-C4SL NOT = F1-R-B                                   LB210540
                MOVE "F1-S-C4SL" TO TEST-ID                             LB210550
                MOVE F1-S-C4SL TO SENT-VAL                              LB210560
                MOVE F1-R-B TO RCVD-VAL                                 LB210570
                ADD 1 TO FAIL-COUNT                                     LB210580
                PERFORM PRINT-ERRS THRU PR-OUT                          LB210590
            ELSE                                                        LB210600
              ADD 1 TO PASS-COUNT.                                      LB210610
                                                                        LB210620
            MOVE SEND-DATA TO F1-S-C4SR                                 LB210630
            MOVE G1-S-C4SR TO G1-R-B.                                   LB210640
            IF F1-S-C4SR NOT = F1-R-B                                   LB210650
                MOVE "F1-S-C4SR" TO TEST-ID                             LB210660
                MOVE F1-S-C4SR TO SENT-VAL                              LB210670
                MOVE F1-R-B TO RCVD-VAL                                 LB210680
                ADD 1 TO FAIL-COUNT                                     LB210690
                PERFORM PRINT-ERRS THRU PR-OUT                          LB210700
            ELSE                                                        LB210710
              ADD 1 TO PASS-COUNT.                                      LB210720
                                                                        LB210730
                                                                        LB210740
      **********************************************************        LB210750
      *                                                         *       LB210760
      *    MOVE 18 VARIATIONS OF 1 DIGIT FIELD TO A "comp-5"   *        LB210770
      *                  RECEIVING FIELD                        *       LB210780
      *                                                         *       LB210790
      **********************************************************        LB210800
                                                                        LB210810
            MOVE SEND-DATA TO F1-S-BSD                                  LB210820
            MOVE G1-S-BSD TO G1-R-C.                                    LB210830
            IF F1-S-BSD NOT = F1-R-C                                    LB210840
                MOVE "F1-S-BSD" TO TEST-ID                              LB210850
                MOVE F1-S-BSD TO SENT-VAL                               LB210860
                MOVE F1-R-C TO RCVD-VAL                                 LB210870
                ADD 1 TO FAIL-COUNT                                     LB210880
                PERFORM PRINT-ERRS THRU PR-OUT                          LB210890
            ELSE                                                        LB210900
              ADD 1 TO PASS-COUNT.                                      LB210910
                                                                        LB210920
            MOVE SEND-DATA TO F1-S-BSDL                                 LB210930
            MOVE G1-S-BSDL TO G1-R-C.                                   LB210940
            IF F1-S-BSDL NOT = F1-R-C                                   LB210950
                MOVE "F1-S-BSDL" TO TEST-ID                             LB210960
                MOVE F1-S-BSDL TO SENT-VAL                              LB210970
                MOVE F1-R-C TO RCVD-VAL                                 LB210980
                ADD 1 TO FAIL-COUNT                                     LB210990
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211000
            ELSE                                                        LB211010
              ADD 1 TO PASS-COUNT.                                      LB211020
                                                                        LB211030
            MOVE SEND-DATA TO F1-S-BSDR                                 LB211040
            MOVE G1-S-BSDR TO G1-R-C.                                   LB211050
            IF F1-S-BSDR NOT = F1-R-C                                   LB211060
                MOVE "F1-S-BSDR" TO TEST-ID                             LB211070
                MOVE F1-S-BSDR TO SENT-VAL                              LB211080
                MOVE F1-R-C TO RCVD-VAL                                 LB211090
                ADD 1 TO FAIL-COUNT                                     LB211100
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211110
            ELSE                                                        LB211120
              ADD 1 TO PASS-COUNT.                                      LB211130
                                                                        LB211140
            MOVE SEND-DATA TO F1-S-BS                                   LB211150
            MOVE G1-S-BS TO G1-R-C.                                     LB211160
            IF F1-S-BS NOT = F1-R-C                                     LB211170
                MOVE "F1-S-BS" TO TEST-ID                               LB211180
                MOVE F1-S-BS TO SENT-VAL                                LB211190
                MOVE F1-R-C TO RCVD-VAL                                 LB211200
                ADD 1 TO FAIL-COUNT                                     LB211210
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211220
            ELSE                                                        LB211230
              ADD 1 TO PASS-COUNT.                                      LB211240
                                                                        LB211250
            MOVE SEND-DATA TO F1-S-BSL                                  LB211260
            MOVE G1-S-BSL TO G1-R-C.                                    LB211270
            IF F1-S-BSL NOT = F1-R-C                                    LB211280
                MOVE "F1-S-BSL" TO TEST-ID                              LB211290
                MOVE F1-S-BSL TO SENT-VAL                               LB211300
                MOVE F1-R-C TO RCVD-VAL                                 LB211310
                ADD 1 TO FAIL-COUNT                                     LB211320
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211330
            ELSE                                                        LB211340
              ADD 1 TO PASS-COUNT.                                      LB211350
                                                                        LB211360
            MOVE SEND-DATA TO F1-S-BSR                                  LB211370
            MOVE G1-S-BSR TO G1-R-C.                                    LB211380
            IF F1-S-BSR NOT = F1-R-C                                    LB211390
                MOVE "F1-S-BSR" TO TEST-ID                              LB211400
                MOVE F1-S-BSR TO SENT-VAL                               LB211410
                MOVE F1-R-C TO RCVD-VAL                                 LB211420
                ADD 1 TO FAIL-COUNT                                     LB211430
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211440
            ELSE                                                        LB211450
              ADD 1 TO PASS-COUNT.                                      LB211460
                                                                        LB211470
            MOVE SEND-DATA TO F1-S-CSD                                  LB211480
            MOVE G1-S-CSD TO G1-R-C.                                    LB211490
            IF F1-S-CSD NOT = F1-R-C                                    LB211500
                MOVE "F1-S-CSD" TO TEST-ID                              LB211510
                MOVE F1-S-CSD TO SENT-VAL                               LB211520
                MOVE F1-R-C TO RCVD-VAL                                 LB211530
                ADD 1 TO FAIL-COUNT                                     LB211540
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211550
            ELSE                                                        LB211560
              ADD 1 TO PASS-COUNT.                                      LB211570
                                                                        LB211580
            MOVE SEND-DATA TO F1-S-CSDL                                 LB211590
            MOVE G1-S-CSDL TO G1-R-C.                                   LB211600
            IF F1-S-CSDL NOT = F1-R-C                                   LB211610
                MOVE "F1-S-CSDL" TO TEST-ID                             LB211620
                MOVE F1-S-CSDL TO SENT-VAL                              LB211630
                MOVE F1-R-C TO RCVD-VAL                                 LB211640
                ADD 1 TO FAIL-COUNT                                     LB211650
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211660
            ELSE                                                        LB211670
              ADD 1 TO PASS-COUNT.                                      LB211680
                                                                        LB211690
            MOVE SEND-DATA TO F1-S-CSDR                                 LB211700
            MOVE G1-S-CSDR TO G1-R-C.                                   LB211710
            IF F1-S-CSDR NOT = F1-R-C                                   LB211720
                MOVE "F1-S-CSDR" TO TEST-ID                             LB211730
                MOVE F1-S-CSDR TO SENT-VAL                              LB211740
                MOVE F1-R-C TO RCVD-VAL                                 LB211750
                ADD 1 TO FAIL-COUNT                                     LB211760
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211770
            ELSE                                                        LB211780
              ADD 1 TO PASS-COUNT.                                      LB211790
                                                                        LB211800
            MOVE SEND-DATA TO F1-S-CS                                   LB211810
            MOVE G1-S-CS TO G1-R-C.                                     LB211820
            IF F1-S-CS NOT = F1-R-C                                     LB211830
                MOVE "F1-S-CS" TO TEST-ID                               LB211840
                MOVE F1-S-CS TO SENT-VAL                                LB211850
                MOVE F1-R-C TO RCVD-VAL                                 LB211860
                ADD 1 TO FAIL-COUNT                                     LB211870
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211880
            ELSE                                                        LB211890
              ADD 1 TO PASS-COUNT.                                      LB211900
                                                                        LB211910
            MOVE SEND-DATA TO F1-S-CSL                                  LB211920
            MOVE G1-S-CSL TO G1-R-C.                                    LB211930
            IF F1-S-CSL NOT = F1-R-C                                    LB211940
                MOVE "F1-S-CSL" TO TEST-ID                              LB211950
                MOVE F1-S-CSL TO SENT-VAL                               LB211960
                MOVE F1-R-C TO RCVD-VAL                                 LB211970
                ADD 1 TO FAIL-COUNT                                     LB211980
                PERFORM PRINT-ERRS THRU PR-OUT                          LB211990
            ELSE                                                        LB212000
              ADD 1 TO PASS-COUNT.                                      LB212010
                                                                        LB212020
            MOVE SEND-DATA TO F1-S-CSR                                  LB212030
            MOVE G1-S-CSR TO G1-R-C.                                    LB212040
            IF F1-S-CSR NOT = F1-R-C                                    LB212050
                MOVE "F1-S-CSR" TO TEST-ID                              LB212060
                MOVE F1-S-CSR TO SENT-VAL                               LB212070
                MOVE F1-R-C TO RCVD-VAL                                 LB212080
                ADD 1 TO FAIL-COUNT                                     LB212090
                PERFORM PRINT-ERRS THRU PR-OUT                          LB212100
            ELSE                                                        LB212110
              ADD 1 TO PASS-COUNT.                                      LB212120
                                                                        LB212130
            MOVE SEND-DATA TO F1-S-C4SD                                 LB212140
            MOVE G1-S-C4SD TO G1-R-C.                                   LB212150
            IF F1-S-C4SD NOT = F1-R-C                                   LB212160
                MOVE "F1-S-C4SD" TO TEST-ID                             LB212170
                MOVE F1-S-C4SD TO SENT-VAL                              LB212180
                MOVE F1-R-C TO RCVD-VAL                                 LB212190
                ADD 1 TO FAIL-COUNT                                     LB212200
                PERFORM PRINT-ERRS THRU PR-OUT                          LB212210
            ELSE                                                        LB212220
              ADD 1 TO PASS-COUNT.                                      LB212230
                                                                        LB212240
            MOVE SEND-DATA TO F1-S-C4SDL                                LB212250
            MOVE G1-S-C4SDL TO G1-R-C.                                  LB212260
            IF F1-S-C4SDL NOT = F1-R-C                                  LB212270
                MOVE "F1-S-C4SDL" TO TEST-ID                            LB212280
                MOVE F1-S-C4SDL TO SENT-VAL                             LB212290
                MOVE F1-R-C TO RCVD-VAL                                 LB212300
                ADD 1 TO FAIL-COUNT                                     LB212310
                PERFORM PRINT-ERRS THRU PR-OUT                          LB212320
            ELSE                                                        LB212330
              ADD 1 TO PASS-COUNT.                                      LB212340
                                                                        LB212350
            MOVE SEND-DATA TO F1-S-C4SDR                                LB212360
            MOVE G1-S-C4SDR TO G1-R-C.                                  LB212370
            IF F1-S-C4SDR NOT = F1-R-C                                  LB212380
                MOVE "F1-S-C4SDR" TO TEST-ID                            LB212390
                MOVE F1-S-C4SDR TO SENT-VAL                             LB212400
                MOVE F1-R-C TO RCVD-VAL                                 LB212410
                ADD 1 TO FAIL-COUNT                                     LB212420
                PERFORM PRINT-ERRS THRU PR-OUT                          LB212430
            ELSE                                                        LB212440
              ADD 1 TO PASS-COUNT.                                      LB212450
                                                                        LB212460
            MOVE SEND-DATA TO F1-S-C4S                                  LB212470
            MOVE G1-S-C4S TO G1-R-C.                                    LB212480
            IF F1-S-C4S NOT = F1-R-C                                    LB212490
                MOVE "F1-S-C4S" TO TEST-ID                              LB212500
                MOVE F1-S-C4S TO SENT-VAL                               LB212510
                MOVE F1-R-C TO RCVD-VAL                                 LB212520
                ADD 1 TO FAIL-COUNT                                     LB212530
                PERFORM PRINT-ERRS THRU PR-OUT                          LB212540
            ELSE                                                        LB212550
              ADD 1 TO PASS-COUNT.                                      LB212560
                                                                        LB212570
            MOVE SEND-DATA TO F1-S-C4SL                                 LB212580
            MOVE G1-S-C4SL TO G1-R-C.                                   LB212590
            IF F1-S-C4SL NOT = F1-R-C                                   LB212600
                MOVE "F1-S-C4SL" TO TEST-ID                             LB212610
                MOVE F1-S-C4SL TO SENT-VAL                              LB212620
                MOVE F1-R-C TO RCVD-VAL                                 LB212630
                ADD 1 TO FAIL-COUNT                                     LB212640
                PERFORM PRINT-ERRS THRU PR-OUT                          LB212650
            ELSE                                                        LB212660
              ADD 1 TO PASS-COUNT.                                      LB212670
                                                                        LB212680
            MOVE SEND-DATA TO F1-S-C4SR                                 LB212690
            MOVE G1-S-C4SR TO G1-R-C.                                   LB212700
            IF F1-S-C4SR NOT = F1-R-C                                   LB212710
                MOVE "F1-S-C4SR" TO TEST-ID                             LB212720
                MOVE F1-S-C4SR TO SENT-VAL                              LB212730
                MOVE F1-R-C TO RCVD-VAL                                 LB212740
                ADD 1 TO FAIL-COUNT                                     LB212750
                PERFORM PRINT-ERRS THRU PR-OUT                          LB212760
            ELSE                                                        LB212770
              ADD 1 TO PASS-COUNT.                                      LB212780
                                                                        LB212790
                                                                        LB212800
      **********************************************************        LB212810
      *                                                         *       LB212820
      *    MOVE 18 VARIATIONS OF 1 DIGIT FIELD TO A             *       LB212830
      *      "COMPUTATIONAL-5"  RECEIVING FIELD                 *       LB212840
      *                                                         *       LB212850
      **********************************************************        LB212860
                                                                        LB212870
                                                                        LB212880
            MOVE SEND-DATA TO F1-S-BSD                                  LB212890
            MOVE G1-S-BSD TO G1-R-C4.                                   LB212900
            IF F1-S-BSD NOT = F1-R-C4                                   LB212910
                MOVE "F1-S-BSD" TO TEST-ID                              LB212920
                MOVE F1-S-BSD TO SENT-VAL                               LB212930
                MOVE F1-R-C4 TO RCVD-VAL                                LB212940
                ADD 1 TO FAIL-COUNT                                     LB212950
                PERFORM PRINT-ERRS THRU PR-OUT                          LB212960
            ELSE                                                        LB212970
              ADD 1 TO PASS-COUNT.                                      LB212980
                                                                        LB212990
            MOVE SEND-DATA TO F1-S-BSDL                                 LB213000
            MOVE G1-S-BSDL TO G1-R-C4.                                  LB213010
            IF F1-S-BSDL NOT = F1-R-C4                                  LB213020
                MOVE "F1-S-BSDL" TO TEST-ID                             LB213030
                MOVE F1-S-BSDL TO SENT-VAL                              LB213040
                MOVE F1-R-C4 TO RCVD-VAL                                LB213050
                ADD 1 TO FAIL-COUNT                                     LB213060
                PERFORM PRINT-ERRS THRU PR-OUT                          LB213070
            ELSE                                                        LB213080
              ADD 1 TO PASS-COUNT.                                      LB213090
                                                                        LB213100
            MOVE SEND-DATA TO F1-S-BSDR                                 LB213110
            MOVE G1-S-BSDR TO G1-R-C4.                                  LB213120
            IF F1-S-BSDR NOT = F1-R-C4                                  LB213130
                MOVE "F1-S-BSDR" TO TEST-ID                             LB213140
                MOVE F1-S-BSDR TO SENT-VAL                              LB213150
                MOVE F1-R-C4 TO RCVD-VAL                                LB213160
                ADD 1 TO FAIL-COUNT                                     LB213170
                PERFORM PRINT-ERRS THRU PR-OUT                          LB213180
            ELSE                                                        LB213190
              ADD 1 TO PASS-COUNT.                                      LB213200
                                                                        LB213210
            MOVE SEND-DATA TO F1-S-BS                                   LB213220
            MOVE G1-S-BS TO G1-R-C4.                                    LB213230
            IF F1-S-BS NOT = F1-R-C4                                    LB213240
                MOVE "F1-S-BS" TO TEST-ID                               LB213250
                MOVE F1-S-BS TO SENT-VAL                                LB213260
                MOVE F1-R-C4 TO RCVD-VAL                                LB213270
                ADD 1 TO FAIL-COUNT                                     LB213280
                PERFORM PRINT-ERRS THRU PR-OUT                          LB213290
            ELSE                                                        LB213300
              ADD 1 TO PASS-COUNT.                                      LB213310
                                                                        LB213320
            MOVE SEND-DATA TO F1-S-BSL                                  LB213330
            MOVE G1-S-BSL TO G1-R-C4.                                   LB213340
            IF F1-S-BSL NOT = F1-R-C4                                   LB213350
                MOVE "F1-S-BSL" TO TEST-ID                              LB213360
                MOVE F1-S-BSL TO SENT-VAL                               LB213370
                MOVE F1-R-C4 TO RCVD-VAL                                LB213380
                ADD 1 TO FAIL-COUNT                                     LB213390
                PERFORM PRINT-ERRS THRU PR-OUT                          LB213400
            ELSE                                                        LB213410
              ADD 1 TO PASS-COUNT.                                      LB213420
                                                                        LB213430
            MOVE SEND-DATA TO F1-S-BSR                                  LB213440
            MOVE G1-S-BSR TO G1-R-C4.                                   LB213450
            IF F1-S-BSR NOT = F1-R-C4                                   LB213460
                MOVE "F1-S-BSR" TO TEST-ID                              LB213470
                MOVE F1-S-BSR TO SENT-VAL                               LB213480
                MOVE F1-R-C4 TO RCVD-VAL                                LB213490
                ADD 1 TO FAIL-COUNT                                     LB213500
                PERFORM PRINT-ERRS THRU PR-OUT                          LB213510
            ELSE                                                        LB213520
              ADD 1 TO PASS-COUNT.                                      LB213530
                                                                        LB213540
            MOVE SEND-DATA TO F1-S-CSD                                  LB213550
            MOVE G1-S-CSD TO G1-R-C4.                                   LB213560
            IF F1-S-CSD NOT = F1-R-C4                                   LB213570
                MOVE "F1-S-CSD" TO TEST-ID                              LB213580
                MOVE F1-S-CSD TO SENT-VAL                               LB213590
                MOVE F1-R-C4 TO RCVD-VAL                                LB213600
                ADD 1 TO FAIL-COUNT                                     LB213610
                PERFORM PRINT-ERRS THRU PR-OUT                          LB213620
            ELSE                                                        LB213630
              ADD 1 TO PASS-COUNT.                                      LB213640
                                                                        LB213650
            MOVE SEND-DATA TO F1-S-CSDL                                 LB213660
            MOVE G1-S-CSDL TO G1-R-C4.                                  LB213670
            IF F1-S-CSDL NOT = F1-R-C4                                  LB213680
                MOVE "F1-S-CSDL" TO TEST-ID                             LB213690
                MOVE F1-S-CSDL TO SENT-VAL                              LB213700
                MOVE F1-R-C4 TO RCVD-VAL                                LB213710
                ADD 1 TO FAIL-COUNT                                     LB213720
                PERFORM PRINT-ERRS THRU PR-OUT                          LB213730
            ELSE                                                        LB213740
              ADD 1 TO PASS-COUNT.                                      LB213750
                                                                        LB213760
            MOVE SEND-DATA TO F1-S-CSDR                                 LB213770
            MOVE G1-S-CSDR TO G1-R-C4.                                  LB213780
            IF F1-S-CSDR NOT = F1-R-C4                                  LB213790
                MOVE "F1-S-CSDR" TO TEST-ID                             LB213800
                MOVE F1-S-CSDR TO SENT-VAL                              LB213810
                MOVE F1-R-C4 TO RCVD-VAL                                LB213820
                ADD 1 TO FAIL-COUNT                                     LB213830
                PERFORM PRINT-ERRS THRU PR-OUT                          LB213840
            ELSE                                                        LB213850
              ADD 1 TO PASS-COUNT.                                      LB213860
                                                                        LB213870
            MOVE SEND-DATA TO F1-S-CS                                   LB213880
            MOVE G1-S-CS TO G1-R-C4.                                    LB213890
            IF F1-S-CS NOT = F1-R-C4                                    LB213900
                MOVE "F1-S-CS" TO TEST-ID                               LB213910
                MOVE F1-S-CS TO SENT-VAL                                LB213920
                MOVE F1-R-C4 TO RCVD-VAL                                LB213930
                ADD 1 TO FAIL-COUNT                                     LB213940
                PERFORM PRINT-ERRS THRU PR-OUT                          LB213950
            ELSE                                                        LB213960
              ADD 1 TO PASS-COUNT.                                      LB213970
                                                                        LB213980
            MOVE SEND-DATA TO F1-S-CSL                                  LB213990
            MOVE G1-S-CSL TO G1-R-C4.                                   LB214000
            IF F1-S-CSL NOT = F1-R-C4                                   LB214010
                MOVE "F1-S-CSL" TO TEST-ID                              LB214020
                MOVE F1-S-CSL TO SENT-VAL                               LB214030
                MOVE F1-R-C4 TO RCVD-VAL                                LB214040
                ADD 1 TO FAIL-COUNT                                     LB214050
                PERFORM PRINT-ERRS THRU PR-OUT                          LB214060
            ELSE                                                        LB214070
              ADD 1 TO PASS-COUNT.                                      LB214080
                                                                        LB214090
            MOVE SEND-DATA TO F1-S-CSR                                  LB214100
            MOVE G1-S-CSR TO G1-R-C4.                                   LB214110
            IF F1-S-CSR NOT = F1-R-C4                                   LB214120
                MOVE "F1-S-CSR" TO TEST-ID                              LB214130
                MOVE F1-S-CSR TO SENT-VAL                               LB214140
                MOVE F1-R-C4 TO RCVD-VAL                                LB214150
                ADD 1 TO FAIL-COUNT                                     LB214160
                PERFORM PRINT-ERRS THRU PR-OUT                          LB214170
            ELSE                                                        LB214180
              ADD 1 TO PASS-COUNT.                                      LB214190
                                                                        LB214200
            MOVE SEND-DATA TO F1-S-C4SD                                 LB214210
            MOVE G1-S-C4SD TO G1-R-C4.                                  LB214220
            IF F1-S-C4SD NOT = F1-R-C4                                  LB214230
                MOVE "F1-S-C4SD" TO TEST-ID                             LB214240
                MOVE F1-S-C4SD TO SENT-VAL                              LB214250
                MOVE F1-R-C4 TO RCVD-VAL                                LB214260
                ADD 1 TO FAIL-COUNT                                     LB214270
                PERFORM PRINT-ERRS THRU PR-OUT                          LB214280
            ELSE                                                        LB214290
              ADD 1 TO PASS-COUNT.                                      LB214300
                                                                        LB214310
            MOVE SEND-DATA TO F1-S-C4SDL                                LB214320
            MOVE G1-S-C4SDL TO G1-R-C4.                                 LB214330
            IF F1-S-C4SDL NOT = F1-R-C4                                 LB214340
                MOVE "F1-S-C4SDL" TO TEST-ID                            LB214350
                MOVE F1-S-C4SDL TO SENT-VAL                             LB214360
                MOVE F1-R-C4 TO RCVD-VAL                                LB214370
                ADD 1 TO FAIL-COUNT                                     LB214380
                PERFORM PRINT-ERRS THRU PR-OUT                          LB214390
            ELSE                                                        LB214400
              ADD 1 TO PASS-COUNT.                                      LB214410
                                                                        LB214420
            MOVE SEND-DATA TO F1-S-C4SDR                                LB214430
            MOVE G1-S-C4SDR TO G1-R-C4.                                 LB214440
            IF F1-S-C4SDR NOT = F1-R-C4                                 LB214450
                MOVE "F1-S-C4SDR" TO TEST-ID                            LB214460
                MOVE F1-S-C4SDR TO SENT-VAL                             LB214470
                MOVE F1-R-C4 TO RCVD-VAL                                LB214480
                ADD 1 TO FAIL-COUNT                                     LB214490
                PERFORM PRINT-ERRS THRU PR-OUT                          LB214500
            ELSE                                                        LB214510
              ADD 1 TO PASS-COUNT.                                      LB214520
                                                                        LB214530
            MOVE SEND-DATA TO F1-S-C4S                                  LB214540
            MOVE G1-S-C4S TO G1-R-C4.                                   LB214550
            IF F1-S-C4S NOT = F1-R-C4                                   LB214560
                MOVE "F1-S-C4S" TO TEST-ID                              LB214570
                MOVE F1-S-C4S TO SENT-VAL                               LB214580
                MOVE F1-R-C4 TO RCVD-VAL                                LB214590
                ADD 1 TO FAIL-COUNT                                     LB214600
                PERFORM PRINT-ERRS THRU PR-OUT                          LB214610
            ELSE                                                        LB214620
              ADD 1 TO PASS-COUNT.                                      LB214630
                                                                        LB214640
            MOVE SEND-DATA TO F1-S-C4SL                                 LB214650
            MOVE G1-S-C4SL TO G1-R-C4.                                  LB214660
            IF F1-S-C4SL NOT = F1-R-C4                                  LB214670
                MOVE "F1-S-C4SL" TO TEST-ID                             LB214680
                MOVE F1-S-C4SL TO SENT-VAL                              LB214690
                MOVE F1-R-C4 TO RCVD-VAL                                LB214700
                ADD 1 TO FAIL-COUNT                                     LB214710
                PERFORM PRINT-ERRS THRU PR-OUT                          LB214720
            ELSE                                                        LB214730
              ADD 1 TO PASS-COUNT.                                      LB214740
                                                                        LB214750
            MOVE SEND-DATA TO F1-S-C4SR                                 LB214760
            MOVE G1-S-C4SR TO G1-R-C4.                                  LB214770
            IF F1-S-C4SR NOT = F1-R-C4                                  LB214780
                MOVE "F1-S-C4SR" TO TEST-ID                             LB214790
                MOVE F1-S-C4SR TO SENT-VAL                              LB214800
                MOVE F1-R-C4 TO RCVD-VAL                                LB214810
                ADD 1 TO FAIL-COUNT                                     LB214820
                PERFORM PRINT-ERRS THRU PR-OUT                          LB214830
            ELSE                                                        LB214840
              ADD 1 TO PASS-COUNT.                                      LB214850
                                                                        LB214860
                                                                        LB214870
      *********************************************************         LB214880
      *                                                        *        LB214890
      *    MOVE 18 VARIATIONS OF 3 DIGIT FIELD TO A " comp-5"   *       LB214900
      *                  RECEIVING FIELD                       *        LB214910
      *                                                        *        LB214920
      **********************************************************        LB214930
                                                                        LB214940
            MOVE SEND-DATA TO F3-S-BSD                                  LB214950
            MOVE G3-S-BSD TO G3-R-B.                                    LB214960
            IF F3-S-BSD NOT = F3-R-B                                    LB214970
                MOVE "F3-S-BSD" TO TEST-ID                              LB214980
                MOVE F3-S-BSD TO SENT-VAL                               LB214990
                MOVE F3-R-B TO RCVD-VAL                                 LB215000
                ADD 1 TO FAIL-COUNT                                     LB215010
                PERFORM PRINT-ERRS THRU PR-OUT                          LB215020
            ELSE                                                        LB215030
              ADD 1 TO PASS-COUNT.                                      LB215040
                                                                        LB215050
            MOVE SEND-DATA TO F3-S-BSDL                                 LB215060
            MOVE G3-S-BSDL TO G3-R-B.                                   LB215070
            IF F3-S-BSDL NOT = F3-R-B                                   LB215080
                MOVE "F3-S-BSDL" TO TEST-ID                             LB215090
                MOVE F3-S-BSDL TO SENT-VAL                              LB215100
                MOVE F3-R-B TO RCVD-VAL                                 LB215110
                ADD 1 TO FAIL-COUNT                                     LB215120
                PERFORM PRINT-ERRS THRU PR-OUT                          LB215130
            ELSE                                                        LB215140
              ADD 1 TO PASS-COUNT.                                      LB215150
                                                                        LB215160
            MOVE SEND-DATA TO F3-S-BSDR                                 LB215170
            MOVE G3-S-BSDR TO G3-R-B.                                   LB215180
            IF F3-S-BSDR NOT = F3-R-B                                   LB215190
                MOVE "F3-S-BSDR" TO TEST-ID                             LB215200
                MOVE F3-S-BSDR TO SENT-VAL                              LB215210
                MOVE F3-R-B TO RCVD-VAL                                 LB215220
                ADD 1 TO FAIL-COUNT                                     LB215230
                PERFORM PRINT-ERRS THRU PR-OUT                          LB215240
            ELSE                                                        LB215250
              ADD 1 TO PASS-COUNT.                                      LB215260
                                                                        LB215270
            MOVE SEND-DATA TO F3-S-BS                                   LB215280
            MOVE G3-S-BS TO G3-R-B.                                     LB215290
            IF F3-S-BS NOT = F3-R-B                                     LB215300
                MOVE "F3-S-BS" TO TEST-ID                               LB215310
                MOVE F3-S-BS TO SENT-VAL                                LB215320
                MOVE F3-R-B TO RCVD-VAL                                 LB215330
                ADD 1 TO FAIL-COUNT                                     LB215340
                PERFORM PRINT-ERRS THRU PR-OUT                          LB215350
            ELSE                                                        LB215360
              ADD 1 TO PASS-COUNT.                                      LB215370
                                                                        LB215380
            MOVE SEND-DATA TO F3-S-BSL                                  LB215390
            MOVE G3-S-BSL TO G3-R-B.                                    LB215400
            IF F3-S-BSL NOT = F3-R-B                                    LB215410
                MOVE "F3-S-BSL" TO TEST-ID                              LB215420
                MOVE F3-S-BSL TO SENT-VAL                               LB215430
                MOVE F3-R-B TO RCVD-VAL                                 LB215440
                ADD 1 TO FAIL-COUNT                                     LB215450
                PERFORM PRINT-ERRS THRU PR-OUT                          LB215460
            ELSE                                                        LB215470
              ADD 1 TO PASS-COUNT.                                      LB215480
                                                                        LB215490
            MOVE SEND-DATA TO F3-S-BSR                                  LB215500
            MOVE G3-S-BSR TO G3-R-B.                                    LB215510
            IF F3-S-BSR NOT = F3-R-B                                    LB215520
                MOVE "F3-S-BSR" TO TEST-ID                              LB215530
                MOVE F3-S-BSR TO SENT-VAL                               LB215540
                MOVE F3-R-B TO RCVD-VAL                                 LB215550
                ADD 1 TO FAIL-COUNT                                     LB215560
                PERFORM PRINT-ERRS THRU PR-OUT                          LB215570
            ELSE                                                        LB215580
              ADD 1 TO PASS-COUNT.                                      LB215590
                                                                        LB215600
            MOVE SEND-DATA TO F3-S-CSD                                  LB215610
            MOVE G3-S-CSD TO G3-R-B.                                    LB215620
            IF F3-S-CSD NOT = F3-R-B                                    LB215630
                MOVE "F3-S-CSD" TO TEST-ID                              LB215640
                MOVE F3-S-CSD TO SENT-VAL                               LB215650
                MOVE F3-R-B TO RCVD-VAL                                 LB215660
                ADD 1 TO FAIL-COUNT                                     LB215670
                PERFORM PRINT-ERRS THRU PR-OUT                          LB215680
            ELSE                                                        LB215690
              ADD 1 TO PASS-COUNT.                                      LB215700
                                                                        LB215710
            MOVE SEND-DATA TO F3-S-CSDL                                 LB215720
            MOVE G3-S-CSDL TO G3-R-B.                                   LB215730
            IF F3-S-CSDL NOT = F3-R-B                                   LB215740
                MOVE "F3-S-CSDL" TO TEST-ID                             LB215750
                MOVE F3-S-CSDL TO SENT-VAL                              LB215760
                MOVE F3-R-B TO RCVD-VAL                                 LB215770
                ADD 1 TO FAIL-COUNT                                     LB215780
                PERFORM PRINT-ERRS THRU PR-OUT                          LB215790
            ELSE                                                        LB215800
              ADD 1 TO PASS-COUNT.                                      LB215810
                                                                        LB215820
            MOVE SEND-DATA TO F3-S-CSDR                                 LB215830
            MOVE G3-S-CSDR TO G3-R-B.                                   LB215840
            IF F3-S-CSDR NOT = F3-R-B                                   LB215850
                MOVE "F3-S-CSDR" TO TEST-ID                             LB215860
                MOVE F3-S-CSDR TO SENT-VAL                              LB215870
                MOVE F3-R-B TO RCVD-VAL                                 LB215880
                ADD 1 TO FAIL-COUNT                                     LB215890
                PERFORM PRINT-ERRS THRU PR-OUT                          LB215900
            ELSE                                                        LB215910
              ADD 1 TO PASS-COUNT.                                      LB215920
                                                                        LB215930
            MOVE SEND-DATA TO F3-S-CS                                   LB215940
            MOVE G3-S-CS TO G3-R-B.                                     LB215950
            IF F3-S-CS NOT = F3-R-B                                     LB215960
                MOVE "F3-S-CS" TO TEST-ID                               LB215970
                MOVE F3-S-CS TO SENT-VAL                                LB215980
                MOVE F3-R-B TO RCVD-VAL                                 LB215990
                ADD 1 TO FAIL-COUNT                                     LB216000
                PERFORM PRINT-ERRS THRU PR-OUT                          LB216010
            ELSE                                                        LB216020
              ADD 1 TO PASS-COUNT.                                      LB216030
                                                                        LB216040
            MOVE SEND-DATA TO F3-S-CSL                                  LB216050
            MOVE G3-S-CSL TO G3-R-B.                                    LB216060
            IF F3-S-CSL NOT = F3-R-B                                    LB216070
                MOVE "F3-S-CSL" TO TEST-ID                              LB216080
                MOVE F3-S-CSL TO SENT-VAL                               LB216090
                MOVE F3-R-B TO RCVD-VAL                                 LB216100
                ADD 1 TO FAIL-COUNT                                     LB216110
                PERFORM PRINT-ERRS THRU PR-OUT                          LB216120
            ELSE                                                        LB216130
              ADD 1 TO PASS-COUNT.                                      LB216140
                                                                        LB216150
            MOVE SEND-DATA TO F3-S-CSR                                  LB216160
            MOVE G3-S-CSR TO G3-R-B.                                    LB216170
            IF F3-S-CSR NOT = F3-R-B                                    LB216180
                MOVE "F3-S-CSR" TO TEST-ID                              LB216190
                MOVE F3-S-CSR TO SENT-VAL                               LB216200
                MOVE F3-R-B TO RCVD-VAL                                 LB216210
                ADD 1 TO FAIL-COUNT                                     LB216220
                PERFORM PRINT-ERRS THRU PR-OUT                          LB216230
            ELSE                                                        LB216240
              ADD 1 TO PASS-COUNT.                                      LB216250
                                                                        LB216260
            MOVE SEND-DATA TO F3-S-C4SD                                 LB216270
            MOVE G3-S-C4SD TO G3-R-B.                                   LB216280
            IF F3-S-C4SD NOT = F3-R-B                                   LB216290
                MOVE "F3-S-C4SD" TO TEST-ID                             LB216300
                MOVE F3-S-C4SD TO SENT-VAL                              LB216310
                MOVE F3-R-B TO RCVD-VAL                                 LB216320
                ADD 1 TO FAIL-COUNT                                     LB216330
                PERFORM PRINT-ERRS THRU PR-OUT                          LB216340
            ELSE                                                        LB216350
              ADD 1 TO PASS-COUNT.                                      LB216360
                                                                        LB216370
            MOVE SEND-DATA TO F3-S-C4SDL                                LB216380
            MOVE G3-S-C4SDL TO G3-R-B.                                  LB216390
            IF F3-S-C4SDL NOT = F3-R-B                                  LB216400
                MOVE "F3-S-C4SDL" TO TEST-ID                            LB216410
                MOVE F3-S-C4SDL TO SENT-VAL                             LB216420
                MOVE F3-R-B TO RCVD-VAL                                 LB216430
                ADD 1 TO FAIL-COUNT                                     LB216440
                PERFORM PRINT-ERRS THRU PR-OUT                          LB216450
            ELSE                                                        LB216460
              ADD 1 TO PASS-COUNT.                                      LB216470
                                                                        LB216480
            MOVE SEND-DATA TO F3-S-C4SDR                                LB216490
            MOVE G3-S-C4SDR TO G3-R-B.                                  LB216500
            IF F3-S-C4SDR NOT = F3-R-B                                  LB216510
                MOVE "F3-S-C4SDR" TO TEST-ID                            LB216520
                MOVE F3-S-C4SDR TO SENT-VAL                             LB216530
                MOVE F3-R-B TO RCVD-VAL                                 LB216540
                ADD 1 TO FAIL-COUNT                                     LB216550
                PERFORM PRINT-ERRS THRU PR-OUT                          LB216560
            ELSE                                                        LB216570
              ADD 1 TO PASS-COUNT.                                      LB216580
                                                                        LB216590
            MOVE SEND-DATA TO F3-S-C4S                                  LB216600
            MOVE G3-S-C4S TO G3-R-B.                                    LB216610
            IF F3-S-C4S NOT = F3-R-B                                    LB216620
                MOVE "F3-S-C4S" TO TEST-ID                              LB216630
                MOVE F3-S-C4S TO SENT-VAL                               LB216640
                MOVE F3-R-B TO RCVD-VAL                                 LB216650
                ADD 1 TO FAIL-COUNT                                     LB216660
                PERFORM PRINT-ERRS THRU PR-OUT                          LB216670
            ELSE                                                        LB216680
              ADD 1 TO PASS-COUNT.                                      LB216690
                                                                        LB216700
            MOVE SEND-DATA TO F3-S-C4SL                                 LB216710
            MOVE G3-S-C4SL TO G3-R-B.                                   LB216720
            IF F3-S-C4SL NOT = F3-R-B                                   LB216730
                MOVE "F3-S-C4SL" TO TEST-ID                             LB216740
                MOVE F3-S-C4SL TO SENT-VAL                              LB216750
                MOVE F3-R-B TO RCVD-VAL                                 LB216760
                ADD 1 TO FAIL-COUNT                                     LB216770
                PERFORM PRINT-ERRS THRU PR-OUT                          LB216780
            ELSE                                                        LB216790
              ADD 1 TO PASS-COUNT.                                      LB216800
                                                                        LB216810
            MOVE SEND-DATA TO F3-S-C4SR                                 LB216820
            MOVE G3-S-C4SR TO G3-R-B.                                   LB216830
            IF F3-S-C4SR NOT = F3-R-B                                   LB216840
                MOVE "F3-S-C4SR" TO TEST-ID                             LB216850
                MOVE F3-S-C4SR TO SENT-VAL                              LB216860
                MOVE F3-R-B TO RCVD-VAL                                 LB216870
                ADD 1 TO FAIL-COUNT                                     LB216880
                PERFORM PRINT-ERRS THRU PR-OUT                          LB216890
            ELSE                                                        LB216900
              ADD 1 TO PASS-COUNT.                                      LB216910
                                                                        LB216920
                                                                        LB216930
      **********************************************************        LB216940
      *                                                         *       LB216950
      *    MOVE 18 VARIATIONS OF 3 DIGIT FIELD TO A "comp-5"   *        LB216960
      *                  RECEIVING FIELD                        *       LB216970
      *                                                         *       LB216980
      **********************************************************        LB216990
                                                                        LB217000
            MOVE SEND-DATA TO F3-S-BSD                                  LB217010
            MOVE G3-S-BSD TO G3-R-C.                                    LB217020
            IF F3-S-BSD NOT = F3-R-C                                    LB217030
                MOVE "F3-S-BSD" TO TEST-ID                              LB217040
                MOVE F3-S-BSD TO SENT-VAL                               LB217050
                MOVE F3-R-C TO RCVD-VAL                                 LB217060
                ADD 1 TO FAIL-COUNT                                     LB217070
                PERFORM PRINT-ERRS THRU PR-OUT                          LB217080
            ELSE                                                        LB217090
              ADD 1 TO PASS-COUNT.                                      LB217100
                                                                        LB217110
            MOVE SEND-DATA TO F3-S-BSDL                                 LB217120
            MOVE G3-S-BSDL TO G3-R-C.                                   LB217130
            IF F3-S-BSDL NOT = F3-R-C                                   LB217140
                MOVE "F3-S-BSDL" TO TEST-ID                             LB217150
                MOVE F3-S-BSDL TO SENT-VAL                              LB217160
                MOVE F3-R-C TO RCVD-VAL                                 LB217170
                ADD 1 TO FAIL-COUNT                                     LB217180
                PERFORM PRINT-ERRS THRU PR-OUT                          LB217190
            ELSE                                                        LB217200
              ADD 1 TO PASS-COUNT.                                      LB217210
                                                                        LB217220
            MOVE SEND-DATA TO F3-S-BSDR                                 LB217230
            MOVE G3-S-BSDR TO G3-R-C.                                   LB217240
            IF F3-S-BSDR NOT = F3-R-C                                   LB217250
                MOVE "F3-S-BSDR" TO TEST-ID                             LB217260
                MOVE F3-S-BSDR TO SENT-VAL                              LB217270
                MOVE F3-R-C TO RCVD-VAL                                 LB217280
                ADD 1 TO FAIL-COUNT                                     LB217290
                PERFORM PRINT-ERRS THRU PR-OUT                          LB217300
            ELSE                                                        LB217310
              ADD 1 TO PASS-COUNT.                                      LB217320
                                                                        LB217330
            MOVE SEND-DATA TO F3-S-BS                                   LB217340
            MOVE G3-S-BS TO G3-R-C.                                     LB217350
            IF F3-S-BS NOT = F3-R-C                                     LB217360
                MOVE "F3-S-BS" TO TEST-ID                               LB217370
                MOVE F3-S-BS TO SENT-VAL                                LB217380
                MOVE F3-R-C TO RCVD-VAL                                 LB217390
                ADD 1 TO FAIL-COUNT                                     LB217400
                PERFORM PRINT-ERRS THRU PR-OUT                          LB217410
            ELSE                                                        LB217420
              ADD 1 TO PASS-COUNT.                                      LB217430
                                                                        LB217440
            MOVE SEND-DATA TO F3-S-BSL                                  LB217450
            MOVE G3-S-BSL TO G3-R-C.                                    LB217460
            IF F3-S-BSL NOT = F3-R-C                                    LB217470
                MOVE "F3-S-BSL" TO TEST-ID                              LB217480
                MOVE F3-S-BSL TO SENT-VAL                               LB217490
                MOVE F3-R-C TO RCVD-VAL                                 LB217500
                ADD 1 TO FAIL-COUNT                                     LB217510
                PERFORM PRINT-ERRS THRU PR-OUT                          LB217520
            ELSE                                                        LB217530
              ADD 1 TO PASS-COUNT.                                      LB217540
                                                                        LB217550
            MOVE SEND-DATA TO F3-S-BSR                                  LB217560
            MOVE G3-S-BSR TO G3-R-C.                                    LB217570
            IF F3-S-BSR NOT = F3-R-C                                    LB217580
                MOVE "F3-S-BSR" TO TEST-ID                              LB217590
                MOVE F3-S-BSR TO SENT-VAL                               LB217600
                MOVE F3-R-C TO RCVD-VAL                                 LB217610
                ADD 1 TO FAIL-COUNT                                     LB217620
                PERFORM PRINT-ERRS THRU PR-OUT                          LB217630
            ELSE                                                        LB217640
              ADD 1 TO PASS-COUNT.                                      LB217650
                                                                        LB217660
            MOVE SEND-DATA TO F3-S-CSD                                  LB217670
            MOVE G3-S-CSD TO G3-R-C.                                    LB217680
            IF F3-S-CSD NOT = F3-R-C                                    LB217690
                MOVE "F3-S-CSD" TO TEST-ID                              LB217700
                MOVE F3-S-CSD TO SENT-VAL                               LB217710
                MOVE F3-R-C TO RCVD-VAL                                 LB217720
                ADD 1 TO FAIL-COUNT                                     LB217730
                PERFORM PRINT-ERRS THRU PR-OUT                          LB217740
            ELSE                                                        LB217750
              ADD 1 TO PASS-COUNT.                                      LB217760
                                                                        LB217770
            MOVE SEND-DATA TO F3-S-CSDL                                 LB217780
            MOVE G3-S-CSDL TO G3-R-C.                                   LB217790
            IF F3-S-CSDL NOT = F3-R-C                                   LB217800
                MOVE "F3-S-CSDL" TO TEST-ID                             LB217810
                MOVE F3-S-CSDL TO SENT-VAL                              LB217820
                MOVE F3-R-C TO RCVD-VAL                                 LB217830
                ADD 1 TO FAIL-COUNT                                     LB217840
                PERFORM PRINT-ERRS THRU PR-OUT                          LB217850
            ELSE                                                        LB217860
              ADD 1 TO PASS-COUNT.                                      LB217870
                                                                        LB217880
            MOVE SEND-DATA TO F3-S-CSDR                                 LB217890
            MOVE G3-S-CSDR TO G3-R-C.                                   LB217900
            IF F3-S-CSDR NOT = F3-R-C                                   LB217910
                MOVE "F3-S-CSDR" TO TEST-ID                             LB217920
                MOVE F3-S-CSDR TO SENT-VAL                              LB217930
                MOVE F3-R-C TO RCVD-VAL                                 LB217940
                ADD 1 TO FAIL-COUNT                                     LB217950
                PERFORM PRINT-ERRS THRU PR-OUT                          LB217960
            ELSE                                                        LB217970
              ADD 1 TO PASS-COUNT.                                      LB217980
                                                                        LB217990
            MOVE SEND-DATA TO F3-S-CS                                   LB218000
            MOVE G3-S-CS TO G3-R-C.                                     LB218010
            IF F3-S-CS NOT = F3-R-C                                     LB218020
                MOVE "F3-S-CS" TO TEST-ID                               LB218030
                MOVE F3-S-CS TO SENT-VAL                                LB218040
                MOVE F3-R-C TO RCVD-VAL                                 LB218050
                ADD 1 TO FAIL-COUNT                                     LB218060
                PERFORM PRINT-ERRS THRU PR-OUT                          LB218070
            ELSE                                                        LB218080
              ADD 1 TO PASS-COUNT.                                      LB218090
                                                                        LB218100
            MOVE SEND-DATA TO F3-S-CSL                                  LB218110
            MOVE G3-S-CSL TO G3-R-C.                                    LB218120
            IF F3-S-CSL NOT = F3-R-C                                    LB218130
                MOVE "F3-S-CSL" TO TEST-ID                              LB218140
                MOVE F3-S-CSL TO SENT-VAL                               LB218150
                MOVE F3-R-C TO RCVD-VAL                                 LB218160
                ADD 1 TO FAIL-COUNT                                     LB218170
                PERFORM PRINT-ERRS THRU PR-OUT                          LB218180
            ELSE                                                        LB218190
              ADD 1 TO PASS-COUNT.                                      LB218200
                                                                        LB218210
            MOVE SEND-DATA TO F3-S-CSR                                  LB218220
            MOVE G3-S-CSR TO G3-R-C.                                    LB218230
            IF F3-S-CSR NOT = F3-R-C                                    LB218240
                MOVE "F3-S-CSR" TO TEST-ID                              LB218250
                MOVE F3-S-CSR TO SENT-VAL                               LB218260
                MOVE F3-R-C TO RCVD-VAL                                 LB218270
                ADD 1 TO FAIL-COUNT                                     LB218280
                PERFORM PRINT-ERRS THRU PR-OUT                          LB218290
            ELSE                                                        LB218300
              ADD 1 TO PASS-COUNT.                                      LB218310
                                                                        LB218320
            MOVE SEND-DATA TO F3-S-C4SD                                 LB218330
            MOVE G3-S-C4SD TO G3-R-C.                                   LB218340
            IF F3-S-C4SD NOT = F3-R-C                                   LB218350
                MOVE "F3-S-C4SD" TO TEST-ID                             LB218360
                MOVE F3-S-C4SD TO SENT-VAL                              LB218370
                MOVE F3-R-C TO RCVD-VAL                                 LB218380
                ADD 1 TO FAIL-COUNT                                     LB218390
                PERFORM PRINT-ERRS THRU PR-OUT                          LB218400
            ELSE                                                        LB218410
              ADD 1 TO PASS-COUNT.                                      LB218420
                                                                        LB218430
            MOVE SEND-DATA TO F3-S-C4SDL                                LB218440
            MOVE G3-S-C4SDL TO G3-R-C.                                  LB218450
            IF F3-S-C4SDL NOT = F3-R-C                                  LB218460
                MOVE "F3-S-C4SDL" TO TEST-ID                            LB218470
                MOVE F3-S-C4SDL TO SENT-VAL                             LB218480
                MOVE F3-R-C TO RCVD-VAL                                 LB218490
                ADD 1 TO FAIL-COUNT                                     LB218500
                PERFORM PRINT-ERRS THRU PR-OUT                          LB218510
            ELSE                                                        LB218520
              ADD 1 TO PASS-COUNT.                                      LB218530
                                                                        LB218540
            MOVE SEND-DATA TO F3-S-C4SDR                                LB218550
            MOVE G3-S-C4SDR TO G3-R-C.                                  LB218560
            IF F3-S-C4SDR NOT = F3-R-C                                  LB218570
                MOVE "F3-S-C4SDR" TO TEST-ID                            LB218580
                MOVE F3-S-C4SDR TO SENT-VAL                             LB218590
                MOVE F3-R-C TO RCVD-VAL                                 LB218600
                ADD 1 TO FAIL-COUNT                                     LB218610
                PERFORM PRINT-ERRS THRU PR-OUT                          LB218620
            ELSE                                                        LB218630
              ADD 1 TO PASS-COUNT.                                      LB218640
                                                                        LB218650
            MOVE SEND-DATA TO F3-S-C4S                                  LB218660
            MOVE G3-S-C4S TO G3-R-C.                                    LB218670
            IF F3-S-C4S NOT = F3-R-C                                    LB218680
                MOVE "F3-S-C4S" TO TEST-ID                              LB218690
                MOVE F3-S-C4S TO SENT-VAL                               LB218700
                MOVE F3-R-C TO RCVD-VAL                                 LB218710
                ADD 1 TO FAIL-COUNT                                     LB218720
                PERFORM PRINT-ERRS THRU PR-OUT                          LB218730
            ELSE                                                        LB218740
              ADD 1 TO PASS-COUNT.                                      LB218750
                                                                        LB218760
            MOVE SEND-DATA TO F3-S-C4SL                                 LB218770
            MOVE G3-S-C4SL TO G3-R-C.                                   LB218780
            IF F3-S-C4SL NOT = F3-R-C                                   LB218790
                MOVE "F3-S-C4SL" TO TEST-ID                             LB218800
                MOVE F3-S-C4SL TO SENT-VAL                              LB218810
                MOVE F3-R-C TO RCVD-VAL                                 LB218820
                ADD 1 TO FAIL-COUNT                                     LB218830
                PERFORM PRINT-ERRS THRU PR-OUT                          LB218840
            ELSE                                                        LB218850
              ADD 1 TO PASS-COUNT.                                      LB218860
                                                                        LB218870
            MOVE SEND-DATA TO F3-S-C4SR                                 LB218880
            MOVE G3-S-C4SR TO G3-R-C.                                   LB218890
            IF F3-S-C4SR NOT = F3-R-C                                   LB218900
                MOVE "F3-S-C4SR" TO TEST-ID                             LB218910
                MOVE F3-S-C4SR TO SENT-VAL                              LB218920
                MOVE F3-R-C TO RCVD-VAL                                 LB218930
                ADD 1 TO FAIL-COUNT                                     LB218940
                PERFORM PRINT-ERRS THRU PR-OUT                          LB218950
            ELSE                                                        LB218960
              ADD 1 TO PASS-COUNT.                                      LB218970
                                                                        LB218980
                                                                        LB218990
      **********************************************************        LB219000
      *                                                         *       LB219010
      *    MOVE 18 VARIATIONS OF 3 DIGIT FIELD TO A             *       LB219020
      *      "COMPUTATIONAL-5"  RECEIVING FIELD                 *       LB219030
      *                                                         *       LB219040
      **********************************************************        LB219050
                                                                        LB219060
            MOVE SEND-DATA TO F3-S-BSD                                  LB219070
            MOVE G3-S-BSD TO G3-R-C4.                                   LB219080
            IF F3-S-BSD NOT = F3-R-C4                                   LB219090
                MOVE "F3-S-BSD" TO TEST-ID                              LB219100
                MOVE F3-S-BSD TO SENT-VAL                               LB219110
                MOVE F3-R-C4 TO RCVD-VAL                                LB219120
                ADD 1 TO FAIL-COUNT                                     LB219130
                PERFORM PRINT-ERRS THRU PR-OUT                          LB219140
            ELSE                                                        LB219150
              ADD 1 TO PASS-COUNT.                                      LB219160
                                                                        LB219170
            MOVE SEND-DATA TO F3-S-BSDL                                 LB219180
            MOVE G3-S-BSDL TO G3-R-C4.                                  LB219190
            IF F3-S-BSDL NOT = F3-R-C4                                  LB219200
                MOVE "F3-S-BSDL" TO TEST-ID                             LB219210
                MOVE F3-S-BSDL TO SENT-VAL                              LB219220
                MOVE F3-R-C4 TO RCVD-VAL                                LB219230
                ADD 1 TO FAIL-COUNT                                     LB219240
                PERFORM PRINT-ERRS THRU PR-OUT                          LB219250
            ELSE                                                        LB219260
              ADD 1 TO PASS-COUNT.                                      LB219270
                                                                        LB219280
            MOVE SEND-DATA TO F3-S-BSDR                                 LB219290
            MOVE G3-S-BSDR TO G3-R-C4.                                  LB219300
            IF F3-S-BSDR NOT = F3-R-C4                                  LB219310
                MOVE "F3-S-BSDR" TO TEST-ID                             LB219320
                MOVE F3-S-BSDR TO SENT-VAL                              LB219330
                MOVE F3-R-C4 TO RCVD-VAL                                LB219340
                ADD 1 TO FAIL-COUNT                                     LB219350
                PERFORM PRINT-ERRS THRU PR-OUT                          LB219360
            ELSE                                                        LB219370
              ADD 1 TO PASS-COUNT.                                      LB219380
                                                                        LB219390
            MOVE SEND-DATA TO F3-S-BS                                   LB219400
            MOVE G3-S-BS TO G3-R-C4.                                    LB219410
            IF F3-S-BS NOT = F3-R-C4                                    LB219420
                MOVE "F3-S-BS" TO TEST-ID                               LB219430
                MOVE F3-S-BS TO SENT-VAL                                LB219440
                MOVE F3-R-C4 TO RCVD-VAL                                LB219450
                ADD 1 TO FAIL-COUNT                                     LB219460
                PERFORM PRINT-ERRS THRU PR-OUT                          LB219470
            ELSE                                                        LB219480
              ADD 1 TO PASS-COUNT.                                      LB219490
                                                                        LB219500
            MOVE SEND-DATA TO F3-S-BSL                                  LB219510
            MOVE G3-S-BSL TO G3-R-C4.                                   LB219520
            IF F3-S-BSL NOT = F3-R-C4                                   LB219530
                MOVE "F3-S-BSL" TO TEST-ID                              LB219540
                MOVE F3-S-BSL TO SENT-VAL                               LB219550
                MOVE F3-R-C4 TO RCVD-VAL                                LB219560
                ADD 1 TO FAIL-COUNT                                     LB219570
                PERFORM PRINT-ERRS THRU PR-OUT                          LB219580
            ELSE                                                        LB219590
              ADD 1 TO PASS-COUNT.                                      LB219600
                                                                        LB219610
            MOVE SEND-DATA TO F3-S-BSR                                  LB219620
            MOVE G3-S-BSR TO G3-R-C4.                                   LB219630
            IF F3-S-BSR NOT = F3-R-C4                                   LB219640
                MOVE "F3-S-BSR" TO TEST-ID                              LB219650
                MOVE F3-S-BSR TO SENT-VAL                               LB219660
                MOVE F3-R-C4 TO RCVD-VAL                                LB219670
                ADD 1 TO FAIL-COUNT                                     LB219680
                PERFORM PRINT-ERRS THRU PR-OUT                          LB219690
            ELSE                                                        LB219700
              ADD 1 TO PASS-COUNT.                                      LB219710
                                                                        LB219720
            MOVE SEND-DATA TO F3-S-CSD                                  LB219730
            MOVE G3-S-CSD TO G3-R-C4.                                   LB219740
            IF F3-S-CSD NOT = F3-R-C4                                   LB219750
                MOVE "F3-S-CSD" TO TEST-ID                              LB219760
                MOVE F3-S-CSD TO SENT-VAL                               LB219770
                MOVE F3-R-C4 TO RCVD-VAL                                LB219780
                ADD 1 TO FAIL-COUNT                                     LB219790
                PERFORM PRINT-ERRS THRU PR-OUT                          LB219800
            ELSE                                                        LB219810
              ADD 1 TO PASS-COUNT.                                      LB219820
                                                                        LB219830
            MOVE SEND-DATA TO F3-S-CSDL                                 LB219840
            MOVE G3-S-CSDL TO G3-R-C4.                                  LB219850
            IF F3-S-CSDL NOT = F3-R-C4                                  LB219860
                MOVE "F3-S-CSDL" TO TEST-ID                             LB219870
                MOVE F3-S-CSDL TO SENT-VAL                              LB219880
                MOVE F3-R-C4 TO RCVD-VAL                                LB219890
                ADD 1 TO FAIL-COUNT                                     LB219900
                PERFORM PRINT-ERRS THRU PR-OUT                          LB219910
            ELSE                                                        LB219920
              ADD 1 TO PASS-COUNT.                                      LB219930
                                                                        LB219940
            MOVE SEND-DATA TO F3-S-CSDR                                 LB219950
            MOVE G3-S-CSDR TO G3-R-C4.                                  LB219960
            IF F3-S-CSDR NOT = F3-R-C4                                  LB219970
                MOVE "F3-S-CSDR" TO TEST-ID                             LB219980
                MOVE F3-S-CSDR TO SENT-VAL                              LB219990
                MOVE F3-R-C4 TO RCVD-VAL                                LB220000
                ADD 1 TO FAIL-COUNT                                     LB220010
                PERFORM PRINT-ERRS THRU PR-OUT                          LB220020
            ELSE                                                        LB220030
              ADD 1 TO PASS-COUNT.                                      LB220040
                                                                        LB220050
            MOVE SEND-DATA TO F3-S-CS                                   LB220060
            MOVE G3-S-CS TO G3-R-C4.                                    LB220070
            IF F3-S-CS NOT = F3-R-C4                                    LB220080
                MOVE "F3-S-CS" TO TEST-ID                               LB220090
                MOVE F3-S-CS TO SENT-VAL                                LB220100
                MOVE F3-R-C4 TO RCVD-VAL                                LB220110
                ADD 1 TO FAIL-COUNT                                     LB220120
                PERFORM PRINT-ERRS THRU PR-OUT                          LB220130
            ELSE                                                        LB220140
              ADD 1 TO PASS-COUNT.                                      LB220150
                                                                        LB220160
            MOVE SEND-DATA TO F3-S-CSL                                  LB220170
            MOVE G3-S-CSL TO G3-R-C4.                                   LB220180
            IF F3-S-CSL NOT = F3-R-C4                                   LB220190
                MOVE "F3-S-CSL" TO TEST-ID                              LB220200
                MOVE F3-S-CSL TO SENT-VAL                               LB220210
                MOVE F3-R-C4 TO RCVD-VAL                                LB220220
                ADD 1 TO FAIL-COUNT                                     LB220230
                PERFORM PRINT-ERRS THRU PR-OUT                          LB220240
            ELSE                                                        LB220250
              ADD 1 TO PASS-COUNT.                                      LB220260
                                                                        LB220270
            MOVE SEND-DATA TO F3-S-CSR                                  LB220280
            MOVE G3-S-CSR TO G3-R-C4.                                   LB220290
            IF F3-S-CSR NOT = F3-R-C4                                   LB220300
                MOVE "F3-S-CSR" TO TEST-ID                              LB220310
                MOVE F3-S-CSR TO SENT-VAL                               LB220320
                MOVE F3-R-C4 TO RCVD-VAL                                LB220330
                ADD 1 TO FAIL-COUNT                                     LB220340
                PERFORM PRINT-ERRS THRU PR-OUT                          LB220350
            ELSE                                                        LB220360
              ADD 1 TO PASS-COUNT.                                      LB220370
                                                                        LB220380
            MOVE SEND-DATA TO F3-S-C4SD                                 LB220390
            MOVE G3-S-C4SD TO G3-R-C4.                                  LB220400
            IF F3-S-C4SD NOT = F3-R-C4                                  LB220410
                MOVE "F3-S-C4SD" TO TEST-ID                             LB220420
                MOVE F3-S-C4SD TO SENT-VAL                              LB220430
                MOVE F3-R-C4 TO RCVD-VAL                                LB220440
                ADD 1 TO FAIL-COUNT                                     LB220450
                PERFORM PRINT-ERRS THRU PR-OUT                          LB220460
            ELSE                                                        LB220470
              ADD 1 TO PASS-COUNT.                                      LB220480
                                                                        LB220490
            MOVE SEND-DATA TO F3-S-C4SDL                                LB220500
            MOVE G3-S-C4SDL TO G3-R-C4.                                 LB220510
            IF F3-S-C4SDL NOT = F3-R-C4                                 LB220520
                MOVE "F3-S-C4SDL" TO TEST-ID                            LB220530
                MOVE F3-S-C4SDL TO SENT-VAL                             LB220540
                MOVE F3-R-C4 TO RCVD-VAL                                LB220550
                ADD 1 TO FAIL-COUNT                                     LB220560
                PERFORM PRINT-ERRS THRU PR-OUT                          LB220570
            ELSE                                                        LB220580
              ADD 1 TO PASS-COUNT.                                      LB220590
                                                                        LB220600
            MOVE SEND-DATA TO F3-S-C4SDR                                LB220610
            MOVE G3-S-C4SDR TO G3-R-C4.                                 LB220620
            IF F3-S-C4SDR NOT = F3-R-C4                                 LB220630
                MOVE "F3-S-C4SDR" TO TEST-ID                            LB220640
                MOVE F3-S-C4SDR TO SENT-VAL                             LB220650
                MOVE F3-R-C4 TO RCVD-VAL                                LB220660
                ADD 1 TO FAIL-COUNT                                     LB220670
                PERFORM PRINT-ERRS THRU PR-OUT                          LB220680
            ELSE                                                        LB220690
              ADD 1 TO PASS-COUNT.                                      LB220700
                                                                        LB220710
            MOVE SEND-DATA TO F3-S-C4S                                  LB220720
            MOVE G3-S-C4S TO G3-R-C4.                                   LB220730
            IF F3-S-C4S NOT = F3-R-C4                                   LB220740
                MOVE "F3-S-C4S" TO TEST-ID                              LB220750
                MOVE F3-S-C4S TO SENT-VAL                               LB220760
                MOVE F3-R-C4 TO RCVD-VAL                                LB220770
                ADD 1 TO FAIL-COUNT                                     LB220780
                PERFORM PRINT-ERRS THRU PR-OUT                          LB220790
            ELSE                                                        LB220800
              ADD 1 TO PASS-COUNT.                                      LB220810
                                                                        LB220820
            MOVE SEND-DATA TO F3-S-C4SL                                 LB220830
            MOVE G3-S-C4SL TO G3-R-C4.                                  LB220840
            IF F3-S-C4SL NOT = F3-R-C4                                  LB220850
                MOVE "F3-S-C4SL" TO TEST-ID                             LB220860
                MOVE F3-S-C4SL TO SENT-VAL                              LB220870
                MOVE F3-R-C4 TO RCVD-VAL                                LB220880
                ADD 1 TO FAIL-COUNT                                     LB220890
                PERFORM PRINT-ERRS THRU PR-OUT                          LB220900
            ELSE                                                        LB220910
              ADD 1 TO PASS-COUNT.                                      LB220920
                                                                        LB220930
            MOVE SEND-DATA TO F3-S-C4SR                                 LB220940
            MOVE G3-S-C4SR TO G3-R-C4.                                  LB220950
            IF F3-S-C4SR NOT = F3-R-C4                                  LB220960
                MOVE "F3-S-C4SR" TO TEST-ID                             LB220970
                MOVE F3-S-C4SR TO SENT-VAL                              LB220980
                MOVE F3-R-C4 TO RCVD-VAL                                LB220990
                ADD 1 TO FAIL-COUNT                                     LB221000
                PERFORM PRINT-ERRS THRU PR-OUT                          LB221010
            ELSE                                                        LB221020
              ADD 1 TO PASS-COUNT.                                      LB221030
                                                                        LB221040
                                                                        LB221050
      *********************************************************         LB221060
      *                                                        *        LB221070
      *    MOVE 18 VARIATIONS OF 4 DIGIT FIELD TO A " comp-5"   *       LB221080
      *                  RECEIVING FIELD                       *        LB221090
      *                                                        *        LB221100
      **********************************************************        LB221110
                                                                        LB221120
            MOVE SEND-DATA TO F4-S-BSD                                  LB221130
            MOVE G4-S-BSD TO G4-R-B.                                    LB221140
            IF F4-S-BSD NOT = F4-R-B                                    LB221150
                MOVE "F4-S-BSD" TO TEST-ID                              LB221160
                MOVE F4-S-BSD TO SENT-VAL                               LB221170
                MOVE F4-R-B TO RCVD-VAL                                 LB221180
                ADD 1 TO FAIL-COUNT                                     LB221190
                PERFORM PRINT-ERRS THRU PR-OUT                          LB221200
            ELSE                                                        LB221210
              ADD 1 TO PASS-COUNT.                                      LB221220
                                                                        LB221230
            MOVE SEND-DATA TO F4-S-BSDL                                 LB221240
            MOVE G4-S-BSDL TO G4-R-B.                                   LB221250
            IF F4-S-BSDL NOT = F4-R-B                                   LB221260
                MOVE "F4-S-BSDL" TO TEST-ID                             LB221270
                MOVE F4-S-BSDL TO SENT-VAL                              LB221280
                MOVE F4-R-B TO RCVD-VAL                                 LB221290
                ADD 1 TO FAIL-COUNT                                     LB221300
                PERFORM PRINT-ERRS THRU PR-OUT                          LB221310
            ELSE                                                        LB221320
              ADD 1 TO PASS-COUNT.                                      LB221330
                                                                        LB221340
            MOVE SEND-DATA TO F4-S-BSDR                                 LB221350
            MOVE G4-S-BSDR TO G4-R-B.                                   LB221360
            IF F4-S-BSDR NOT = F4-R-B                                   LB221370
                MOVE "F4-S-BSDR" TO TEST-ID                             LB221380
                MOVE F4-S-BSDR TO SENT-VAL                              LB221390
                MOVE F4-R-B TO RCVD-VAL                                 LB221400
                ADD 1 TO FAIL-COUNT                                     LB221410
                PERFORM PRINT-ERRS THRU PR-OUT                          LB221420
            ELSE                                                        LB221430
              ADD 1 TO PASS-COUNT.                                      LB221440
                                                                        LB221450
            MOVE SEND-DATA TO F4-S-BS                                   LB221460
            MOVE G4-S-BS TO G4-R-B.                                     LB221470
            IF F4-S-BS NOT = F4-R-B                                     LB221480
                MOVE "F4-S-BS" TO TEST-ID                               LB221490
                MOVE F4-S-BS TO SENT-VAL                                LB221500
                MOVE F4-R-B TO RCVD-VAL                                 LB221510
                ADD 1 TO FAIL-COUNT                                     LB221520
                PERFORM PRINT-ERRS THRU PR-OUT                          LB221530
            ELSE                                                        LB221540
              ADD 1 TO PASS-COUNT.                                      LB221550
                                                                        LB221560
            MOVE SEND-DATA TO F4-S-BSL                                  LB221570
            MOVE G4-S-BSL TO G4-R-B.                                    LB221580
            IF F4-S-BSL NOT = F4-R-B                                    LB221590
                MOVE "F4-S-BSL" TO TEST-ID                              LB221600
                MOVE F4-S-BSL TO SENT-VAL                               LB221610
                MOVE F4-R-B TO RCVD-VAL                                 LB221620
                ADD 1 TO FAIL-COUNT                                     LB221630
                PERFORM PRINT-ERRS THRU PR-OUT                          LB221640
            ELSE                                                        LB221650
              ADD 1 TO PASS-COUNT.                                      LB221660
                                                                        LB221670
            MOVE SEND-DATA TO F4-S-BSR                                  LB221680
            MOVE G4-S-BSR TO G4-R-B.                                    LB221690
            IF F4-S-BSR NOT = F4-R-B                                    LB221700
                MOVE "F4-S-BSR" TO TEST-ID                              LB221710
                MOVE F4-S-BSR TO SENT-VAL                               LB221720
                MOVE F4-R-B TO RCVD-VAL                                 LB221730
                ADD 1 TO FAIL-COUNT                                     LB221740
                PERFORM PRINT-ERRS THRU PR-OUT                          LB221750
            ELSE                                                        LB221760
              ADD 1 TO PASS-COUNT.                                      LB221770
                                                                        LB221780
            MOVE SEND-DATA TO F4-S-CSD                                  LB221790
            MOVE G4-S-CSD TO G4-R-B.                                    LB221800
            IF F4-S-CSD NOT = F4-R-B                                    LB221810
                MOVE "F4-S-CSD" TO TEST-ID                              LB221820
                MOVE F4-S-CSD TO SENT-VAL                               LB221830
                MOVE F4-R-B TO RCVD-VAL                                 LB221840
                ADD 1 TO FAIL-COUNT                                     LB221850
                PERFORM PRINT-ERRS THRU PR-OUT                          LB221860
            ELSE                                                        LB221870
              ADD 1 TO PASS-COUNT.                                      LB221880
                                                                        LB221890
            MOVE SEND-DATA TO F4-S-CSDL                                 LB221900
            MOVE G4-S-CSDL TO G4-R-B.                                   LB221910
            IF F4-S-CSDL NOT = F4-R-B                                   LB221920
                MOVE "F4-S-CSDL" TO TEST-ID                             LB221930
                MOVE F4-S-CSDL TO SENT-VAL                              LB221940
                MOVE F4-R-B TO RCVD-VAL                                 LB221950
                ADD 1 TO FAIL-COUNT                                     LB221960
                PERFORM PRINT-ERRS THRU PR-OUT                          LB221970
            ELSE                                                        LB221980
              ADD 1 TO PASS-COUNT.                                      LB221990
                                                                        LB222000
            MOVE SEND-DATA TO F4-S-CSDR                                 LB222010
            MOVE G4-S-CSDR TO G4-R-B.                                   LB222020
            IF F4-S-CSDR NOT = F4-R-B                                   LB222030
                MOVE "F4-S-CSDR" TO TEST-ID                             LB222040
                MOVE F4-S-CSDR TO SENT-VAL                              LB222050
                MOVE F4-R-B TO RCVD-VAL                                 LB222060
                ADD 1 TO FAIL-COUNT                                     LB222070
                PERFORM PRINT-ERRS THRU PR-OUT                          LB222080
            ELSE                                                        LB222090
              ADD 1 TO PASS-COUNT.                                      LB222100
                                                                        LB222110
            MOVE SEND-DATA TO F4-S-CS                                   LB222120
            MOVE G4-S-CS TO G4-R-B.                                     LB222130
            IF F4-S-CS NOT = F4-R-B                                     LB222140
                MOVE "F4-S-CS" TO TEST-ID                               LB222150
                MOVE F4-S-CS TO SENT-VAL                                LB222160
                MOVE F4-R-B TO RCVD-VAL                                 LB222170
                ADD 1 TO FAIL-COUNT                                     LB222180
                PERFORM PRINT-ERRS THRU PR-OUT                          LB222190
            ELSE                                                        LB222200
              ADD 1 TO PASS-COUNT.                                      LB222210
                                                                        LB222220
            MOVE SEND-DATA TO F4-S-CSL                                  LB222230
            MOVE G4-S-CSL TO G4-R-B.                                    LB222240
            IF F4-S-CSL NOT = F4-R-B                                    LB222250
                MOVE "F4-S-CSL" TO TEST-ID                              LB222260
                MOVE F4-S-CSL TO SENT-VAL                               LB222270
                MOVE F4-R-B TO RCVD-VAL                                 LB222280
                ADD 1 TO FAIL-COUNT                                     LB222290
                PERFORM PRINT-ERRS THRU PR-OUT                          LB222300
            ELSE                                                        LB222310
              ADD 1 TO PASS-COUNT.                                      LB222320
                                                                        LB222330
            MOVE SEND-DATA TO F4-S-CSR                                  LB222340
            MOVE G4-S-CSR TO G4-R-B.                                    LB222350
            IF F4-S-CSR NOT = F4-R-B                                    LB222360
                MOVE "F4-S-CSR" TO TEST-ID                              LB222370
                MOVE F4-S-CSR TO SENT-VAL                               LB222380
                MOVE F4-R-B TO RCVD-VAL                                 LB222390
                ADD 1 TO FAIL-COUNT                                     LB222400
                PERFORM PRINT-ERRS THRU PR-OUT                          LB222410
            ELSE                                                        LB222420
              ADD 1 TO PASS-COUNT.                                      LB222430
                                                                        LB222440
            MOVE SEND-DATA TO F4-S-C4SD                                 LB222450
            MOVE G4-S-C4SD TO G4-R-B.                                   LB222460
            IF F4-S-C4SD NOT = F4-R-B                                   LB222470
                MOVE "F4-S-C4SD" TO TEST-ID                             LB222480
                MOVE F4-S-C4SD TO SENT-VAL                              LB222490
                MOVE F4-R-B TO RCVD-VAL                                 LB222500
                ADD 1 TO FAIL-COUNT                                     LB222510
                PERFORM PRINT-ERRS THRU PR-OUT                          LB222520
            ELSE                                                        LB222530
              ADD 1 TO PASS-COUNT.                                      LB222540
                                                                        LB222550
            MOVE SEND-DATA TO F4-S-C4SDL                                LB222560
            MOVE G4-S-C4SDL TO G4-R-B.                                  LB222570
            IF F4-S-C4SDL NOT = F4-R-B                                  LB222580
                MOVE "F4-S-C4SDL" TO TEST-ID                            LB222590
                MOVE F4-S-C4SDL TO SENT-VAL                             LB222600
                MOVE F4-R-B TO RCVD-VAL                                 LB222610
                ADD 1 TO FAIL-COUNT                                     LB222620
                PERFORM PRINT-ERRS THRU PR-OUT                          LB222630
            ELSE                                                        LB222640
              ADD 1 TO PASS-COUNT.                                      LB222650
                                                                        LB222660
            MOVE SEND-DATA TO F4-S-C4SDR                                LB222670
            MOVE G4-S-C4SDR TO G4-R-B.                                  LB222680
            IF F4-S-C4SDR NOT = F4-R-B                                  LB222690
                MOVE "F4-S-C4SDR" TO TEST-ID                            LB222700
                MOVE F4-S-C4SDR TO SENT-VAL                             LB222710
                MOVE F4-R-B TO RCVD-VAL                                 LB222720
                ADD 1 TO FAIL-COUNT                                     LB222730
                PERFORM PRINT-ERRS THRU PR-OUT                          LB222740
            ELSE                                                        LB222750
              ADD 1 TO PASS-COUNT.                                      LB222760
                                                                        LB222770
            MOVE SEND-DATA TO F4-S-C4S                                  LB222780
            MOVE G4-S-C4S TO G4-R-B.                                    LB222790
            IF F4-S-C4S NOT = F4-R-B                                    LB222800
                MOVE "F4-S-C4S" TO TEST-ID                              LB222810
                MOVE F4-S-C4S TO SENT-VAL                               LB222820
                MOVE F4-R-B TO RCVD-VAL                                 LB222830
                ADD 1 TO FAIL-COUNT                                     LB222840
                PERFORM PRINT-ERRS THRU PR-OUT                          LB222850
            ELSE                                                        LB222860
              ADD 1 TO PASS-COUNT.                                      LB222870
                                                                        LB222880
            MOVE SEND-DATA TO F4-S-C4SL                                 LB222890
            MOVE G4-S-C4SL TO G4-R-B.                                   LB222900
            IF F4-S-C4SL NOT = F4-R-B                                   LB222910
                MOVE "F4-S-C4SL" TO TEST-ID                             LB222920
                MOVE F4-S-C4SL TO SENT-VAL                              LB222930
                MOVE F4-R-B TO RCVD-VAL                                 LB222940
                ADD 1 TO FAIL-COUNT                                     LB222950
                PERFORM PRINT-ERRS THRU PR-OUT                          LB222960
            ELSE                                                        LB222970
              ADD 1 TO PASS-COUNT.                                      LB222980
                                                                        LB222990
            MOVE SEND-DATA TO F4-S-C4SR                                 LB223000
            MOVE G4-S-C4SR TO G4-R-B.                                   LB223010
            IF F4-S-C4SR NOT = F4-R-B                                   LB223020
                MOVE "F4-S-C4SR" TO TEST-ID                             LB223030
                MOVE F4-S-C4SR TO SENT-VAL                              LB223040
                MOVE F4-R-B TO RCVD-VAL                                 LB223050
                ADD 1 TO FAIL-COUNT                                     LB223060
                PERFORM PRINT-ERRS THRU PR-OUT                          LB223070
            ELSE                                                        LB223080
              ADD 1 TO PASS-COUNT.                                      LB223090
                                                                        LB223100
                                                                        LB223110
      **********************************************************        LB223120
      *                                                         *       LB223130
      *    MOVE 18 VARIATIONS OF 4 DIGIT FIELD TO A "comp-5"   *        LB223140
      *                  RECEIVING FIELD                        *       LB223150
      *                                                         *       LB223160
      **********************************************************        LB223170
                                                                        LB223180
            MOVE SEND-DATA TO F4-S-BSD                                  LB223190
            MOVE G4-S-BSD TO G4-R-C.                                    LB223200
            IF F4-S-BSD NOT = F4-R-C                                    LB223210
                MOVE "F4-S-BSD" TO TEST-ID                              LB223220
                MOVE F4-S-BSD TO SENT-VAL                               LB223230
                MOVE F4-R-C TO RCVD-VAL                                 LB223240
                ADD 1 TO FAIL-COUNT                                     LB223250
                PERFORM PRINT-ERRS THRU PR-OUT                          LB223260
            ELSE                                                        LB223270
              ADD 1 TO PASS-COUNT.                                      LB223280
                                                                        LB223290
            MOVE SEND-DATA TO F4-S-BSDL                                 LB223300
            MOVE G4-S-BSDL TO G4-R-C.                                   LB223310
            IF F4-S-BSDL NOT = F4-R-C                                   LB223320
                MOVE "F4-S-BSDL" TO TEST-ID                             LB223330
                MOVE F4-S-BSDL TO SENT-VAL                              LB223340
                MOVE F4-R-C TO RCVD-VAL                                 LB223350
                ADD 1 TO FAIL-COUNT                                     LB223360
                PERFORM PRINT-ERRS THRU PR-OUT                          LB223370
            ELSE                                                        LB223380
              ADD 1 TO PASS-COUNT.                                      LB223390
                                                                        LB223400
            MOVE SEND-DATA TO F4-S-BSDR                                 LB223410
            MOVE G4-S-BSDR TO G4-R-C.                                   LB223420
            IF F4-S-BSDR NOT = F4-R-C                                   LB223430
                MOVE "F4-S-BSDR" TO TEST-ID                             LB223440
                MOVE F4-S-BSDR TO SENT-VAL                              LB223450
                MOVE F4-R-C TO RCVD-VAL                                 LB223460
                ADD 1 TO FAIL-COUNT                                     LB223470
                PERFORM PRINT-ERRS THRU PR-OUT                          LB223480
            ELSE                                                        LB223490
              ADD 1 TO PASS-COUNT.                                      LB223500
                                                                        LB223510
            MOVE SEND-DATA TO F4-S-BS                                   LB223520
            MOVE G4-S-BS TO G4-R-C.                                     LB223530
            IF F4-S-BS NOT = F4-R-C                                     LB223540
                MOVE "F4-S-BS" TO TEST-ID                               LB223550
                MOVE F4-S-BS TO SENT-VAL                                LB223560
                MOVE F4-R-C TO RCVD-VAL                                 LB223570
                ADD 1 TO FAIL-COUNT                                     LB223580
                PERFORM PRINT-ERRS THRU PR-OUT                          LB223590
            ELSE                                                        LB223600
              ADD 1 TO PASS-COUNT.                                      LB223610
                                                                        LB223620
            MOVE SEND-DATA TO F4-S-BSL                                  LB223630
            MOVE G4-S-BSL TO G4-R-C.                                    LB223640
            IF F4-S-BSL NOT = F4-R-C                                    LB223650
                MOVE "F4-S-BSL" TO TEST-ID                              LB223660
                MOVE F4-S-BSL TO SENT-VAL                               LB223670
                MOVE F4-R-C TO RCVD-VAL                                 LB223680
                ADD 1 TO FAIL-COUNT                                     LB223690
                PERFORM PRINT-ERRS THRU PR-OUT                          LB223700
            ELSE                                                        LB223710
              ADD 1 TO PASS-COUNT.                                      LB223720
                                                                        LB223730
            MOVE SEND-DATA TO F4-S-BSR                                  LB223740
            MOVE G4-S-BSR TO G4-R-C.                                    LB223750
            IF F4-S-BSR NOT = F4-R-C                                    LB223760
                MOVE "F4-S-BSR" TO TEST-ID                              LB223770
                MOVE F4-S-BSR TO SENT-VAL                               LB223780
                MOVE F4-R-C TO RCVD-VAL                                 LB223790
                ADD 1 TO FAIL-COUNT                                     LB223800
                PERFORM PRINT-ERRS THRU PR-OUT                          LB223810
            ELSE                                                        LB223820
              ADD 1 TO PASS-COUNT.                                      LB223830
                                                                        LB223840
            MOVE SEND-DATA TO F4-S-CSD                                  LB223850
            MOVE G4-S-CSD TO G4-R-C.                                    LB223860
            IF F4-S-CSD NOT = F4-R-C                                    LB223870
                MOVE "F4-S-CSD" TO TEST-ID                              LB223880
                MOVE F4-S-CSD TO SENT-VAL                               LB223890
                MOVE F4-R-C TO RCVD-VAL                                 LB223900
                ADD 1 TO FAIL-COUNT                                     LB223910
                PERFORM PRINT-ERRS THRU PR-OUT                          LB223920
            ELSE                                                        LB223930
              ADD 1 TO PASS-COUNT.                                      LB223940
                                                                        LB223950
            MOVE SEND-DATA TO F4-S-CSDL                                 LB223960
            MOVE G4-S-CSDL TO G4-R-C.                                   LB223970
            IF F4-S-CSDL NOT = F4-R-C                                   LB223980
                MOVE "F4-S-CSDL" TO TEST-ID                             LB223990
                MOVE F4-S-CSDL TO SENT-VAL                              LB224000
                MOVE F4-R-C TO RCVD-VAL                                 LB224010
                ADD 1 TO FAIL-COUNT                                     LB224020
                PERFORM PRINT-ERRS THRU PR-OUT                          LB224030
            ELSE                                                        LB224040
              ADD 1 TO PASS-COUNT.                                      LB224050
                                                                        LB224060
            MOVE SEND-DATA TO F4-S-CSDR                                 LB224070
            MOVE G4-S-CSDR TO G4-R-C.                                   LB224080
            IF F4-S-CSDR NOT = F4-R-C                                   LB224090
                MOVE "F4-S-CSDR" TO TEST-ID                             LB224100
                MOVE F4-S-CSDR TO SENT-VAL                              LB224110
                MOVE F4-R-C TO RCVD-VAL                                 LB224120
                ADD 1 TO FAIL-COUNT                                     LB224130
                PERFORM PRINT-ERRS THRU PR-OUT                          LB224140
            ELSE                                                        LB224150
              ADD 1 TO PASS-COUNT.                                      LB224160
                                                                        LB224170
            MOVE SEND-DATA TO F4-S-CS                                   LB224180
            MOVE G4-S-CS TO G4-R-C.                                     LB224190
            IF F4-S-CS NOT = F4-R-C                                     LB224200
                MOVE "F4-S-CS" TO TEST-ID                               LB224210
                MOVE F4-S-CS TO SENT-VAL                                LB224220
                MOVE F4-R-C TO RCVD-VAL                                 LB224230
                ADD 1 TO FAIL-COUNT                                     LB224240
                PERFORM PRINT-ERRS THRU PR-OUT                          LB224250
            ELSE                                                        LB224260
              ADD 1 TO PASS-COUNT.                                      LB224270
                                                                        LB224280
            MOVE SEND-DATA TO F4-S-CSL                                  LB224290
            MOVE G4-S-CSL TO G4-R-C.                                    LB224300
            IF F4-S-CSL NOT = F4-R-C                                    LB224310
                MOVE "F4-S-CSL" TO TEST-ID                              LB224320
                MOVE F4-S-CSL TO SENT-VAL                               LB224330
                MOVE F4-R-C TO RCVD-VAL                                 LB224340
                ADD 1 TO FAIL-COUNT                                     LB224350
                PERFORM PRINT-ERRS THRU PR-OUT                          LB224360
            ELSE                                                        LB224370
              ADD 1 TO PASS-COUNT.                                      LB224380
                                                                        LB224390
            MOVE SEND-DATA TO F4-S-CSR                                  LB224400
            MOVE G4-S-CSR TO G4-R-C.                                    LB224410
            IF F4-S-CSR NOT = F4-R-C                                    LB224420
                MOVE "F4-S-CSR" TO TEST-ID                              LB224430
                MOVE F4-S-CSR TO SENT-VAL                               LB224440
                MOVE F4-R-C TO RCVD-VAL                                 LB224450
                ADD 1 TO FAIL-COUNT                                     LB224460
                PERFORM PRINT-ERRS THRU PR-OUT                          LB224470
            ELSE                                                        LB224480
              ADD 1 TO PASS-COUNT.                                      LB224490
                                                                        LB224500
            MOVE SEND-DATA TO F4-S-C4SD                                 LB224510
            MOVE G4-S-C4SD TO G4-R-C.                                   LB224520
            IF F4-S-C4SD NOT = F4-R-C                                   LB224530
                MOVE "F4-S-C4SD" TO TEST-ID                             LB224540
                MOVE F4-S-C4SD TO SENT-VAL                              LB224550
                MOVE F4-R-C TO RCVD-VAL                                 LB224560
                ADD 1 TO FAIL-COUNT                                     LB224570
                PERFORM PRINT-ERRS THRU PR-OUT                          LB224580
            ELSE                                                        LB224590
              ADD 1 TO PASS-COUNT.                                      LB224600
                                                                        LB224610
            MOVE SEND-DATA TO F4-S-C4SDL                                LB224620
            MOVE G4-S-C4SDL TO G4-R-C.                                  LB224630
            IF F4-S-C4SDL NOT = F4-R-C                                  LB224640
                MOVE "F4-S-C4SDL" TO TEST-ID                            LB224650
                MOVE F4-S-C4SDL TO SENT-VAL                             LB224660
                MOVE F4-R-C TO RCVD-VAL                                 LB224670
                ADD 1 TO FAIL-COUNT                                     LB224680
                PERFORM PRINT-ERRS THRU PR-OUT                          LB224690
            ELSE                                                        LB224700
              ADD 1 TO PASS-COUNT.                                      LB224710
                                                                        LB224720
            MOVE SEND-DATA TO F4-S-C4SDR                                LB224730
            MOVE G4-S-C4SDR TO G4-R-C.                                  LB224740
            IF F4-S-C4SDR NOT = F4-R-C                                  LB224750
                MOVE "F4-S-C4SDR" TO TEST-ID                            LB224760
                MOVE F4-S-C4SDR TO SENT-VAL                             LB224770
                MOVE F4-R-C TO RCVD-VAL                                 LB224780
                ADD 1 TO FAIL-COUNT                                     LB224790
                PERFORM PRINT-ERRS THRU PR-OUT                          LB224800
            ELSE                                                        LB224810
              ADD 1 TO PASS-COUNT.                                      LB224820
                                                                        LB224830
            MOVE SEND-DATA TO F4-S-C4S                                  LB224840
            MOVE G4-S-C4S TO G4-R-C.                                    LB224850
            IF F4-S-C4S NOT = F4-R-C                                    LB224860
                MOVE "F4-S-C4S" TO TEST-ID                              LB224870
                MOVE F4-S-C4S TO SENT-VAL                               LB224880
                MOVE F4-R-C TO RCVD-VAL                                 LB224890
                ADD 1 TO FAIL-COUNT                                     LB224900
                PERFORM PRINT-ERRS THRU PR-OUT                          LB224910
            ELSE                                                        LB224920
              ADD 1 TO PASS-COUNT.                                      LB224930
                                                                        LB224940
            MOVE SEND-DATA TO F4-S-C4SL                                 LB224950
            MOVE G4-S-C4SL TO G4-R-C.                                   LB224960
            IF F4-S-C4SL NOT = F4-R-C                                   LB224970
                MOVE "F4-S-C4SL" TO TEST-ID                             LB224980
                MOVE F4-S-C4SL TO SENT-VAL                              LB224990
                MOVE F4-R-C TO RCVD-VAL                                 LB225000
                ADD 1 TO FAIL-COUNT                                     LB225010
                PERFORM PRINT-ERRS THRU PR-OUT                          LB225020
            ELSE                                                        LB225030
              ADD 1 TO PASS-COUNT.                                      LB225040
                                                                        LB225050
            MOVE SEND-DATA TO F4-S-C4SR                                 LB225060
            MOVE G4-S-C4SR TO G4-R-C.                                   LB225070
            IF F4-S-C4SR NOT = F4-R-C                                   LB225080
                MOVE "F4-S-C4SR" TO TEST-ID                             LB225090
                MOVE F4-S-C4SR TO SENT-VAL                              LB225100
                MOVE F4-R-C TO RCVD-VAL                                 LB225110
                ADD 1 TO FAIL-COUNT                                     LB225120
                PERFORM PRINT-ERRS THRU PR-OUT                          LB225130
            ELSE                                                        LB225140
              ADD 1 TO PASS-COUNT.                                      LB225150
                                                                        LB225160
                                                                        LB225170
      **********************************************************        LB225180
      *                                                         *       LB225190
      *    MOVE 18 VARIATIONS OF 4 DIGIT FIELD TO A             *       LB225200
      *      "COMPUTATIONAL-5"  RECEIVING FIELD                 *       LB225210
      *                                                         *       LB225220
      **********************************************************        LB225230
                                                                        LB225240
            MOVE SEND-DATA TO F4-S-BSD                                  LB225250
            MOVE G4-S-BSD TO G4-R-C4.                                   LB225260
            IF F4-S-BSD NOT = F4-R-C4                                   LB225270
                MOVE "F4-S-BSD" TO TEST-ID                              LB225280
                MOVE F4-S-BSD TO SENT-VAL                               LB225290
                MOVE F4-R-C4 TO RCVD-VAL                                LB225300
                ADD 1 TO FAIL-COUNT                                     LB225310
                PERFORM PRINT-ERRS THRU PR-OUT                          LB225320
            ELSE                                                        LB225330
              ADD 1 TO PASS-COUNT.                                      LB225340
                                                                        LB225350
            MOVE SEND-DATA TO F4-S-BSDL                                 LB225360
            MOVE G4-S-BSDL TO G4-R-C4.                                  LB225370
            IF F4-S-BSDL NOT = F4-R-C4                                  LB225380
                MOVE "F4-S-BSDL" TO TEST-ID                             LB225390
                MOVE F4-S-BSDL TO SENT-VAL                              LB225400
                MOVE F4-R-C4 TO RCVD-VAL                                LB225410
                ADD 1 TO FAIL-COUNT                                     LB225420
                PERFORM PRINT-ERRS THRU PR-OUT                          LB225430
            ELSE                                                        LB225440
              ADD 1 TO PASS-COUNT.                                      LB225450
                                                                        LB225460
            MOVE SEND-DATA TO F4-S-BSDR                                 LB225470
            MOVE G4-S-BSDR TO G4-R-C4.                                  LB225480
            IF F4-S-BSDR NOT = F4-R-C4                                  LB225490
                MOVE "F4-S-BSDR" TO TEST-ID                             LB225500
                MOVE F4-S-BSDR TO SENT-VAL                              LB225510
                MOVE F4-R-C4 TO RCVD-VAL                                LB225520
                ADD 1 TO FAIL-COUNT                                     LB225530
                PERFORM PRINT-ERRS THRU PR-OUT                          LB225540
            ELSE                                                        LB225550
              ADD 1 TO PASS-COUNT.                                      LB225560
                                                                        LB225570
            MOVE SEND-DATA TO F4-S-BS                                   LB225580
            MOVE G4-S-BS TO G4-R-C4.                                    LB225590
            IF F4-S-BS NOT = F4-R-C4                                    LB225600
                MOVE "F4-S-BS" TO TEST-ID                               LB225610
                MOVE F4-S-BS TO SENT-VAL                                LB225620
                MOVE F4-R-C4 TO RCVD-VAL                                LB225630
                ADD 1 TO FAIL-COUNT                                     LB225640
                PERFORM PRINT-ERRS THRU PR-OUT                          LB225650
            ELSE                                                        LB225660
              ADD 1 TO PASS-COUNT.                                      LB225670
                                                                        LB225680
            MOVE SEND-DATA TO F4-S-BSL                                  LB225690
            MOVE G4-S-BSL TO G4-R-C4.                                   LB225700
            IF F4-S-BSL NOT = F4-R-C4                                   LB225710
                MOVE "F4-S-BSL" TO TEST-ID                              LB225720
                MOVE F4-S-BSL TO SENT-VAL                               LB225730
                MOVE F4-R-C4 TO RCVD-VAL                                LB225740
                ADD 1 TO FAIL-COUNT                                     LB225750
                PERFORM PRINT-ERRS THRU PR-OUT                          LB225760
            ELSE                                                        LB225770
              ADD 1 TO PASS-COUNT.                                      LB225780
                                                                        LB225790
            MOVE SEND-DATA TO F4-S-BSR                                  LB225800
            MOVE G4-S-BSR TO G4-R-C4.                                   LB225810
            IF F4-S-BSR NOT = F4-R-C4                                   LB225820
                MOVE "F4-S-BSR" TO TEST-ID                              LB225830
                MOVE F4-S-BSR TO SENT-VAL                               LB225840
                MOVE F4-R-C4 TO RCVD-VAL                                LB225850
                ADD 1 TO FAIL-COUNT                                     LB225860
                PERFORM PRINT-ERRS THRU PR-OUT                          LB225870
            ELSE                                                        LB225880
              ADD 1 TO PASS-COUNT.                                      LB225890
                                                                        LB225900
            MOVE SEND-DATA TO F4-S-CSD                                  LB225910
            MOVE G4-S-CSD TO G4-R-C4.                                   LB225920
            IF F4-S-CSD NOT = F4-R-C4                                   LB225930
                MOVE "F4-S-CSD" TO TEST-ID                              LB225940
                MOVE F4-S-CSD TO SENT-VAL                               LB225950
                MOVE F4-R-C4 TO RCVD-VAL                                LB225960
                ADD 1 TO FAIL-COUNT                                     LB225970
                PERFORM PRINT-ERRS THRU PR-OUT                          LB225980
            ELSE                                                        LB225990
              ADD 1 TO PASS-COUNT.                                      LB226000
                                                                        LB226010
            MOVE SEND-DATA TO F4-S-CSDL                                 LB226020
            MOVE G4-S-CSDL TO G4-R-C4.                                  LB226030
            IF F4-S-CSDL NOT = F4-R-C4                                  LB226040
                MOVE "F4-S-CSDL" TO TEST-ID                             LB226050
                MOVE F4-S-CSDL TO SENT-VAL                              LB226060
                MOVE F4-R-C4 TO RCVD-VAL                                LB226070
                ADD 1 TO FAIL-COUNT                                     LB226080
                PERFORM PRINT-ERRS THRU PR-OUT                          LB226090
            ELSE                                                        LB226100
              ADD 1 TO PASS-COUNT.                                      LB226110
                                                                        LB226120
            MOVE SEND-DATA TO F4-S-CSDR                                 LB226130
            MOVE G4-S-CSDR TO G4-R-C4.                                  LB226140
            IF F4-S-CSDR NOT = F4-R-C4                                  LB226150
                MOVE "F4-S-CSDR" TO TEST-ID                             LB226160
                MOVE F4-S-CSDR TO SENT-VAL                              LB226170
                MOVE F4-R-C4 TO RCVD-VAL                                LB226180
                ADD 1 TO FAIL-COUNT                                     LB226190
                PERFORM PRINT-ERRS THRU PR-OUT                          LB226200
            ELSE                                                        LB226210
              ADD 1 TO PASS-COUNT.                                      LB226220
                                                                        LB226230
            MOVE SEND-DATA TO F4-S-CS                                   LB226240
            MOVE G4-S-CS TO G4-R-C4.                                    LB226250
            IF F4-S-CS NOT = F4-R-C4                                    LB226260
                MOVE "F4-S-CS" TO TEST-ID                               LB226270
                MOVE F4-S-CS TO SENT-VAL                                LB226280
                MOVE F4-R-C4 TO RCVD-VAL                                LB226290
                ADD 1 TO FAIL-COUNT                                     LB226300
                PERFORM PRINT-ERRS THRU PR-OUT                          LB226310
            ELSE                                                        LB226320
              ADD 1 TO PASS-COUNT.                                      LB226330
                                                                        LB226340
            MOVE SEND-DATA TO F4-S-CSL                                  LB226350
            MOVE G4-S-CSL TO G4-R-C4.                                   LB226360
            IF F4-S-CSL NOT = F4-R-C4                                   LB226370
                MOVE "F4-S-CSL" TO TEST-ID                              LB226380
                MOVE F4-S-CSL TO SENT-VAL                               LB226390
                MOVE F4-R-C4 TO RCVD-VAL                                LB226400
                ADD 1 TO FAIL-COUNT                                     LB226410
                PERFORM PRINT-ERRS THRU PR-OUT                          LB226420
            ELSE                                                        LB226430
              ADD 1 TO PASS-COUNT.                                      LB226440
                                                                        LB226450
            MOVE SEND-DATA TO F4-S-CSR                                  LB226460
            MOVE G4-S-CSR TO G4-R-C4.                                   LB226470
            IF F4-S-CSR NOT = F4-R-C4                                   LB226480
                MOVE "F4-S-CSR" TO TEST-ID                              LB226490
                MOVE F4-S-CSR TO SENT-VAL                               LB226500
                MOVE F4-R-C4 TO RCVD-VAL                                LB226510
                ADD 1 TO FAIL-COUNT                                     LB226520
                PERFORM PRINT-ERRS THRU PR-OUT                          LB226530
            ELSE                                                        LB226540
              ADD 1 TO PASS-COUNT.                                      LB226550
                                                                        LB226560
            MOVE SEND-DATA TO F4-S-C4SD                                 LB226570
            MOVE G4-S-C4SD TO G4-R-C4.                                  LB226580
            IF F4-S-C4SD NOT = F4-R-C4                                  LB226590
                MOVE "F4-S-C4SD" TO TEST-ID                             LB226600
                MOVE F4-S-C4SD TO SENT-VAL                              LB226610
                MOVE F4-R-C4 TO RCVD-VAL                                LB226620
                ADD 1 TO FAIL-COUNT                                     LB226630
                PERFORM PRINT-ERRS THRU PR-OUT                          LB226640
            ELSE                                                        LB226650
              ADD 1 TO PASS-COUNT.                                      LB226660
                                                                        LB226670
            MOVE SEND-DATA TO F4-S-C4SDL                                LB226680
            MOVE G4-S-C4SDL TO G4-R-C4.                                 LB226690
            IF F4-S-C4SDL NOT = F4-R-C4                                 LB226700
                MOVE "F4-S-C4SDL" TO TEST-ID                            LB226710
                MOVE F4-S-C4SDL TO SENT-VAL                             LB226720
                MOVE F4-R-C4 TO RCVD-VAL                                LB226730
                ADD 1 TO FAIL-COUNT                                     LB226740
                PERFORM PRINT-ERRS THRU PR-OUT                          LB226750
            ELSE                                                        LB226760
              ADD 1 TO PASS-COUNT.                                      LB226770
                                                                        LB226780
            MOVE SEND-DATA TO F4-S-C4SDR                                LB226790
            MOVE G4-S-C4SDR TO G4-R-C4.                                 LB226800
            IF F4-S-C4SDR NOT = F4-R-C4                                 LB226810
                MOVE "F4-S-C4SDR" TO TEST-ID                            LB226820
                MOVE F4-S-C4SDR TO SENT-VAL                             LB226830
                MOVE F4-R-C4 TO RCVD-VAL                                LB226840
                ADD 1 TO FAIL-COUNT                                     LB226850
                PERFORM PRINT-ERRS THRU PR-OUT                          LB226860
            ELSE                                                        LB226870
              ADD 1 TO PASS-COUNT.                                      LB226880
                                                                        LB226890
            MOVE SEND-DATA TO F4-S-C4S                                  LB226900
            MOVE G4-S-C4S TO G4-R-C4.                                   LB226910
            IF F4-S-C4S NOT = F4-R-C4                                   LB226920
                MOVE "F4-S-C4S" TO TEST-ID                              LB226930
                MOVE F4-S-C4S TO SENT-VAL                               LB226940
                MOVE F4-R-C4 TO RCVD-VAL                                LB226950
                ADD 1 TO FAIL-COUNT                                     LB226960
                PERFORM PRINT-ERRS THRU PR-OUT                          LB226970
            ELSE                                                        LB226980
              ADD 1 TO PASS-COUNT.                                      LB226990
                                                                        LB227000
            MOVE SEND-DATA TO F4-S-C4SL                                 LB227010
            MOVE G4-S-C4SL TO G4-R-C4.                                  LB227020
            IF F4-S-C4SL NOT = F4-R-C4                                  LB227030
                MOVE "F4-S-C4SL" TO TEST-ID                             LB227040
                MOVE F4-S-C4SL TO SENT-VAL                              LB227050
                MOVE F4-R-C4 TO RCVD-VAL                                LB227060
                ADD 1 TO FAIL-COUNT                                     LB227070
                PERFORM PRINT-ERRS THRU PR-OUT                          LB227080
            ELSE                                                        LB227090
              ADD 1 TO PASS-COUNT.                                      LB227100
                                                                        LB227110
            MOVE SEND-DATA TO F4-S-C4SR                                 LB227120
            MOVE G4-S-C4SR TO G4-R-C4.                                  LB227130
            IF F4-S-C4SR NOT = F4-R-C4                                  LB227140
                MOVE "F4-S-C4SR" TO TEST-ID                             LB227150
                MOVE F4-S-C4SR TO SENT-VAL                              LB227160
                MOVE F4-R-C4 TO RCVD-VAL                                LB227170
                ADD 1 TO FAIL-COUNT                                     LB227180
                PERFORM PRINT-ERRS THRU PR-OUT                          LB227190
            ELSE                                                        LB227200
              ADD 1 TO PASS-COUNT.                                      LB227210
                                                                        LB227220
                                                                        LB227230
      *********************************************************         LB227240
      *                                                        *        LB227250
      *    MOVE 18 VARIATIONS OF 5 DIGIT FIELD TO A " comp-5"   *       LB227260
      *                  RECEIVING FIELD                       *        LB227270
      *                                                        *        LB227280
      **********************************************************        LB227290
                                                                        LB227300
            MOVE SEND-DATA TO F5-S-BSD                                  LB227310
            MOVE G5-S-BSD TO G5-R-B.                                    LB227320
            IF F5-S-BSD NOT = F5-R-B                                    LB227330
                MOVE "F5-S-BSD" TO TEST-ID                              LB227340
                MOVE F5-S-BSD TO SENT-VAL                               LB227350
                MOVE F5-R-B TO RCVD-VAL                                 LB227360
                ADD 1 TO FAIL-COUNT                                     LB227370
                PERFORM PRINT-ERRS THRU PR-OUT                          LB227380
            ELSE                                                        LB227390
              ADD 1 TO PASS-COUNT.                                      LB227400
                                                                        LB227410
            MOVE SEND-DATA TO F5-S-BSDL                                 LB227420
            MOVE G5-S-BSDL TO G5-R-B.                                   LB227430
            IF F5-S-BSDL NOT = F5-R-B                                   LB227440
                MOVE "F5-S-BSDL" TO TEST-ID                             LB227450
                MOVE F5-S-BSDL TO SENT-VAL                              LB227460
                MOVE F5-R-B TO RCVD-VAL                                 LB227470
                ADD 1 TO FAIL-COUNT                                     LB227480
                PERFORM PRINT-ERRS THRU PR-OUT                          LB227490
            ELSE                                                        LB227500
              ADD 1 TO PASS-COUNT.                                      LB227510
                                                                        LB227520
            MOVE SEND-DATA TO F5-S-BSDR                                 LB227530
            MOVE G5-S-BSDR TO G5-R-B.                                   LB227540
            IF F5-S-BSDR NOT = F5-R-B                                   LB227550
                MOVE "F5-S-BSDR" TO TEST-ID                             LB227560
                MOVE F5-S-BSDR TO SENT-VAL                              LB227570
                MOVE F5-R-B TO RCVD-VAL                                 LB227580
                ADD 1 TO FAIL-COUNT                                     LB227590
                PERFORM PRINT-ERRS THRU PR-OUT                          LB227600
            ELSE                                                        LB227610
              ADD 1 TO PASS-COUNT.                                      LB227620
                                                                        LB227630
            MOVE SEND-DATA TO F5-S-BS                                   LB227640
            MOVE G5-S-BS TO G5-R-B.                                     LB227650
            IF F5-S-BS NOT = F5-R-B                                     LB227660
                MOVE "F5-S-BS" TO TEST-ID                               LB227670
                MOVE F5-S-BS TO SENT-VAL                                LB227680
                MOVE F5-R-B TO RCVD-VAL                                 LB227690
                ADD 1 TO FAIL-COUNT                                     LB227700
                PERFORM PRINT-ERRS THRU PR-OUT                          LB227710
            ELSE                                                        LB227720
              ADD 1 TO PASS-COUNT.                                      LB227730
                                                                        LB227740
            MOVE SEND-DATA TO F5-S-BSL                                  LB227750
            MOVE G5-S-BSL TO G5-R-B.                                    LB227760
            IF F5-S-BSL NOT = F5-R-B                                    LB227770
                MOVE "F5-S-BSL" TO TEST-ID                              LB227780
                MOVE F5-S-BSL TO SENT-VAL                               LB227790
                MOVE F5-R-B TO RCVD-VAL                                 LB227800
                ADD 1 TO FAIL-COUNT                                     LB227810
                PERFORM PRINT-ERRS THRU PR-OUT                          LB227820
            ELSE                                                        LB227830
              ADD 1 TO PASS-COUNT.                                      LB227840
                                                                        LB227850
            MOVE SEND-DATA TO F5-S-BSR                                  LB227860
            MOVE G5-S-BSR TO G5-R-B.                                    LB227870
            IF F5-S-BSR NOT = F5-R-B                                    LB227880
                MOVE "F5-S-BSR" TO TEST-ID                              LB227890
                MOVE F5-S-BSR TO SENT-VAL                               LB227900
                MOVE F5-R-B TO RCVD-VAL                                 LB227910
                ADD 1 TO FAIL-COUNT                                     LB227920
                PERFORM PRINT-ERRS THRU PR-OUT                          LB227930
            ELSE                                                        LB227940
              ADD 1 TO PASS-COUNT.                                      LB227950
                                                                        LB227960
            MOVE SEND-DATA TO F5-S-CSD                                  LB227970
            MOVE G5-S-CSD TO G5-R-B.                                    LB227980
            IF F5-S-CSD NOT = F5-R-B                                    LB227990
                MOVE "F5-S-CSD" TO TEST-ID                              LB228000
                MOVE F5-S-CSD TO SENT-VAL                               LB228010
                MOVE F5-R-B TO RCVD-VAL                                 LB228020
                ADD 1 TO FAIL-COUNT                                     LB228030
                PERFORM PRINT-ERRS THRU PR-OUT                          LB228040
            ELSE                                                        LB228050
              ADD 1 TO PASS-COUNT.                                      LB228060
                                                                        LB228070
            MOVE SEND-DATA TO F5-S-CSDL                                 LB228080
            MOVE G5-S-CSDL TO G5-R-B.                                   LB228090
            IF F5-S-CSDL NOT = F5-R-B                                   LB228100
                MOVE "F5-S-CSDL" TO TEST-ID                             LB228110
                MOVE F5-S-CSDL TO SENT-VAL                              LB228120
                MOVE F5-R-B TO RCVD-VAL                                 LB228130
                ADD 1 TO FAIL-COUNT                                     LB228140
                PERFORM PRINT-ERRS THRU PR-OUT                          LB228150
            ELSE                                                        LB228160
              ADD 1 TO PASS-COUNT.                                      LB228170
                                                                        LB228180
            MOVE SEND-DATA TO F5-S-CSDR                                 LB228190
            MOVE G5-S-CSDR TO G5-R-B.                                   LB228200
            IF F5-S-CSDR NOT = F5-R-B                                   LB228210
                MOVE "F5-S-CSDR" TO TEST-ID                             LB228220
                MOVE F5-S-CSDR TO SENT-VAL                              LB228230
                MOVE F5-R-B TO RCVD-VAL                                 LB228240
                ADD 1 TO FAIL-COUNT                                     LB228250
                PERFORM PRINT-ERRS THRU PR-OUT                          LB228260
            ELSE                                                        LB228270
              ADD 1 TO PASS-COUNT.                                      LB228280
                                                                        LB228290
            MOVE SEND-DATA TO F5-S-CS                                   LB228300
            MOVE G5-S-CS TO G5-R-B.                                     LB228310
            IF F5-S-CS NOT = F5-R-B                                     LB228320
                MOVE "F5-S-CS" TO TEST-ID                               LB228330
                MOVE F5-S-CS TO SENT-VAL                                LB228340
                MOVE F5-R-B TO RCVD-VAL                                 LB228350
                ADD 1 TO FAIL-COUNT                                     LB228360
                PERFORM PRINT-ERRS THRU PR-OUT                          LB228370
            ELSE                                                        LB228380
              ADD 1 TO PASS-COUNT.                                      LB228390
                                                                        LB228400
            MOVE SEND-DATA TO F5-S-CSL                                  LB228410
            MOVE G5-S-CSL TO G5-R-B.                                    LB228420
            IF F5-S-CSL NOT = F5-R-B                                    LB228430
                MOVE "F5-S-CSL" TO TEST-ID                              LB228440
                MOVE F5-S-CSL TO SENT-VAL                               LB228450
                MOVE F5-R-B TO RCVD-VAL                                 LB228460
                ADD 1 TO FAIL-COUNT                                     LB228470
                PERFORM PRINT-ERRS THRU PR-OUT                          LB228480
            ELSE                                                        LB228490
              ADD 1 TO PASS-COUNT.                                      LB228500
                                                                        LB228510
            MOVE SEND-DATA TO F5-S-CSR                                  LB228520
            MOVE G5-S-CSR TO G5-R-B.                                    LB228530
            IF F5-S-CSR NOT = F5-R-B                                    LB228540
                MOVE "F5-S-CSR" TO TEST-ID                              LB228550
                MOVE F5-S-CSR TO SENT-VAL                               LB228560
                MOVE F5-R-B TO RCVD-VAL                                 LB228570
                ADD 1 TO FAIL-COUNT                                     LB228580
                PERFORM PRINT-ERRS THRU PR-OUT                          LB228590
            ELSE                                                        LB228600
              ADD 1 TO PASS-COUNT.                                      LB228610
                                                                        LB228620
            MOVE SEND-DATA TO F5-S-C4SD                                 LB228630
            MOVE G5-S-C4SD TO G5-R-B.                                   LB228640
            IF F5-S-C4SD NOT = F5-R-B                                   LB228650
                MOVE "F5-S-C4SD" TO TEST-ID                             LB228660
                MOVE F5-S-C4SD TO SENT-VAL                              LB228670
                MOVE F5-R-B TO RCVD-VAL                                 LB228680
                ADD 1 TO FAIL-COUNT                                     LB228690
                PERFORM PRINT-ERRS THRU PR-OUT                          LB228700
            ELSE                                                        LB228710
              ADD 1 TO PASS-COUNT.                                      LB228720
                                                                        LB228730
            MOVE SEND-DATA TO F5-S-C4SDL                                LB228740
            MOVE G5-S-C4SDL TO G5-R-B.                                  LB228750
            IF F5-S-C4SDL NOT = F5-R-B                                  LB228760
                MOVE "F5-S-C4SDL" TO TEST-ID                            LB228770
                MOVE F5-S-C4SDL TO SENT-VAL                             LB228780
                MOVE F5-R-B TO RCVD-VAL                                 LB228790
                ADD 1 TO FAIL-COUNT                                     LB228800
                PERFORM PRINT-ERRS THRU PR-OUT                          LB228810
            ELSE                                                        LB228820
              ADD 1 TO PASS-COUNT.                                      LB228830
                                                                        LB228840
            MOVE SEND-DATA TO F5-S-C4SDR                                LB228850
            MOVE G5-S-C4SDR TO G5-R-B.                                  LB228860
            IF F5-S-C4SDR NOT = F5-R-B                                  LB228870
                MOVE "F5-S-C4SDR" TO TEST-ID                            LB228880
                MOVE F5-S-C4SDR TO SENT-VAL                             LB228890
                MOVE F5-R-B TO RCVD-VAL                                 LB228900
                ADD 1 TO FAIL-COUNT                                     LB228910
                PERFORM PRINT-ERRS THRU PR-OUT                          LB228920
            ELSE                                                        LB228930
              ADD 1 TO PASS-COUNT.                                      LB228940
                                                                        LB228950
            MOVE SEND-DATA TO F5-S-C4S                                  LB228960
            MOVE G5-S-C4S TO G5-R-B.                                    LB228970
            IF F5-S-C4S NOT = F5-R-B                                    LB228980
                MOVE "F5-S-C4S" TO TEST-ID                              LB228990
                MOVE F5-S-C4S TO SENT-VAL                               LB229000
                MOVE F5-R-B TO RCVD-VAL                                 LB229010
                ADD 1 TO FAIL-COUNT                                     LB229020
                PERFORM PRINT-ERRS THRU PR-OUT                          LB229030
            ELSE                                                        LB229040
              ADD 1 TO PASS-COUNT.                                      LB229050
                                                                        LB229060
            MOVE SEND-DATA TO F5-S-C4SL                                 LB229070
            MOVE G5-S-C4SL TO G5-R-B.                                   LB229080
            IF F5-S-C4SL NOT = F5-R-B                                   LB229090
                MOVE "F5-S-C4SL" TO TEST-ID                             LB229100
                MOVE F5-S-C4SL TO SENT-VAL                              LB229110
                MOVE F5-R-B TO RCVD-VAL                                 LB229120
                ADD 1 TO FAIL-COUNT                                     LB229130
                PERFORM PRINT-ERRS THRU PR-OUT                          LB229140
            ELSE                                                        LB229150
              ADD 1 TO PASS-COUNT.                                      LB229160
                                                                        LB229170
            MOVE SEND-DATA TO F5-S-C4SR                                 LB229180
            MOVE G5-S-C4SR TO G5-R-B.                                   LB229190
            IF F5-S-C4SR NOT = F5-R-B                                   LB229200
                MOVE "F5-S-C4SR" TO TEST-ID                             LB229210
                MOVE F5-S-C4SR TO SENT-VAL                              LB229220
                MOVE F5-R-B TO RCVD-VAL                                 LB229230
                ADD 1 TO FAIL-COUNT                                     LB229240
                PERFORM PRINT-ERRS THRU PR-OUT                          LB229250
            ELSE                                                        LB229260
              ADD 1 TO PASS-COUNT.                                      LB229270
                                                                        LB229280
                                                                        LB229290
      **********************************************************        LB229300
      *                                                         *       LB229310
      *    MOVE 18 VARIATIONS OF 5 DIGIT FIELD TO A "comp-5"   *        LB229320
      *                  RECEIVING FIELD                        *       LB229330
      *                                                         *       LB229340
      **********************************************************        LB229350
                                                                        LB229360
            MOVE SEND-DATA TO F5-S-BSD                                  LB229370
            MOVE G5-S-BSD TO G5-R-C.                                    LB229380
            IF F5-S-BSD NOT = F5-R-C                                    LB229390
                MOVE "F5-S-BSD" TO TEST-ID                              LB229400
                MOVE F5-S-BSD TO SENT-VAL                               LB229410
                MOVE F5-R-C TO RCVD-VAL                                 LB229420
                ADD 1 TO FAIL-COUNT                                     LB229430
                PERFORM PRINT-ERRS THRU PR-OUT                          LB229440
            ELSE                                                        LB229450
              ADD 1 TO PASS-COUNT.                                      LB229460
                                                                        LB229470
            MOVE SEND-DATA TO F5-S-BSDL                                 LB229480
            MOVE G5-S-BSDL TO G5-R-C.                                   LB229490
            IF F5-S-BSDL NOT = F5-R-C                                   LB229500
                MOVE "F5-S-BSDL" TO TEST-ID                             LB229510
                MOVE F5-S-BSDL TO SENT-VAL                              LB229520
                MOVE F5-R-C TO RCVD-VAL                                 LB229530
                ADD 1 TO FAIL-COUNT                                     LB229540
                PERFORM PRINT-ERRS THRU PR-OUT                          LB229550
            ELSE                                                        LB229560
              ADD 1 TO PASS-COUNT.                                      LB229570
                                                                        LB229580
            MOVE SEND-DATA TO F5-S-BSDR                                 LB229590
            MOVE G5-S-BSDR TO G5-R-C.                                   LB229600
            IF F5-S-BSDR NOT = F5-R-C                                   LB229610
                MOVE "F5-S-BSDR" TO TEST-ID                             LB229620
                MOVE F5-S-BSDR TO SENT-VAL                              LB229630
                MOVE F5-R-C TO RCVD-VAL                                 LB229640
                ADD 1 TO FAIL-COUNT                                     LB229650
                PERFORM PRINT-ERRS THRU PR-OUT                          LB229660
            ELSE                                                        LB229670
              ADD 1 TO PASS-COUNT.                                      LB229680
                                                                        LB229690
            MOVE SEND-DATA TO F5-S-BS                                   LB229700
            MOVE G5-S-BS TO G5-R-C.                                     LB229710
            IF F5-S-BS NOT = F5-R-C                                     LB229720
                MOVE "F5-S-BS" TO TEST-ID                               LB229730
                MOVE F5-S-BS TO SENT-VAL                                LB229740
                MOVE F5-R-C TO RCVD-VAL                                 LB229750
                ADD 1 TO FAIL-COUNT                                     LB229760
                PERFORM PRINT-ERRS THRU PR-OUT                          LB229770
            ELSE                                                        LB229780
              ADD 1 TO PASS-COUNT.                                      LB229790
                                                                        LB229800
            MOVE SEND-DATA TO F5-S-BSL                                  LB229810
            MOVE G5-S-BSL TO G5-R-C.                                    LB229820
            IF F5-S-BSL NOT = F5-R-C                                    LB229830
                MOVE "F5-S-BSL" TO TEST-ID                              LB229840
                MOVE F5-S-BSL TO SENT-VAL                               LB229850
                MOVE F5-R-C TO RCVD-VAL                                 LB229860
                ADD 1 TO FAIL-COUNT                                     LB229870
                PERFORM PRINT-ERRS THRU PR-OUT                          LB229880
            ELSE                                                        LB229890
              ADD 1 TO PASS-COUNT.                                      LB229900
                                                                        LB229910
            MOVE SEND-DATA TO F5-S-BSR                                  LB229920
            MOVE G5-S-BSR TO G5-R-C.                                    LB229930
            IF F5-S-BSR NOT = F5-R-C                                    LB229940
                MOVE "F5-S-BSR" TO TEST-ID                              LB229950
                MOVE F5-S-BSR TO SENT-VAL                               LB229960
                MOVE F5-R-C TO RCVD-VAL                                 LB229970
                ADD 1 TO FAIL-COUNT                                     LB229980
                PERFORM PRINT-ERRS THRU PR-OUT                          LB229990
            ELSE                                                        LB230000
              ADD 1 TO PASS-COUNT.                                      LB230010
                                                                        LB230020
            MOVE SEND-DATA TO F5-S-CSD                                  LB230030
            MOVE G5-S-CSD TO G5-R-C.                                    LB230040
            IF F5-S-CSD NOT = F5-R-C                                    LB230050
                MOVE "F5-S-CSD" TO TEST-ID                              LB230060
                MOVE F5-S-CSD TO SENT-VAL                               LB230070
                MOVE F5-R-C TO RCVD-VAL                                 LB230080
                ADD 1 TO FAIL-COUNT                                     LB230090
                PERFORM PRINT-ERRS THRU PR-OUT                          LB230100
            ELSE                                                        LB230110
              ADD 1 TO PASS-COUNT.                                      LB230120
                                                                        LB230130
            MOVE SEND-DATA TO F5-S-CSDL                                 LB230140
            MOVE G5-S-CSDL TO G5-R-C.                                   LB230150
            IF F5-S-CSDL NOT = F5-R-C                                   LB230160
                MOVE "F5-S-CSDL" TO TEST-ID                             LB230170
                MOVE F5-S-CSDL TO SENT-VAL                              LB230180
                MOVE F5-R-C TO RCVD-VAL                                 LB230190
                ADD 1 TO FAIL-COUNT                                     LB230200
                PERFORM PRINT-ERRS THRU PR-OUT                          LB230210
            ELSE                                                        LB230220
              ADD 1 TO PASS-COUNT.                                      LB230230
                                                                        LB230240
            MOVE SEND-DATA TO F5-S-CSDR                                 LB230250
            MOVE G5-S-CSDR TO G5-R-C.                                   LB230260
            IF F5-S-CSDR NOT = F5-R-C                                   LB230270
                MOVE "F5-S-CSDR" TO TEST-ID                             LB230280
                MOVE F5-S-CSDR TO SENT-VAL                              LB230290
                MOVE F5-R-C TO RCVD-VAL                                 LB230300
                ADD 1 TO FAIL-COUNT                                     LB230310
                PERFORM PRINT-ERRS THRU PR-OUT                          LB230320
            ELSE                                                        LB230330
              ADD 1 TO PASS-COUNT.                                      LB230340
                                                                        LB230350
            MOVE SEND-DATA TO F5-S-CS                                   LB230360
            MOVE G5-S-CS TO G5-R-C.                                     LB230370
            IF F5-S-CS NOT = F5-R-C                                     LB230380
                MOVE "F5-S-CS" TO TEST-ID                               LB230390
                MOVE F5-S-CS TO SENT-VAL                                LB230400
                MOVE F5-R-C TO RCVD-VAL                                 LB230410
                ADD 1 TO FAIL-COUNT                                     LB230420
                PERFORM PRINT-ERRS THRU PR-OUT                          LB230430
            ELSE                                                        LB230440
              ADD 1 TO PASS-COUNT.                                      LB230450
                                                                        LB230460
            MOVE SEND-DATA TO F5-S-CSL                                  LB230470
            MOVE G5-S-CSL TO G5-R-C.                                    LB230480
            IF F5-S-CSL NOT = F5-R-C                                    LB230490
                MOVE "F5-S-CSL" TO TEST-ID                              LB230500
                MOVE F5-S-CSL TO SENT-VAL                               LB230510
                MOVE F5-R-C TO RCVD-VAL                                 LB230520
                ADD 1 TO FAIL-COUNT                                     LB230530
                PERFORM PRINT-ERRS THRU PR-OUT                          LB230540
            ELSE                                                        LB230550
              ADD 1 TO PASS-COUNT.                                      LB230560
                                                                        LB230570
            MOVE SEND-DATA TO F5-S-CSR                                  LB230580
            MOVE G5-S-CSR TO G5-R-C.                                    LB230590
            IF F5-S-CSR NOT = F5-R-C                                    LB230600
                MOVE "F5-S-CSR" TO TEST-ID                              LB230610
                MOVE F5-S-CSR TO SENT-VAL                               LB230620
                MOVE F5-R-C TO RCVD-VAL                                 LB230630
                ADD 1 TO FAIL-COUNT                                     LB230640
                PERFORM PRINT-ERRS THRU PR-OUT                          LB230650
            ELSE                                                        LB230660
              ADD 1 TO PASS-COUNT.                                      LB230670
                                                                        LB230680
            MOVE SEND-DATA TO F5-S-C4SD                                 LB230690
            MOVE G5-S-C4SD TO G5-R-C.                                   LB230700
            IF F5-S-C4SD NOT = F5-R-C                                   LB230710
                MOVE "F5-S-C4SD" TO TEST-ID                             LB230720
                MOVE F5-S-C4SD TO SENT-VAL                              LB230730
                MOVE F5-R-C TO RCVD-VAL                                 LB230740
                ADD 1 TO FAIL-COUNT                                     LB230750
                PERFORM PRINT-ERRS THRU PR-OUT                          LB230760
            ELSE                                                        LB230770
              ADD 1 TO PASS-COUNT.                                      LB230780
                                                                        LB230790
            MOVE SEND-DATA TO F5-S-C4SDL                                LB230800
            MOVE G5-S-C4SDL TO G5-R-C.                                  LB230810
            IF F5-S-C4SDL NOT = F5-R-C                                  LB230820
                MOVE "F5-S-C4SDL" TO TEST-ID                            LB230830
                MOVE F5-S-C4SDL TO SENT-VAL                             LB230840
                MOVE F5-R-C TO RCVD-VAL                                 LB230850
                ADD 1 TO FAIL-COUNT                                     LB230860
                PERFORM PRINT-ERRS THRU PR-OUT                          LB230870
            ELSE                                                        LB230880
              ADD 1 TO PASS-COUNT.                                      LB230890
                                                                        LB230900
            MOVE SEND-DATA TO F5-S-C4SDR                                LB230910
            MOVE G5-S-C4SDR TO G5-R-C.                                  LB230920
            IF F5-S-C4SDR NOT = F5-R-C                                  LB230930
                MOVE "F5-S-C4SDR" TO TEST-ID                            LB230940
                MOVE F5-S-C4SDR TO SENT-VAL                             LB230950
                MOVE F5-R-C TO RCVD-VAL                                 LB230960
                ADD 1 TO FAIL-COUNT                                     LB230970
                PERFORM PRINT-ERRS THRU PR-OUT                          LB230980
            ELSE                                                        LB230990
              ADD 1 TO PASS-COUNT.                                      LB231000
                                                                        LB231010
            MOVE SEND-DATA TO F5-S-C4S                                  LB231020
            MOVE G5-S-C4S TO G5-R-C.                                    LB231030
            IF F5-S-C4S NOT = F5-R-C                                    LB231040
                MOVE "F5-S-C4S" TO TEST-ID                              LB231050
                MOVE F5-S-C4S TO SENT-VAL                               LB231060
                MOVE F5-R-C TO RCVD-VAL                                 LB231070
                ADD 1 TO FAIL-COUNT                                     LB231080
                PERFORM PRINT-ERRS THRU PR-OUT                          LB231090
            ELSE                                                        LB231100
              ADD 1 TO PASS-COUNT.                                      LB231110
                                                                        LB231120
            MOVE SEND-DATA TO F5-S-C4SL                                 LB231130
            MOVE G5-S-C4SL TO G5-R-C.                                   LB231140
            IF F5-S-C4SL NOT = F5-R-C                                   LB231150
                MOVE "F5-S-C4SL" TO TEST-ID                             LB231160
                MOVE F5-S-C4SL TO SENT-VAL                              LB231170
                MOVE F5-R-C TO RCVD-VAL                                 LB231180
                ADD 1 TO FAIL-COUNT                                     LB231190
                PERFORM PRINT-ERRS THRU PR-OUT                          LB231200
            ELSE                                                        LB231210
              ADD 1 TO PASS-COUNT.                                      LB231220
                                                                        LB231230
            MOVE SEND-DATA TO F5-S-C4SR                                 LB231240
            MOVE G5-S-C4SR TO G5-R-C.                                   LB231250
            IF F5-S-C4SR NOT = F5-R-C                                   LB231260
                MOVE "F5-S-C4SR" TO TEST-ID                             LB231270
                MOVE F5-S-C4SR TO SENT-VAL                              LB231280
                MOVE F5-R-C TO RCVD-VAL                                 LB231290
                ADD 1 TO FAIL-COUNT                                     LB231300
                PERFORM PRINT-ERRS THRU PR-OUT                          LB231310
            ELSE                                                        LB231320
              ADD 1 TO PASS-COUNT.                                      LB231330
                                                                        LB231340
                                                                        LB231350
      **********************************************************        LB231360
      *                                                         *       LB231370
      *    MOVE 18 VARIATIONS OF 5 DIGIT FIELD TO A             *       LB231380
      *      "COMPUTATIONAL-5"  RECEIVING FIELD                 *       LB231390
      *                                                         *       LB231400
      **********************************************************        LB231410
                                                                        LB231420
            MOVE SEND-DATA TO F5-S-BSD                                  LB231430
            MOVE G5-S-BSD TO G5-R-C4.                                   LB231440
            IF F5-S-BSD NOT = F5-R-C4                                   LB231450
                MOVE "F5-S-BSD" TO TEST-ID                              LB231460
                MOVE F5-S-BSD TO SENT-VAL                               LB231470
                MOVE F5-R-C4 TO RCVD-VAL                                LB231480
                ADD 1 TO FAIL-COUNT                                     LB231490
                PERFORM PRINT-ERRS THRU PR-OUT                          LB231500
            ELSE                                                        LB231510
              ADD 1 TO PASS-COUNT.                                      LB231520
                                                                        LB231530
            MOVE SEND-DATA TO F5-S-BSDL                                 LB231540
            MOVE G5-S-BSDL TO G5-R-C4.                                  LB231550
            IF F5-S-BSDL NOT = F5-R-C4                                  LB231560
                MOVE "F5-S-BSDL" TO TEST-ID                             LB231570
                MOVE F5-S-BSDL TO SENT-VAL                              LB231580
                MOVE F5-R-C4 TO RCVD-VAL                                LB231590
                ADD 1 TO FAIL-COUNT                                     LB231600
                PERFORM PRINT-ERRS THRU PR-OUT                          LB231610
            ELSE                                                        LB231620
              ADD 1 TO PASS-COUNT.                                      LB231630
                                                                        LB231640
            MOVE SEND-DATA TO F5-S-BSDR                                 LB231650
            MOVE G5-S-BSDR TO G5-R-C4.                                  LB231660
            IF F5-S-BSDR NOT = F5-R-C4                                  LB231670
                MOVE "F5-S-BSDR" TO TEST-ID                             LB231680
                MOVE F5-S-BSDR TO SENT-VAL                              LB231690
                MOVE F5-R-C4 TO RCVD-VAL                                LB231700
                ADD 1 TO FAIL-COUNT                                     LB231710
                PERFORM PRINT-ERRS THRU PR-OUT                          LB231720
            ELSE                                                        LB231730
              ADD 1 TO PASS-COUNT.                                      LB231740
                                                                        LB231750
            MOVE SEND-DATA TO F5-S-BS                                   LB231760
            MOVE G5-S-BS TO G5-R-C4.                                    LB231770
            IF F5-S-BS NOT = F5-R-C4                                    LB231780
                MOVE "F5-S-BS" TO TEST-ID                               LB231790
                MOVE F5-S-BS TO SENT-VAL                                LB231800
                MOVE F5-R-C4 TO RCVD-VAL                                LB231810
                ADD 1 TO FAIL-COUNT                                     LB231820
                PERFORM PRINT-ERRS THRU PR-OUT                          LB231830
            ELSE                                                        LB231840
              ADD 1 TO PASS-COUNT.                                      LB231850
                                                                        LB231860
            MOVE SEND-DATA TO F5-S-BSL                                  LB231870
            MOVE G5-S-BSL TO G5-R-C4.                                   LB231880
            IF F5-S-BSL NOT = F5-R-C4                                   LB231890
                MOVE "F5-S-BSL" TO TEST-ID                              LB231900
                MOVE F5-S-BSL TO SENT-VAL                               LB231910
                MOVE F5-R-C4 TO RCVD-VAL                                LB231920
                ADD 1 TO FAIL-COUNT                                     LB231930
                PERFORM PRINT-ERRS THRU PR-OUT                          LB231940
            ELSE                                                        LB231950
              ADD 1 TO PASS-COUNT.                                      LB231960
                                                                        LB231970
            MOVE SEND-DATA TO F5-S-BSR                                  LB231980
            MOVE G5-S-BSR TO G5-R-C4.                                   LB231990
            IF F5-S-BSR NOT = F5-R-C4                                   LB232000
                MOVE "F5-S-BSR" TO TEST-ID                              LB232010
                MOVE F5-S-BSR TO SENT-VAL                               LB232020
                MOVE F5-R-C4 TO RCVD-VAL                                LB232030
                ADD 1 TO FAIL-COUNT                                     LB232040
                PERFORM PRINT-ERRS THRU PR-OUT                          LB232050
            ELSE                                                        LB232060
              ADD 1 TO PASS-COUNT.                                      LB232070
                                                                        LB232080
            MOVE SEND-DATA TO F5-S-CSD                                  LB232090
            MOVE G5-S-CSD TO G5-R-C4.                                   LB232100
            IF F5-S-CSD NOT = F5-R-C4                                   LB232110
                MOVE "F5-S-CSD" TO TEST-ID                              LB232120
                MOVE F5-S-CSD TO SENT-VAL                               LB232130
                MOVE F5-R-C4 TO RCVD-VAL                                LB232140
                ADD 1 TO FAIL-COUNT                                     LB232150
                PERFORM PRINT-ERRS THRU PR-OUT                          LB232160
            ELSE                                                        LB232170
              ADD 1 TO PASS-COUNT.                                      LB232180
                                                                        LB232190
            MOVE SEND-DATA TO F5-S-CSDL                                 LB232200
            MOVE G5-S-CSDL TO G5-R-C4.                                  LB232210
            IF F5-S-CSDL NOT = F5-R-C4                                  LB232220
                MOVE "F5-S-CSDL" TO TEST-ID                             LB232230
                MOVE F5-S-CSDL TO SENT-VAL                              LB232240
                MOVE F5-R-C4 TO RCVD-VAL                                LB232250
                ADD 1 TO FAIL-COUNT                                     LB232260
                PERFORM PRINT-ERRS THRU PR-OUT                          LB232270
            ELSE                                                        LB232280
              ADD 1 TO PASS-COUNT.                                      LB232290
                                                                        LB232300
            MOVE SEND-DATA TO F5-S-CSDR                                 LB232310
            MOVE G5-S-CSDR TO G5-R-C4.                                  LB232320
            IF F5-S-CSDR NOT = F5-R-C4                                  LB232330
                MOVE "F5-S-CSDR" TO TEST-ID                             LB232340
                MOVE F5-S-CSDR TO SENT-VAL                              LB232350
                MOVE F5-R-C4 TO RCVD-VAL                                LB232360
                ADD 1 TO FAIL-COUNT                                     LB232370
                PERFORM PRINT-ERRS THRU PR-OUT                          LB232380
            ELSE                                                        LB232390
              ADD 1 TO PASS-COUNT.                                      LB232400
                                                                        LB232410
            MOVE SEND-DATA TO F5-S-CS                                   LB232420
            MOVE G5-S-CS TO G5-R-C4.                                    LB232430
            IF F5-S-CS NOT = F5-R-C4                                    LB232440
                MOVE "F5-S-CS" TO TEST-ID                               LB232450
                MOVE F5-S-CS TO SENT-VAL                                LB232460
                MOVE F5-R-C4 TO RCVD-VAL                                LB232470
                ADD 1 TO FAIL-COUNT                                     LB232480
                PERFORM PRINT-ERRS THRU PR-OUT                          LB232490
            ELSE                                                        LB232500
              ADD 1 TO PASS-COUNT.                                      LB232510
                                                                        LB232520
            MOVE SEND-DATA TO F5-S-CSL                                  LB232530
            MOVE G5-S-CSL TO G5-R-C4.                                   LB232540
            IF F5-S-CSL NOT = F5-R-C4                                   LB232550
                MOVE "F5-S-CSL" TO TEST-ID                              LB232560
                MOVE F5-S-CSL TO SENT-VAL                               LB232570
                MOVE F5-R-C4 TO RCVD-VAL                                LB232580
                ADD 1 TO FAIL-COUNT                                     LB232590
                PERFORM PRINT-ERRS THRU PR-OUT                          LB232600
            ELSE                                                        LB232610
              ADD 1 TO PASS-COUNT.                                      LB232620
                                                                        LB232630
            MOVE SEND-DATA TO F5-S-CSR                                  LB232640
            MOVE G5-S-CSR TO G5-R-C4.                                   LB232650
            IF F5-S-CSR NOT = F5-R-C4                                   LB232660
                MOVE "F5-S-CSR" TO TEST-ID                              LB232670
                MOVE F5-S-CSR TO SENT-VAL                               LB232680
                MOVE F5-R-C4 TO RCVD-VAL                                LB232690
                ADD 1 TO FAIL-COUNT                                     LB232700
                PERFORM PRINT-ERRS THRU PR-OUT                          LB232710
            ELSE                                                        LB232720
              ADD 1 TO PASS-COUNT.                                      LB232730
                                                                        LB232740
            MOVE SEND-DATA TO F5-S-C4SD                                 LB232750
            MOVE G5-S-C4SD TO G5-R-C4.                                  LB232760
            IF F5-S-C4SD NOT = F5-R-C4                                  LB232770
                MOVE "F5-S-C4SD" TO TEST-ID                             LB232780
                MOVE F5-S-C4SD TO SENT-VAL                              LB232790
                MOVE F5-R-C4 TO RCVD-VAL                                LB232800
                ADD 1 TO FAIL-COUNT                                     LB232810
                PERFORM PRINT-ERRS THRU PR-OUT                          LB232820
            ELSE                                                        LB232830
              ADD 1 TO PASS-COUNT.                                      LB232840
                                                                        LB232850
            MOVE SEND-DATA TO F5-S-C4SDL                                LB232860
            MOVE G5-S-C4SDL TO G5-R-C4.                                 LB232870
            IF F5-S-C4SDL NOT = F5-R-C4                                 LB232880
                MOVE "F5-S-C4SDL" TO TEST-ID                            LB232890
                MOVE F5-S-C4SDL TO SENT-VAL                             LB232900
                MOVE F5-R-C4 TO RCVD-VAL                                LB232910
                ADD 1 TO FAIL-COUNT                                     LB232920
                PERFORM PRINT-ERRS THRU PR-OUT                          LB232930
            ELSE                                                        LB232940
              ADD 1 TO PASS-COUNT.                                      LB232950
                                                                        LB232960
            MOVE SEND-DATA TO F5-S-C4SDR                                LB232970
            MOVE G5-S-C4SDR TO G5-R-C4.                                 LB232980
            IF F5-S-C4SDR NOT = F5-R-C4                                 LB232990
                MOVE "F5-S-C4SDR" TO TEST-ID                            LB233000
                MOVE F5-S-C4SDR TO SENT-VAL                             LB233010
                MOVE F5-R-C4 TO RCVD-VAL                                LB233020
                ADD 1 TO FAIL-COUNT                                     LB233030
                PERFORM PRINT-ERRS THRU PR-OUT                          LB233040
            ELSE                                                        LB233050
              ADD 1 TO PASS-COUNT.                                      LB233060
                                                                        LB233070
            MOVE SEND-DATA TO F5-S-C4S                                  LB233080
            MOVE G5-S-C4S TO G5-R-C4.                                   LB233090
            IF F5-S-C4S NOT = F5-R-C4                                   LB233100
                MOVE "F5-S-C4S" TO TEST-ID                              LB233110
                MOVE F5-S-C4S TO SENT-VAL                               LB233120
                MOVE F5-R-C4 TO RCVD-VAL                                LB233130
                ADD 1 TO FAIL-COUNT                                     LB233140
                PERFORM PRINT-ERRS THRU PR-OUT                          LB233150
            ELSE                                                        LB233160
              ADD 1 TO PASS-COUNT.                                      LB233170
                                                                        LB233180
            MOVE SEND-DATA TO F5-S-C4SL                                 LB233190
            MOVE G5-S-C4SL TO G5-R-C4.                                  LB233200
            IF F5-S-C4SL NOT = F5-R-C4                                  LB233210
                MOVE "F5-S-C4SL" TO TEST-ID                             LB233220
                MOVE F5-S-C4SL TO SENT-VAL                              LB233230
                MOVE F5-R-C4 TO RCVD-VAL                                LB233240
                ADD 1 TO FAIL-COUNT                                     LB233250
                PERFORM PRINT-ERRS THRU PR-OUT                          LB233260
            ELSE                                                        LB233270
              ADD 1 TO PASS-COUNT.                                      LB233280
                                                                        LB233290
            MOVE SEND-DATA TO F5-S-C4SR                                 LB233300
            MOVE G5-S-C4SR TO G5-R-C4.                                  LB233310
            IF F5-S-C4SR NOT = F5-R-C4                                  LB233320
                MOVE "F5-S-C4SR" TO TEST-ID                             LB233330
                MOVE F5-S-C4SR TO SENT-VAL                              LB233340
                MOVE F5-R-C4 TO RCVD-VAL                                LB233350
                ADD 1 TO FAIL-COUNT                                     LB233360
                PERFORM PRINT-ERRS THRU PR-OUT                          LB233370
            ELSE                                                        LB233380
              ADD 1 TO PASS-COUNT.                                      LB233390
                                                                        LB233400
                                                                        LB233410
      *********************************************************         LB233420
      *                                                        *        LB233430
      *    MOVE 18 VARIATIONS OF 6 DIGIT FIELD TO A " comp-5"   *       LB233440
      *                  RECEIVING FIELD                       *        LB233450
      *                                                        *        LB233460
      **********************************************************        LB233470
                                                                        LB233480
            MOVE SEND-DATA TO F6-S-BSD                                  LB233490
            MOVE G6-S-BSD TO G6-R-B.                                    LB233500
            IF F6-S-BSD NOT = F6-R-B                                    LB233510
                MOVE "F6-S-BSD" TO TEST-ID                              LB233520
                MOVE F6-S-BSD TO SENT-VAL                               LB233530
                MOVE F6-R-B TO RCVD-VAL                                 LB233540
                ADD 1 TO FAIL-COUNT                                     LB233550
                PERFORM PRINT-ERRS THRU PR-OUT                          LB233560
            ELSE                                                        LB233570
              ADD 1 TO PASS-COUNT.                                      LB233580
                                                                        LB233590
            MOVE SEND-DATA TO F6-S-BSDL                                 LB233600
            MOVE G6-S-BSDL TO G6-R-B.                                   LB233610
            IF F6-S-BSDL NOT = F6-R-B                                   LB233620
                MOVE "F6-S-BSDL" TO TEST-ID                             LB233630
                MOVE F6-S-BSDL TO SENT-VAL                              LB233640
                MOVE F6-R-B TO RCVD-VAL                                 LB233650
                ADD 1 TO FAIL-COUNT                                     LB233660
                PERFORM PRINT-ERRS THRU PR-OUT                          LB233670
            ELSE                                                        LB233680
              ADD 1 TO PASS-COUNT.                                      LB233690
                                                                        LB233700
            MOVE SEND-DATA TO F6-S-BSDR                                 LB233710
            MOVE G6-S-BSDR TO G6-R-B.                                   LB233720
            IF F6-S-BSDR NOT = F6-R-B                                   LB233730
                MOVE "F6-S-BSDR" TO TEST-ID                             LB233740
                MOVE F6-S-BSDR TO SENT-VAL                              LB233750
                MOVE F6-R-B TO RCVD-VAL                                 LB233760
                ADD 1 TO FAIL-COUNT                                     LB233770
                PERFORM PRINT-ERRS THRU PR-OUT                          LB233780
            ELSE                                                        LB233790
              ADD 1 TO PASS-COUNT.                                      LB233800
                                                                        LB233810
            MOVE SEND-DATA TO F6-S-BS                                   LB233820
            MOVE G6-S-BS TO G6-R-B.                                     LB233830
            IF F6-S-BS NOT = F6-R-B                                     LB233840
                MOVE "F6-S-BS" TO TEST-ID                               LB233850
                MOVE F6-S-BS TO SENT-VAL                                LB233860
                MOVE F6-R-B TO RCVD-VAL                                 LB233870
                ADD 1 TO FAIL-COUNT                                     LB233880
                PERFORM PRINT-ERRS THRU PR-OUT                          LB233890
            ELSE                                                        LB233900
              ADD 1 TO PASS-COUNT.                                      LB233910
                                                                        LB233920
            MOVE SEND-DATA TO F6-S-BSL                                  LB233930
            MOVE G6-S-BSL TO G6-R-B.                                    LB233940
            IF F6-S-BSL NOT = F6-R-B                                    LB233950
                MOVE "F6-S-BSL" TO TEST-ID                              LB233960
                MOVE F6-S-BSL TO SENT-VAL                               LB233970
                MOVE F6-R-B TO RCVD-VAL                                 LB233980
                ADD 1 TO FAIL-COUNT                                     LB233990
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234000
            ELSE                                                        LB234010
              ADD 1 TO PASS-COUNT.                                      LB234020
                                                                        LB234030
            MOVE SEND-DATA TO F6-S-BSR                                  LB234040
            MOVE G6-S-BSR TO G6-R-B.                                    LB234050
            IF F6-S-BSR NOT = F6-R-B                                    LB234060
                MOVE "F6-S-BSR" TO TEST-ID                              LB234070
                MOVE F6-S-BSR TO SENT-VAL                               LB234080
                MOVE F6-R-B TO RCVD-VAL                                 LB234090
                ADD 1 TO FAIL-COUNT                                     LB234100
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234110
            ELSE                                                        LB234120
              ADD 1 TO PASS-COUNT.                                      LB234130
                                                                        LB234140
            MOVE SEND-DATA TO F6-S-CSD                                  LB234150
            MOVE G6-S-CSD TO G6-R-B.                                    LB234160
            IF F6-S-CSD NOT = F6-R-B                                    LB234170
                MOVE "F6-S-CSD" TO TEST-ID                              LB234180
                MOVE F6-S-CSD TO SENT-VAL                               LB234190
                MOVE F6-R-B TO RCVD-VAL                                 LB234200
                ADD 1 TO FAIL-COUNT                                     LB234210
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234220
            ELSE                                                        LB234230
              ADD 1 TO PASS-COUNT.                                      LB234240
                                                                        LB234250
            MOVE SEND-DATA TO F6-S-CSDL                                 LB234260
            MOVE G6-S-CSDL TO G6-R-B.                                   LB234270
            IF F6-S-CSDL NOT = F6-R-B                                   LB234280
                MOVE "F6-S-CSDL" TO TEST-ID                             LB234290
                MOVE F6-S-CSDL TO SENT-VAL                              LB234300
                MOVE F6-R-B TO RCVD-VAL                                 LB234310
                ADD 1 TO FAIL-COUNT                                     LB234320
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234330
            ELSE                                                        LB234340
              ADD 1 TO PASS-COUNT.                                      LB234350
                                                                        LB234360
            MOVE SEND-DATA TO F6-S-CSDR                                 LB234370
            MOVE G6-S-CSDR TO G6-R-B.                                   LB234380
            IF F6-S-CSDR NOT = F6-R-B                                   LB234390
                MOVE "F6-S-CSDR" TO TEST-ID                             LB234400
                MOVE F6-S-CSDR TO SENT-VAL                              LB234410
                MOVE F6-R-B TO RCVD-VAL                                 LB234420
                ADD 1 TO FAIL-COUNT                                     LB234430
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234440
            ELSE                                                        LB234450
              ADD 1 TO PASS-COUNT.                                      LB234460
                                                                        LB234470
            MOVE SEND-DATA TO F6-S-CS                                   LB234480
            MOVE G6-S-CS TO G6-R-B.                                     LB234490
            IF F6-S-CS NOT = F6-R-B                                     LB234500
                MOVE "F6-S-CS" TO TEST-ID                               LB234510
                MOVE F6-S-CS TO SENT-VAL                                LB234520
                MOVE F6-R-B TO RCVD-VAL                                 LB234530
                ADD 1 TO FAIL-COUNT                                     LB234540
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234550
            ELSE                                                        LB234560
              ADD 1 TO PASS-COUNT.                                      LB234570
                                                                        LB234580
            MOVE SEND-DATA TO F6-S-CSL                                  LB234590
            MOVE G6-S-CSL TO G6-R-B.                                    LB234600
            IF F6-S-CSL NOT = F6-R-B                                    LB234610
                MOVE "F6-S-CSL" TO TEST-ID                              LB234620
                MOVE F6-S-CSL TO SENT-VAL                               LB234630
                MOVE F6-R-B TO RCVD-VAL                                 LB234640
                ADD 1 TO FAIL-COUNT                                     LB234650
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234660
            ELSE                                                        LB234670
              ADD 1 TO PASS-COUNT.                                      LB234680
                                                                        LB234690
            MOVE SEND-DATA TO F6-S-CSR                                  LB234700
            MOVE G6-S-CSR TO G6-R-B.                                    LB234710
            IF F6-S-CSR NOT = F6-R-B                                    LB234720
                MOVE "F6-S-CSR" TO TEST-ID                              LB234730
                MOVE F6-S-CSR TO SENT-VAL                               LB234740
                MOVE F6-R-B TO RCVD-VAL                                 LB234750
                ADD 1 TO FAIL-COUNT                                     LB234760
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234770
            ELSE                                                        LB234780
              ADD 1 TO PASS-COUNT.                                      LB234790
                                                                        LB234800
            MOVE SEND-DATA TO F6-S-C4SD                                 LB234810
            MOVE G6-S-C4SD TO G6-R-B.                                   LB234820
            IF F6-S-C4SD NOT = F6-R-B                                   LB234830
                MOVE "F6-S-C4SD" TO TEST-ID                             LB234840
                MOVE F6-S-C4SD TO SENT-VAL                              LB234850
                MOVE F6-R-B TO RCVD-VAL                                 LB234860
                ADD 1 TO FAIL-COUNT                                     LB234870
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234880
            ELSE                                                        LB234890
              ADD 1 TO PASS-COUNT.                                      LB234900
                                                                        LB234910
            MOVE SEND-DATA TO F6-S-C4SDL                                LB234920
            MOVE G6-S-C4SDL TO G6-R-B.                                  LB234930
            IF F6-S-C4SDL NOT = F6-R-B                                  LB234940
                MOVE "F6-S-C4SDL" TO TEST-ID                            LB234950
                MOVE F6-S-C4SDL TO SENT-VAL                             LB234960
                MOVE F6-R-B TO RCVD-VAL                                 LB234970
                ADD 1 TO FAIL-COUNT                                     LB234980
                PERFORM PRINT-ERRS THRU PR-OUT                          LB234990
            ELSE                                                        LB235000
              ADD 1 TO PASS-COUNT.                                      LB235010
                                                                        LB235020
            MOVE SEND-DATA TO F6-S-C4SDR                                LB235030
            MOVE G6-S-C4SDR TO G6-R-B.                                  LB235040
            IF F6-S-C4SDR NOT = F6-R-B                                  LB235050
                MOVE "F6-S-C4SDR" TO TEST-ID                            LB235060
                MOVE F6-S-C4SDR TO SENT-VAL                             LB235070
                MOVE F6-R-B TO RCVD-VAL                                 LB235080
                ADD 1 TO FAIL-COUNT                                     LB235090
                PERFORM PRINT-ERRS THRU PR-OUT                          LB235100
            ELSE                                                        LB235110
              ADD 1 TO PASS-COUNT.                                      LB235120
                                                                        LB235130
            MOVE SEND-DATA TO F6-S-C4S                                  LB235140
            MOVE G6-S-C4S TO G6-R-B.                                    LB235150
            IF F6-S-C4S NOT = F6-R-B                                    LB235160
                MOVE "F6-S-C4S" TO TEST-ID                              LB235170
                MOVE F6-S-C4S TO SENT-VAL                               LB235180
                MOVE F6-R-B TO RCVD-VAL                                 LB235190
                ADD 1 TO FAIL-COUNT                                     LB235200
                PERFORM PRINT-ERRS THRU PR-OUT                          LB235210
            ELSE                                                        LB235220
              ADD 1 TO PASS-COUNT.                                      LB235230
                                                                        LB235240
            MOVE SEND-DATA TO F6-S-C4SL                                 LB235250
            MOVE G6-S-C4SL TO G6-R-B.                                   LB235260
            IF F6-S-C4SL NOT = F6-R-B                                   LB235270
                MOVE "F6-S-C4SL" TO TEST-ID                             LB235280
                MOVE F6-S-C4SL TO SENT-VAL                              LB235290
                MOVE F6-R-B TO RCVD-VAL                                 LB235300
                ADD 1 TO FAIL-COUNT                                     LB235310
                PERFORM PRINT-ERRS THRU PR-OUT                          LB235320
            ELSE                                                        LB235330
              ADD 1 TO PASS-COUNT.                                      LB235340
                                                                        LB235350
            MOVE SEND-DATA TO F6-S-C4SR                                 LB235360
            MOVE G6-S-C4SR TO G6-R-B.                                   LB235370
            IF F6-S-C4SR NOT = F6-R-B                                   LB235380
                MOVE "F6-S-C4SR" TO TEST-ID                             LB235390
                MOVE F6-S-C4SR TO SENT-VAL                              LB235400
                MOVE F6-R-B TO RCVD-VAL                                 LB235410
                ADD 1 TO FAIL-COUNT                                     LB235420
                PERFORM PRINT-ERRS THRU PR-OUT                          LB235430
            ELSE                                                        LB235440
              ADD 1 TO PASS-COUNT.                                      LB235450
                                                                        LB235460
                                                                        LB235470
      **********************************************************        LB235480
      *                                                         *       LB235490
      *    MOVE 18 VARIATIONS OF 6 DIGIT FIELD TO A "comp-5"   *        LB235500
      *                  RECEIVING FIELD                        *       LB235510
      *                                                         *       LB235520
      **********************************************************        LB235530
                                                                        LB235540
            MOVE SEND-DATA TO F6-S-BSD                                  LB235550
            MOVE G6-S-BSD TO G6-R-C.                                    LB235560
            IF F6-S-BSD NOT = F6-R-C                                    LB235570
                MOVE "F6-S-BSD" TO TEST-ID                              LB235580
                MOVE F6-S-BSD TO SENT-VAL                               LB235590
                MOVE F6-R-C TO RCVD-VAL                                 LB235600
                ADD 1 TO FAIL-COUNT                                     LB235610
                PERFORM PRINT-ERRS THRU PR-OUT                          LB235620
            ELSE                                                        LB235630
              ADD 1 TO PASS-COUNT.                                      LB235640
                                                                        LB235650
            MOVE SEND-DATA TO F6-S-BSDL                                 LB235660
            MOVE G6-S-BSDL TO G6-R-C.                                   LB235670
            IF F6-S-BSDL NOT = F6-R-C                                   LB235680
                MOVE "F6-S-BSDL" TO TEST-ID                             LB235690
                MOVE F6-S-BSDL TO SENT-VAL                              LB235700
                MOVE F6-R-C TO RCVD-VAL                                 LB235710
                ADD 1 TO FAIL-COUNT                                     LB235720
                PERFORM PRINT-ERRS THRU PR-OUT                          LB235730
            ELSE                                                        LB235740
              ADD 1 TO PASS-COUNT.                                      LB235750
                                                                        LB235760
            MOVE SEND-DATA TO F6-S-BSDR                                 LB235770
            MOVE G6-S-BSDR TO G6-R-C.                                   LB235780
            IF F6-S-BSDR NOT = F6-R-C                                   LB235790
                MOVE "F6-S-BSDR" TO TEST-ID                             LB235800
                MOVE F6-S-BSDR TO SENT-VAL                              LB235810
                MOVE F6-R-C TO RCVD-VAL                                 LB235820
                ADD 1 TO FAIL-COUNT                                     LB235830
                PERFORM PRINT-ERRS THRU PR-OUT                          LB235840
            ELSE                                                        LB235850
              ADD 1 TO PASS-COUNT.                                      LB235860
                                                                        LB235870
            MOVE SEND-DATA TO F6-S-BS                                   LB235880
            MOVE G6-S-BS TO G6-R-C.                                     LB235890
            IF F6-S-BS NOT = F6-R-C                                     LB235900
                MOVE "F6-S-BS" TO TEST-ID                               LB235910
                MOVE F6-S-BS TO SENT-VAL                                LB235920
                MOVE F6-R-C TO RCVD-VAL                                 LB235930
                ADD 1 TO FAIL-COUNT                                     LB235940
                PERFORM PRINT-ERRS THRU PR-OUT                          LB235950
            ELSE                                                        LB235960
              ADD 1 TO PASS-COUNT.                                      LB235970
                                                                        LB235980
            MOVE SEND-DATA TO F6-S-BSL                                  LB235990
            MOVE G6-S-BSL TO G6-R-C.                                    LB236000
            IF F6-S-BSL NOT = F6-R-C                                    LB236010
                MOVE "F6-S-BSL" TO TEST-ID                              LB236020
                MOVE F6-S-BSL TO SENT-VAL                               LB236030
                MOVE F6-R-C TO RCVD-VAL                                 LB236040
                ADD 1 TO FAIL-COUNT                                     LB236050
                PERFORM PRINT-ERRS THRU PR-OUT                          LB236060
            ELSE                                                        LB236070
              ADD 1 TO PASS-COUNT.                                      LB236080
                                                                        LB236090
            MOVE SEND-DATA TO F6-S-BSR                                  LB236100
            MOVE G6-S-BSR TO G6-R-C.                                    LB236110
            IF F6-S-BSR NOT = F6-R-C                                    LB236120
                MOVE "F6-S-BSR" TO TEST-ID                              LB236130
                MOVE F6-S-BSR TO SENT-VAL                               LB236140
                MOVE F6-R-C TO RCVD-VAL                                 LB236150
                ADD 1 TO FAIL-COUNT                                     LB236160
                PERFORM PRINT-ERRS THRU PR-OUT                          LB236170
            ELSE                                                        LB236180
              ADD 1 TO PASS-COUNT.                                      LB236190
                                                                        LB236200
            MOVE SEND-DATA TO F6-S-CSD                                  LB236210
            MOVE G6-S-CSD TO G6-R-C.                                    LB236220
            IF F6-S-CSD NOT = F6-R-C                                    LB236230
                MOVE "F6-S-CSD" TO TEST-ID                              LB236240
                MOVE F6-S-CSD TO SENT-VAL                               LB236250
                MOVE F6-R-C TO RCVD-VAL                                 LB236260
                ADD 1 TO FAIL-COUNT                                     LB236270
                PERFORM PRINT-ERRS THRU PR-OUT                          LB236280
            ELSE                                                        LB236290
              ADD 1 TO PASS-COUNT.                                      LB236300
                                                                        LB236310
            MOVE SEND-DATA TO F6-S-CSDL                                 LB236320
            MOVE G6-S-CSDL TO G6-R-C.                                   LB236330
            IF F6-S-CSDL NOT = F6-R-C                                   LB236340
                MOVE "F6-S-CSDL" TO TEST-ID                             LB236350
                MOVE F6-S-CSDL TO SENT-VAL                              LB236360
                MOVE F6-R-C TO RCVD-VAL                                 LB236370
                ADD 1 TO FAIL-COUNT                                     LB236380
                PERFORM PRINT-ERRS THRU PR-OUT                          LB236390
            ELSE                                                        LB236400
              ADD 1 TO PASS-COUNT.                                      LB236410
                                                                        LB236420
            MOVE SEND-DATA TO F6-S-CSDR                                 LB236430
            MOVE G6-S-CSDR TO G6-R-C.                                   LB236440
            IF F6-S-CSDR NOT = F6-R-C                                   LB236450
                MOVE "F6-S-CSDR" TO TEST-ID                             LB236460
                MOVE F6-S-CSDR TO SENT-VAL                              LB236470
                MOVE F6-R-C TO RCVD-VAL                                 LB236480
                ADD 1 TO FAIL-COUNT                                     LB236490
                PERFORM PRINT-ERRS THRU PR-OUT                          LB236500
            ELSE                                                        LB236510
              ADD 1 TO PASS-COUNT.                                      LB236520
                                                                        LB236530
            MOVE SEND-DATA TO F6-S-CS                                   LB236540
            MOVE G6-S-CS TO G6-R-C.                                     LB236550
            IF F6-S-CS NOT = F6-R-C                                     LB236560
                MOVE "F6-S-CS" TO TEST-ID                               LB236570
                MOVE F6-S-CS TO SENT-VAL                                LB236580
                MOVE F6-R-C TO RCVD-VAL                                 LB236590
                ADD 1 TO FAIL-COUNT                                     LB236600
                PERFORM PRINT-ERRS THRU PR-OUT                          LB236610
            ELSE                                                        LB236620
              ADD 1 TO PASS-COUNT.                                      LB236630
                                                                        LB236640
            MOVE SEND-DATA TO F6-S-CSL                                  LB236650
            MOVE G6-S-CSL TO G6-R-C.                                    LB236660
            IF F6-S-CSL NOT = F6-R-C                                    LB236670
                MOVE "F6-S-CSL" TO TEST-ID                              LB236680
                MOVE F6-S-CSL TO SENT-VAL                               LB236690
                MOVE F6-R-C TO RCVD-VAL                                 LB236700
                ADD 1 TO FAIL-COUNT                                     LB236710
                PERFORM PRINT-ERRS THRU PR-OUT                          LB236720
            ELSE                                                        LB236730
              ADD 1 TO PASS-COUNT.                                      LB236740
                                                                        LB236750
            MOVE SEND-DATA TO F6-S-CSR                                  LB236760
            MOVE G6-S-CSR TO G6-R-C.                                    LB236770
            IF F6-S-CSR NOT = F6-R-C                                    LB236780
                MOVE "F6-S-CSR" TO TEST-ID                              LB236790
                MOVE F6-S-CSR TO SENT-VAL                               LB236800
                MOVE F6-R-C TO RCVD-VAL                                 LB236810
                ADD 1 TO FAIL-COUNT                                     LB236820
                PERFORM PRINT-ERRS THRU PR-OUT                          LB236830
            ELSE                                                        LB236840
              ADD 1 TO PASS-COUNT.                                      LB236850
                                                                        LB236860
            MOVE SEND-DATA TO F6-S-C4SD                                 LB236870
            MOVE G6-S-C4SD TO G6-R-C.                                   LB236880
            IF F6-S-C4SD NOT = F6-R-C                                   LB236890
                MOVE "F6-S-C4SD" TO TEST-ID                             LB236900
                MOVE F6-S-C4SD TO SENT-VAL                              LB236910
                MOVE F6-R-C TO RCVD-VAL                                 LB236920
                ADD 1 TO FAIL-COUNT                                     LB236930
                PERFORM PRINT-ERRS THRU PR-OUT                          LB236940
            ELSE                                                        LB236950
              ADD 1 TO PASS-COUNT.                                      LB236960
                                                                        LB236970
            MOVE SEND-DATA TO F6-S-C4SDL                                LB236980
            MOVE G6-S-C4SDL TO G6-R-C.                                  LB236990
            IF F6-S-C4SDL NOT = F6-R-C                                  LB237000
                MOVE "F6-S-C4SDL" TO TEST-ID                            LB237010
                MOVE F6-S-C4SDL TO SENT-VAL                             LB237020
                MOVE F6-R-C TO RCVD-VAL                                 LB237030
                ADD 1 TO FAIL-COUNT                                     LB237040
                PERFORM PRINT-ERRS THRU PR-OUT                          LB237050
            ELSE                                                        LB237060
              ADD 1 TO PASS-COUNT.                                      LB237070
                                                                        LB237080
            MOVE SEND-DATA TO F6-S-C4SDR                                LB237090
            MOVE G6-S-C4SDR TO G6-R-C.                                  LB237100
            IF F6-S-C4SDR NOT = F6-R-C                                  LB237110
                MOVE "F6-S-C4SDR" TO TEST-ID                            LB237120
                MOVE F6-S-C4SDR TO SENT-VAL                             LB237130
                MOVE F6-R-C TO RCVD-VAL                                 LB237140
                ADD 1 TO FAIL-COUNT                                     LB237150
                PERFORM PRINT-ERRS THRU PR-OUT                          LB237160
            ELSE                                                        LB237170
              ADD 1 TO PASS-COUNT.                                      LB237180
                                                                        LB237190
            MOVE SEND-DATA TO F6-S-C4S                                  LB237200
            MOVE G6-S-C4S TO G6-R-C.                                    LB237210
            IF F6-S-C4S NOT = F6-R-C                                    LB237220
                MOVE "F6-S-C4S" TO TEST-ID                              LB237230
                MOVE F6-S-C4S TO SENT-VAL                               LB237240
                MOVE F6-R-C TO RCVD-VAL                                 LB237250
                ADD 1 TO FAIL-COUNT                                     LB237260
                PERFORM PRINT-ERRS THRU PR-OUT                          LB237270
            ELSE                                                        LB237280
              ADD 1 TO PASS-COUNT.                                      LB237290
                                                                        LB237300
            MOVE SEND-DATA TO F6-S-C4SL                                 LB237310
            MOVE G6-S-C4SL TO G6-R-C.                                   LB237320
            IF F6-S-C4SL NOT = F6-R-C                                   LB237330
                MOVE "F6-S-C4SL" TO TEST-ID                             LB237340
                MOVE F6-S-C4SL TO SENT-VAL                              LB237350
                MOVE F6-R-C TO RCVD-VAL                                 LB237360
                ADD 1 TO FAIL-COUNT                                     LB237370
                PERFORM PRINT-ERRS THRU PR-OUT                          LB237380
            ELSE                                                        LB237390
              ADD 1 TO PASS-COUNT.                                      LB237400
                                                                        LB237410
            MOVE SEND-DATA TO F6-S-C4SR                                 LB237420
            MOVE G6-S-C4SR TO G6-R-C.                                   LB237430
            IF F6-S-C4SR NOT = F6-R-C                                   LB237440
                MOVE "F6-S-C4SR" TO TEST-ID                             LB237450
                MOVE F6-S-C4SR TO SENT-VAL                              LB237460
                MOVE F6-R-C TO RCVD-VAL                                 LB237470
                ADD 1 TO FAIL-COUNT                                     LB237480
                PERFORM PRINT-ERRS THRU PR-OUT                          LB237490
            ELSE                                                        LB237500
              ADD 1 TO PASS-COUNT.                                      LB237510
                                                                        LB237520
                                                                        LB237530
      **********************************************************        LB237540
      *                                                         *       LB237550
      *    MOVE 18 VARIATIONS OF 6 DIGIT FIELD TO A             *       LB237560
      *      "COMPUTATIONAL-5"  RECEIVING FIELD                 *       LB237570
      *                                                         *       LB237580
      **********************************************************        LB237590
                                                                        LB237600
            MOVE SEND-DATA TO F6-S-BSD                                  LB237610
            MOVE G6-S-BSD TO G6-R-C4.                                   LB237620
            IF F6-S-BSD NOT = F6-R-C4                                   LB237630
                MOVE "F6-S-BSD" TO TEST-ID                              LB237640
                MOVE F6-S-BSD TO SENT-VAL                               LB237650
                MOVE F6-R-C4 TO RCVD-VAL                                LB237660
                ADD 1 TO FAIL-COUNT                                     LB237670
                PERFORM PRINT-ERRS THRU PR-OUT                          LB237680
            ELSE                                                        LB237690
              ADD 1 TO PASS-COUNT.                                      LB237700
                                                                        LB237710
            MOVE SEND-DATA TO F6-S-BSDL                                 LB237720
            MOVE G6-S-BSDL TO G6-R-C4.                                  LB237730
            IF F6-S-BSDL NOT = F6-R-C4                                  LB237740
                MOVE "F6-S-BSDL" TO TEST-ID                             LB237750
                MOVE F6-S-BSDL TO SENT-VAL                              LB237760
                MOVE F6-R-C4 TO RCVD-VAL                                LB237770
                ADD 1 TO FAIL-COUNT                                     LB237780
                PERFORM PRINT-ERRS THRU PR-OUT                          LB237790
            ELSE                                                        LB237800
              ADD 1 TO PASS-COUNT.                                      LB237810
                                                                        LB237820
            MOVE SEND-DATA TO F6-S-BSDR                                 LB237830
            MOVE G6-S-BSDR TO G6-R-C4.                                  LB237840
            IF F6-S-BSDR NOT = F6-R-C4                                  LB237850
                MOVE "F6-S-BSDR" TO TEST-ID                             LB237860
                MOVE F6-S-BSDR TO SENT-VAL                              LB237870
                MOVE F6-R-C4 TO RCVD-VAL                                LB237880
                ADD 1 TO FAIL-COUNT                                     LB237890
                PERFORM PRINT-ERRS THRU PR-OUT                          LB237900
            ELSE                                                        LB237910
              ADD 1 TO PASS-COUNT.                                      LB237920
                                                                        LB237930
            MOVE SEND-DATA TO F6-S-BS                                   LB237940
            MOVE G6-S-BS TO G6-R-C4.                                    LB237950
            IF F6-S-BS NOT = F6-R-C4                                    LB237960
                MOVE "F6-S-BS" TO TEST-ID                               LB237970
                MOVE F6-S-BS TO SENT-VAL                                LB237980
                MOVE F6-R-C4 TO RCVD-VAL                                LB237990
                ADD 1 TO FAIL-COUNT                                     LB238000
                PERFORM PRINT-ERRS THRU PR-OUT                          LB238010
            ELSE                                                        LB238020
              ADD 1 TO PASS-COUNT.                                      LB238030
                                                                        LB238040
            MOVE SEND-DATA TO F6-S-BSL                                  LB238050
            MOVE G6-S-BSL TO G6-R-C4.                                   LB238060
            IF F6-S-BSL NOT = F6-R-C4                                   LB238070
                MOVE "F6-S-BSL" TO TEST-ID                              LB238080
                MOVE F6-S-BSL TO SENT-VAL                               LB238090
                MOVE F6-R-C4 TO RCVD-VAL                                LB238100
                ADD 1 TO FAIL-COUNT                                     LB238110
                PERFORM PRINT-ERRS THRU PR-OUT                          LB238120
            ELSE                                                        LB238130
              ADD 1 TO PASS-COUNT.                                      LB238140
                                                                        LB238150
            MOVE SEND-DATA TO F6-S-BSR                                  LB238160
            MOVE G6-S-BSR TO G6-R-C4.                                   LB238170
            IF F6-S-BSR NOT = F6-R-C4                                   LB238180
                MOVE "F6-S-BSR" TO TEST-ID                              LB238190
                MOVE F6-S-BSR TO SENT-VAL                               LB238200
                MOVE F6-R-C4 TO RCVD-VAL                                LB238210
                ADD 1 TO FAIL-COUNT                                     LB238220
                PERFORM PRINT-ERRS THRU PR-OUT                          LB238230
            ELSE                                                        LB238240
              ADD 1 TO PASS-COUNT.                                      LB238250
                                                                        LB238260
            MOVE SEND-DATA TO F6-S-CSD                                  LB238270
            MOVE G6-S-CSD TO G6-R-C4.                                   LB238280
            IF F6-S-CSD NOT = F6-R-C4                                   LB238290
                MOVE "F6-S-CSD" TO TEST-ID                              LB238300
                MOVE F6-S-CSD TO SENT-VAL                               LB238310
                MOVE F6-R-C4 TO RCVD-VAL                                LB238320
                ADD 1 TO FAIL-COUNT                                     LB238330
                PERFORM PRINT-ERRS THRU PR-OUT                          LB238340
            ELSE                                                        LB238350
              ADD 1 TO PASS-COUNT.                                      LB238360
                                                                        LB238370
            MOVE SEND-DATA TO F6-S-CSDL                                 LB238380
            MOVE G6-S-CSDL TO G6-R-C4.                                  LB238390
            IF F6-S-CSDL NOT = F6-R-C4                                  LB238400
                MOVE "F6-S-CSDL" TO TEST-ID                             LB238410
                MOVE F6-S-CSDL TO SENT-VAL                              LB238420
                MOVE F6-R-C4 TO RCVD-VAL                                LB238430
                ADD 1 TO FAIL-COUNT                                     LB238440
                PERFORM PRINT-ERRS THRU PR-OUT                          LB238450
            ELSE                                                        LB238460
              ADD 1 TO PASS-COUNT.                                      LB238470
                                                                        LB238480
            MOVE SEND-DATA TO F6-S-CSDR                                 LB238490
            MOVE G6-S-CSDR TO G6-R-C4.                                  LB238500
            IF F6-S-CSDR NOT = F6-R-C4                                  LB238510
                MOVE "F6-S-CSDR" TO TEST-ID                             LB238520
                MOVE F6-S-CSDR TO SENT-VAL                              LB238530
                MOVE F6-R-C4 TO RCVD-VAL                                LB238540
                ADD 1 TO FAIL-COUNT                                     LB238550
                PERFORM PRINT-ERRS THRU PR-OUT                          LB238560
            ELSE                                                        LB238570
              ADD 1 TO PASS-COUNT.                                      LB238580
                                                                        LB238590
            MOVE SEND-DATA TO F6-S-CS                                   LB238600
            MOVE G6-S-CS TO G6-R-C4.                                    LB238610
            IF F6-S-CS NOT = F6-R-C4                                    LB238620
                MOVE "F6-S-CS" TO TEST-ID                               LB238630
                MOVE F6-S-CS TO SENT-VAL                                LB238640
                MOVE F6-R-C4 TO RCVD-VAL                                LB238650
                ADD 1 TO FAIL-COUNT                                     LB238660
                PERFORM PRINT-ERRS THRU PR-OUT                          LB238670
            ELSE                                                        LB238680
              ADD 1 TO PASS-COUNT.                                      LB238690
                                                                        LB238700
            MOVE SEND-DATA TO F6-S-CSL                                  LB238710
            MOVE G6-S-CSL TO G6-R-C4.                                   LB238720
            IF F6-S-CSL NOT = F6-R-C4                                   LB238730
                MOVE "F6-S-CSL" TO TEST-ID                              LB238740
                MOVE F6-S-CSL TO SENT-VAL                               LB238750
                MOVE F6-R-C4 TO RCVD-VAL                                LB238760
                ADD 1 TO FAIL-COUNT                                     LB238770
                PERFORM PRINT-ERRS THRU PR-OUT                          LB238780
            ELSE                                                        LB238790
              ADD 1 TO PASS-COUNT.                                      LB238800
                                                                        LB238810
            MOVE SEND-DATA TO F6-S-CSR                                  LB238820
            MOVE G6-S-CSR TO G6-R-C4.                                   LB238830
            IF F6-S-CSR NOT = F6-R-C4                                   LB238840
                MOVE "F6-S-CSR" TO TEST-ID                              LB238850
                MOVE F6-S-CSR TO SENT-VAL                               LB238860
                MOVE F6-R-C4 TO RCVD-VAL                                LB238870
                ADD 1 TO FAIL-COUNT                                     LB238880
                PERFORM PRINT-ERRS THRU PR-OUT                          LB238890
            ELSE                                                        LB238900
              ADD 1 TO PASS-COUNT.                                      LB238910
                                                                        LB238920
            MOVE SEND-DATA TO F6-S-C4SD                                 LB238930
            MOVE G6-S-C4SD TO G6-R-C4.                                  LB238940
            IF F6-S-C4SD NOT = F6-R-C4                                  LB238950
                MOVE "F6-S-C4SD" TO TEST-ID                             LB238960
                MOVE F6-S-C4SD TO SENT-VAL                              LB238970
                MOVE F6-R-C4 TO RCVD-VAL                                LB238980
                ADD 1 TO FAIL-COUNT                                     LB238990
                PERFORM PRINT-ERRS THRU PR-OUT                          LB239000
            ELSE                                                        LB239010
              ADD 1 TO PASS-COUNT.                                      LB239020
                                                                        LB239030
            MOVE SEND-DATA TO F6-S-C4SDL                                LB239040
            MOVE G6-S-C4SDL TO G6-R-C4.                                 LB239050
            IF F6-S-C4SDL NOT = F6-R-C4                                 LB239060
                MOVE "F6-S-C4SDL" TO TEST-ID                            LB239070
                MOVE F6-S-C4SDL TO SENT-VAL                             LB239080
                MOVE F6-R-C4 TO RCVD-VAL                                LB239090
                ADD 1 TO FAIL-COUNT                                     LB239100
                PERFORM PRINT-ERRS THRU PR-OUT                          LB239110
            ELSE                                                        LB239120
              ADD 1 TO PASS-COUNT.                                      LB239130
                                                                        LB239140
            MOVE SEND-DATA TO F6-S-C4SDR                                LB239150
            MOVE G6-S-C4SDR TO G6-R-C4.                                 LB239160
            IF F6-S-C4SDR NOT = F6-R-C4                                 LB239170
                MOVE "F6-S-C4SDR" TO TEST-ID                            LB239180
                MOVE F6-S-C4SDR TO SENT-VAL                             LB239190
                MOVE F6-R-C4 TO RCVD-VAL                                LB239200
                ADD 1 TO FAIL-COUNT                                     LB239210
                PERFORM PRINT-ERRS THRU PR-OUT                          LB239220
            ELSE                                                        LB239230
              ADD 1 TO PASS-COUNT.                                      LB239240
                                                                        LB239250
            MOVE SEND-DATA TO F6-S-C4S                                  LB239260
            MOVE G6-S-C4S TO G6-R-C4.                                   LB239270
            IF F6-S-C4S NOT = F6-R-C4                                   LB239280
                MOVE "F6-S-C4S" TO TEST-ID                              LB239290
                MOVE F6-S-C4S TO SENT-VAL                               LB239300
                MOVE F6-R-C4 TO RCVD-VAL                                LB239310
                ADD 1 TO FAIL-COUNT                                     LB239320
                PERFORM PRINT-ERRS THRU PR-OUT                          LB239330
            ELSE                                                        LB239340
              ADD 1 TO PASS-COUNT.                                      LB239350
                                                                        LB239360
            MOVE SEND-DATA TO F6-S-C4SL                                 LB239370
            MOVE G6-S-C4SL TO G6-R-C4.                                  LB239380
            IF F6-S-C4SL NOT = F6-R-C4                                  LB239390
                MOVE "F6-S-C4SL" TO TEST-ID                             LB239400
                MOVE F6-S-C4SL TO SENT-VAL                              LB239410
                MOVE F6-R-C4 TO RCVD-VAL                                LB239420
                ADD 1 TO FAIL-COUNT                                     LB239430
                PERFORM PRINT-ERRS THRU PR-OUT                          LB239440
            ELSE                                                        LB239450
              ADD 1 TO PASS-COUNT.                                      LB239460
                                                                        LB239470
            MOVE SEND-DATA TO F6-S-C4SR                                 LB239480
            MOVE G6-S-C4SR TO G6-R-C4.                                  LB239490
            IF F6-S-C4SR NOT = F6-R-C4                                  LB239500
                MOVE "F6-S-C4SR" TO TEST-ID                             LB239510
                MOVE F6-S-C4SR TO SENT-VAL                              LB239520
                MOVE F6-R-C4 TO RCVD-VAL                                LB239530
                ADD 1 TO FAIL-COUNT                                     LB239540
                PERFORM PRINT-ERRS THRU PR-OUT                          LB239550
            ELSE                                                        LB239560
              ADD 1 TO PASS-COUNT.                                      LB239570
                                                                        LB239580
      *********************************************************         LB239590
      *                                                        *        LB239600
      *    MOVE 18 VARIATIONS OF 9 DIGIT FIELD TO A " comp-5"   *       LB239610
      *                  RECEIVING FIELD                       *        LB239620
      *                                                        *        LB239630
      **********************************************************        LB239640
                                                                        LB239650
            MOVE SEND-DATA TO F9-S-BSD                                  LB239660
            MOVE G9-S-BSD TO G9-R-B.                                    LB239670
            IF F9-S-BSD NOT = F9-R-B                                    LB239680
                MOVE "F9-S-BSD" TO TEST-ID                              LB239690
                MOVE F9-S-BSD TO SENT-VAL                               LB239700
                MOVE F9-R-B TO RCVD-VAL                                 LB239710
                ADD 1 TO FAIL-COUNT                                     LB239720
                PERFORM PRINT-ERRS THRU PR-OUT                          LB239730
            ELSE                                                        LB239740
              ADD 1 TO PASS-COUNT.                                      LB239750
                                                                        LB239760
            MOVE SEND-DATA TO F9-S-BSDL                                 LB239770
            MOVE G9-S-BSDL TO G9-R-B.                                   LB239780
            IF F9-S-BSDL NOT = F9-R-B                                   LB239790
                MOVE "F9-S-BSDL" TO TEST-ID                             LB239800
                MOVE F9-S-BSDL TO SENT-VAL                              LB239810
                MOVE F9-R-B TO RCVD-VAL                                 LB239820
                ADD 1 TO FAIL-COUNT                                     LB239830
                PERFORM PRINT-ERRS THRU PR-OUT                          LB239840
            ELSE                                                        LB239850
              ADD 1 TO PASS-COUNT.                                      LB239860
                                                                        LB239870
            MOVE SEND-DATA TO F9-S-BSDR                                 LB239880
            MOVE G9-S-BSDR TO G9-R-B.                                   LB239890
            IF F9-S-BSDR NOT = F9-R-B                                   LB239900
                MOVE "F9-S-BSDR" TO TEST-ID                             LB239910
                MOVE F9-S-BSDR TO SENT-VAL                              LB239920
                MOVE F9-R-B TO RCVD-VAL                                 LB239930
                ADD 1 TO FAIL-COUNT                                     LB239940
                PERFORM PRINT-ERRS THRU PR-OUT                          LB239950
            ELSE                                                        LB239960
              ADD 1 TO PASS-COUNT.                                      LB239970
                                                                        LB239980
            MOVE SEND-DATA TO F9-S-BS                                   LB239990
            MOVE G9-S-BS TO G9-R-B.                                     LB240000
            IF F9-S-BS NOT = F9-R-B                                     LB240010
                MOVE "F9-S-BS" TO TEST-ID                               LB240020
                MOVE F9-S-BS TO SENT-VAL                                LB240030
                MOVE F9-R-B TO RCVD-VAL                                 LB240040
                ADD 1 TO FAIL-COUNT                                     LB240050
                PERFORM PRINT-ERRS THRU PR-OUT                          LB240060
            ELSE                                                        LB240070
              ADD 1 TO PASS-COUNT.                                      LB240080
                                                                        LB240090
            MOVE SEND-DATA TO F9-S-BSL                                  LB240100
            MOVE G9-S-BSL TO G9-R-B.                                    LB240110
            IF F9-S-BSL NOT = F9-R-B                                    LB240120
                MOVE "F9-S-BSL" TO TEST-ID                              LB240130
                MOVE F9-S-BSL TO SENT-VAL                               LB240140
                MOVE F9-R-B TO RCVD-VAL                                 LB240150
                ADD 1 TO FAIL-COUNT                                     LB240160
                PERFORM PRINT-ERRS THRU PR-OUT                          LB240170
            ELSE                                                        LB240180
              ADD 1 TO PASS-COUNT.                                      LB240190
                                                                        LB240200
            MOVE SEND-DATA TO F9-S-BSR                                  LB240210
            MOVE G9-S-BSR TO G9-R-B.                                    LB240220
            IF F9-S-BSR NOT = F9-R-B                                    LB240230
                MOVE "F9-S-BSR" TO TEST-ID                              LB240240
                MOVE F9-S-BSR TO SENT-VAL                               LB240250
                MOVE F9-R-B TO RCVD-VAL                                 LB240260
                ADD 1 TO FAIL-COUNT                                     LB240270
                PERFORM PRINT-ERRS THRU PR-OUT                          LB240280
            ELSE                                                        LB240290
              ADD 1 TO PASS-COUNT.                                      LB240300
                                                                        LB240310
            MOVE SEND-DATA TO F9-S-CSD                                  LB240320
            MOVE G9-S-CSD TO G9-R-B.                                    LB240330
            IF F9-S-CSD NOT = F9-R-B                                    LB240340
                MOVE "F9-S-CSD" TO TEST-ID                              LB240350
                MOVE F9-S-CSD TO SENT-VAL                               LB240360
                MOVE F9-R-B TO RCVD-VAL                                 LB240370
                ADD 1 TO FAIL-COUNT                                     LB240380
                PERFORM PRINT-ERRS THRU PR-OUT                          LB240390
            ELSE                                                        LB240400
              ADD 1 TO PASS-COUNT.                                      LB240410
                                                                        LB240420
            MOVE SEND-DATA TO F9-S-CSDL                                 LB240430
            MOVE G9-S-CSDL TO G9-R-B.                                   LB240440
            IF F9-S-CSDL NOT = F9-R-B                                   LB240450
                MOVE "F9-S-CSDL" TO TEST-ID                             LB240460
                MOVE F9-S-CSDL TO SENT-VAL                              LB240470
                MOVE F9-R-B TO RCVD-VAL                                 LB240480
                ADD 1 TO FAIL-COUNT                                     LB240490
                PERFORM PRINT-ERRS THRU PR-OUT                          LB240500
            ELSE                                                        LB240510
              ADD 1 TO PASS-COUNT.                                      LB240520
                                                                        LB240530
            MOVE SEND-DATA TO F9-S-CSDR                                 LB240540
            MOVE G9-S-CSDR TO G9-R-B.                                   LB240550
            IF F9-S-CSDR NOT = F9-R-B                                   LB240560
                MOVE "F9-S-CSDR" TO TEST-ID                             LB240570
                MOVE F9-S-CSDR TO SENT-VAL                              LB240580
                MOVE F9-R-B TO RCVD-VAL                                 LB240590
                ADD 1 TO FAIL-COUNT                                     LB240600
                PERFORM PRINT-ERRS THRU PR-OUT                          LB240610
            ELSE                                                        LB240620
              ADD 1 TO PASS-COUNT.                                      LB240630
                                                                        LB240640
            MOVE SEND-DATA TO F9-S-CS                                   LB240650
            MOVE G9-S-CS TO G9-R-B.                                     LB240660
            IF F9-S-CS NOT = F9-R-B                                     LB240670
                MOVE "F9-S-CS" TO TEST-ID                               LB240680
                MOVE F9-S-CS TO SENT-VAL                                LB240690
                MOVE F9-R-B TO RCVD-VAL                                 LB240700
                ADD 1 TO FAIL-COUNT                                     LB240710
                PERFORM PRINT-ERRS THRU PR-OUT                          LB240720
            ELSE                                                        LB240730
              ADD 1 TO PASS-COUNT.                                      LB240740
                                                                        LB240750
            MOVE SEND-DATA TO F9-S-CSL                                  LB240760
            MOVE G9-S-CSL TO G9-R-B.                                    LB240770
            IF F9-S-CSL NOT = F9-R-B                                    LB240780
                MOVE "F9-S-CSL" TO TEST-ID                              LB240790
                MOVE F9-S-CSL TO SENT-VAL                               LB240800
                MOVE F9-R-B TO RCVD-VAL                                 LB240810
                ADD 1 TO FAIL-COUNT                                     LB240820
                PERFORM PRINT-ERRS THRU PR-OUT                          LB240830
            ELSE                                                        LB240840
              ADD 1 TO PASS-COUNT.                                      LB240850
                                                                        LB240860
            MOVE SEND-DATA TO F9-S-CSR                                  LB240870
            MOVE G9-S-CSR TO G9-R-B.                                    LB240880
            IF F9-S-CSR NOT = F9-R-B                                    LB240890
                MOVE "F9-S-CSR" TO TEST-ID                              LB240900
                MOVE F9-S-CSR TO SENT-VAL                               LB240910
                MOVE F9-R-B TO RCVD-VAL                                 LB240920
                ADD 1 TO FAIL-COUNT                                     LB240930
                PERFORM PRINT-ERRS THRU PR-OUT                          LB240940
            ELSE                                                        LB240950
              ADD 1 TO PASS-COUNT.                                      LB240960
                                                                        LB240970
            MOVE SEND-DATA TO F9-S-C4SD                                 LB240980
            MOVE G9-S-C4SD TO G9-R-B.                                   LB240990
            IF F9-S-C4SD NOT = F9-R-B                                   LB241000
                MOVE "F9-S-C4SD" TO TEST-ID                             LB241010
                MOVE F9-S-C4SD TO SENT-VAL                              LB241020
                MOVE F9-R-B TO RCVD-VAL                                 LB241030
                ADD 1 TO FAIL-COUNT                                     LB241040
                PERFORM PRINT-ERRS THRU PR-OUT                          LB241050
            ELSE                                                        LB241060
              ADD 1 TO PASS-COUNT.                                      LB241070
                                                                        LB241080
            MOVE SEND-DATA TO F9-S-C4SDL                                LB241090
            MOVE G9-S-C4SDL TO G9-R-B.                                  LB241100
            IF F9-S-C4SDL NOT = F9-R-B                                  LB241110
                MOVE "F9-S-C4SDL" TO TEST-ID                            LB241120
                MOVE F9-S-C4SDL TO SENT-VAL                             LB241130
                MOVE F9-R-B TO RCVD-VAL                                 LB241140
                ADD 1 TO FAIL-COUNT                                     LB241150
                PERFORM PRINT-ERRS THRU PR-OUT                          LB241160
            ELSE                                                        LB241170
              ADD 1 TO PASS-COUNT.                                      LB241180
                                                                        LB241190
            MOVE SEND-DATA TO F9-S-C4SDR                                LB241200
            MOVE G9-S-C4SDR TO G9-R-B.                                  LB241210
            IF F9-S-C4SDR NOT = F9-R-B                                  LB241220
                MOVE "F9-S-C4SDR" TO TEST-ID                            LB241230
                MOVE F9-S-C4SDR TO SENT-VAL                             LB241240
                MOVE F9-R-B TO RCVD-VAL                                 LB241250
                ADD 1 TO FAIL-COUNT                                     LB241260
                PERFORM PRINT-ERRS THRU PR-OUT                          LB241270
            ELSE                                                        LB241280
              ADD 1 TO PASS-COUNT.                                      LB241290
                                                                        LB241300
            MOVE SEND-DATA TO F9-S-C4S                                  LB241310
            MOVE G9-S-C4S TO G9-R-B.                                    LB241320
            IF F9-S-C4S NOT = F9-R-B                                    LB241330
                MOVE "F9-S-C4S" TO TEST-ID                              LB241340
                MOVE F9-S-C4S TO SENT-VAL                               LB241350
                MOVE F9-R-B TO RCVD-VAL                                 LB241360
                ADD 1 TO FAIL-COUNT                                     LB241370
                PERFORM PRINT-ERRS THRU PR-OUT                          LB241380
            ELSE                                                        LB241390
              ADD 1 TO PASS-COUNT.                                      LB241400
                                                                        LB241410
            MOVE SEND-DATA TO F9-S-C4SL                                 LB241420
            MOVE G9-S-C4SL TO G9-R-B.                                   LB241430
            IF F9-S-C4SL NOT = F9-R-B                                   LB241440
                MOVE "F9-S-C4SL" TO TEST-ID                             LB241450
                MOVE F9-S-C4SL TO SENT-VAL                              LB241460
                MOVE F9-R-B TO RCVD-VAL                                 LB241470
                ADD 1 TO FAIL-COUNT                                     LB241480
                PERFORM PRINT-ERRS THRU PR-OUT                          LB241490
            ELSE                                                        LB241500
              ADD 1 TO PASS-COUNT.                                      LB241510
                                                                        LB241520
            MOVE SEND-DATA TO F9-S-C4SR                                 LB241530
            MOVE G9-S-C4SR TO G9-R-B.                                   LB241540
            IF F9-S-C4SR NOT = F9-R-B                                   LB241550
                MOVE "F9-S-C4SR" TO TEST-ID                             LB241560
                MOVE F9-S-C4SR TO SENT-VAL                              LB241570
                MOVE F9-R-B TO RCVD-VAL                                 LB241580
                ADD 1 TO FAIL-COUNT                                     LB241590
                PERFORM PRINT-ERRS THRU PR-OUT                          LB241600
            ELSE                                                        LB241610
              ADD 1 TO PASS-COUNT.                                      LB241620
                                                                        LB241630
                                                                        LB241640
      **********************************************************        LB241650
      *                                                         *       LB241660
      *    MOVE 18 VARIATIONS OF 9 DIGIT FIELD TO A "comp-5"   *        LB241670
      *                  RECEIVING FIELD                        *       LB241680
      *                                                         *       LB241690
      **********************************************************        LB241700
                                                                        LB241710
            MOVE SEND-DATA TO F9-S-BSD                                  LB241720
            MOVE G9-S-BSD TO G9-R-C.                                    LB241730
            IF F9-S-BSD NOT = F9-R-C                                    LB241740
                MOVE "F9-S-BSD" TO TEST-ID                              LB241750
                MOVE F9-S-BSD TO SENT-VAL                               LB241760
                MOVE F9-R-C TO RCVD-VAL                                 LB241770
                ADD 1 TO FAIL-COUNT                                     LB241780
                PERFORM PRINT-ERRS THRU PR-OUT                          LB241790
            ELSE                                                        LB241800
              ADD 1 TO PASS-COUNT.                                      LB241810
                                                                        LB241820
            MOVE SEND-DATA TO F9-S-BSDL                                 LB241830
            MOVE G9-S-BSDL TO G9-R-C.                                   LB241840
            IF F9-S-BSDL NOT = F9-R-C                                   LB241850
                MOVE "F9-S-BSDL" TO TEST-ID                             LB241860
                MOVE F9-S-BSDL TO SENT-VAL                              LB241870
                MOVE F9-R-C TO RCVD-VAL                                 LB241880
                ADD 1 TO FAIL-COUNT                                     LB241890
                PERFORM PRINT-ERRS THRU PR-OUT                          LB241900
            ELSE                                                        LB241910
              ADD 1 TO PASS-COUNT.                                      LB241920
                                                                        LB241930
            MOVE SEND-DATA TO F9-S-BSDR                                 LB241940
            MOVE G9-S-BSDR TO G9-R-C.                                   LB241950
            IF F9-S-BSDR NOT = F9-R-C                                   LB241960
                MOVE "F9-S-BSDR" TO TEST-ID                             LB241970
                MOVE F9-S-BSDR TO SENT-VAL                              LB241980
                MOVE F9-R-C TO RCVD-VAL                                 LB241990
                ADD 1 TO FAIL-COUNT                                     LB242000
                PERFORM PRINT-ERRS THRU PR-OUT                          LB242010
            ELSE                                                        LB242020
              ADD 1 TO PASS-COUNT.                                      LB242030
                                                                        LB242040
            MOVE SEND-DATA TO F9-S-BS                                   LB242050
            MOVE G9-S-BS TO G9-R-C.                                     LB242060
            IF F9-S-BS NOT = F9-R-C                                     LB242070
                MOVE "F9-S-BS" TO TEST-ID                               LB242080
                MOVE F9-S-BS TO SENT-VAL                                LB242090
                MOVE F9-R-C TO RCVD-VAL                                 LB242100
                ADD 1 TO FAIL-COUNT                                     LB242110
                PERFORM PRINT-ERRS THRU PR-OUT                          LB242120
            ELSE                                                        LB242130
              ADD 1 TO PASS-COUNT.                                      LB242140
                                                                        LB242150
            MOVE SEND-DATA TO F9-S-BSL                                  LB242160
            MOVE G9-S-BSL TO G9-R-C.                                    LB242170
            IF F9-S-BSL NOT = F9-R-C                                    LB242180
                MOVE "F9-S-BSL" TO TEST-ID                              LB242190
                MOVE F9-S-BSL TO SENT-VAL                               LB242200
                MOVE F9-R-C TO RCVD-VAL                                 LB242210
                ADD 1 TO FAIL-COUNT                                     LB242220
                PERFORM PRINT-ERRS THRU PR-OUT                          LB242230
            ELSE                                                        LB242240
              ADD 1 TO PASS-COUNT.                                      LB242250
                                                                        LB242260
            MOVE SEND-DATA TO F9-S-BSR                                  LB242270
            MOVE G9-S-BSR TO G9-R-C.                                    LB242280
            IF F9-S-BSR NOT = F9-R-C                                    LB242290
                MOVE "F9-S-BSR" TO TEST-ID                              LB242300
                MOVE F9-S-BSR TO SENT-VAL                               LB242310
                MOVE F9-R-C TO RCVD-VAL                                 LB242320
                ADD 1 TO FAIL-COUNT                                     LB242330
                PERFORM PRINT-ERRS THRU PR-OUT                          LB242340
            ELSE                                                        LB242350
              ADD 1 TO PASS-COUNT.                                      LB242360
                                                                        LB242370
            MOVE SEND-DATA TO F9-S-CSD                                  LB242380
            MOVE G9-S-CSD TO G9-R-C.                                    LB242390
            IF F9-S-CSD NOT = F9-R-C                                    LB242400
                MOVE "F9-S-CSD" TO TEST-ID                              LB242410
                MOVE F9-S-CSD TO SENT-VAL                               LB242420
                MOVE F9-R-C TO RCVD-VAL                                 LB242430
                ADD 1 TO FAIL-COUNT                                     LB242440
                PERFORM PRINT-ERRS THRU PR-OUT                          LB242450
            ELSE                                                        LB242460
              ADD 1 TO PASS-COUNT.                                      LB242470
                                                                        LB242480
            MOVE SEND-DATA TO F9-S-CSDL                                 LB242490
            MOVE G9-S-CSDL TO G9-R-C.                                   LB242500
            IF F9-S-CSDL NOT = F9-R-C                                   LB242510
                MOVE "F9-S-CSDL" TO TEST-ID                             LB242520
                MOVE F9-S-CSDL TO SENT-VAL                              LB242530
                MOVE F9-R-C TO RCVD-VAL                                 LB242540
                ADD 1 TO FAIL-COUNT                                     LB242550
                PERFORM PRINT-ERRS THRU PR-OUT                          LB242560
            ELSE                                                        LB242570
              ADD 1 TO PASS-COUNT.                                      LB242580
                                                                        LB242590
            MOVE SEND-DATA TO F9-S-CSDR                                 LB242600
            MOVE G9-S-CSDR TO G9-R-C.                                   LB242610
            IF F9-S-CSDR NOT = F9-R-C                                   LB242620
                MOVE "F9-S-CSDR" TO TEST-ID                             LB242630
                MOVE F9-S-CSDR TO SENT-VAL                              LB242640
                MOVE F9-R-C TO RCVD-VAL                                 LB242650
                ADD 1 TO FAIL-COUNT                                     LB242660
                PERFORM PRINT-ERRS THRU PR-OUT                          LB242670
            ELSE                                                        LB242680
              ADD 1 TO PASS-COUNT.                                      LB242690
                                                                        LB242700
            MOVE SEND-DATA TO F9-S-CS                                   LB242710
            MOVE G9-S-CS TO G9-R-C.                                     LB242720
            IF F9-S-CS NOT = F9-R-C                                     LB242730
                MOVE "F9-S-CS" TO TEST-ID                               LB242740
                MOVE F9-S-CS TO SENT-VAL                                LB242750
                MOVE F9-R-C TO RCVD-VAL                                 LB242760
                ADD 1 TO FAIL-COUNT                                     LB242770
                PERFORM PRINT-ERRS THRU PR-OUT                          LB242780
            ELSE                                                        LB242790
              ADD 1 TO PASS-COUNT.                                      LB242800
                                                                        LB242810
            MOVE SEND-DATA TO F9-S-CSL                                  LB242820
            MOVE G9-S-CSL TO G9-R-C.                                    LB242830
            IF F9-S-CSL NOT = F9-R-C                                    LB242840
                MOVE "F9-S-CSL" TO TEST-ID                              LB242850
                MOVE F9-S-CSL TO SENT-VAL                               LB242860
                MOVE F9-R-C TO RCVD-VAL                                 LB242870
                ADD 1 TO FAIL-COUNT                                     LB242880
                PERFORM PRINT-ERRS THRU PR-OUT                          LB242890
            ELSE                                                        LB242900
              ADD 1 TO PASS-COUNT.                                      LB242910
                                                                        LB242920
            MOVE SEND-DATA TO F9-S-CSR                                  LB242930
            MOVE G9-S-CSR TO G9-R-C.                                    LB242940
            IF F9-S-CSR NOT = F9-R-C                                    LB242950
                MOVE "F9-S-CSR" TO TEST-ID                              LB242960
                MOVE F9-S-CSR TO SENT-VAL                               LB242970
                MOVE F9-R-C TO RCVD-VAL                                 LB242980
                ADD 1 TO FAIL-COUNT                                     LB242990
                PERFORM PRINT-ERRS THRU PR-OUT                          LB243000
            ELSE                                                        LB243010
              ADD 1 TO PASS-COUNT.                                      LB243020
                                                                        LB243030
            MOVE SEND-DATA TO F9-S-C4SD                                 LB243040
            MOVE G9-S-C4SD TO G9-R-C.                                   LB243050
            IF F9-S-C4SD NOT = F9-R-C                                   LB243060
                MOVE "F9-S-C4SD" TO TEST-ID                             LB243070
                MOVE F9-S-C4SD TO SENT-VAL                              LB243080
                MOVE F9-R-C TO RCVD-VAL                                 LB243090
                ADD 1 TO FAIL-COUNT                                     LB243100
                PERFORM PRINT-ERRS THRU PR-OUT                          LB243110
            ELSE                                                        LB243120
              ADD 1 TO PASS-COUNT.                                      LB243130
                                                                        LB243140
            MOVE SEND-DATA TO F9-S-C4SDL                                LB243150
            MOVE G9-S-C4SDL TO G9-R-C.                                  LB243160
            IF F9-S-C4SDL NOT = F9-R-C                                  LB243170
                MOVE "F9-S-C4SDL" TO TEST-ID                            LB243180
                MOVE F9-S-C4SDL TO SENT-VAL                             LB243190
                MOVE F9-R-C TO RCVD-VAL                                 LB243200
                ADD 1 TO FAIL-COUNT                                     LB243210
                PERFORM PRINT-ERRS THRU PR-OUT                          LB243220
            ELSE                                                        LB243230
              ADD 1 TO PASS-COUNT.                                      LB243240
                                                                        LB243250
            MOVE SEND-DATA TO F9-S-C4SDR                                LB243260
            MOVE G9-S-C4SDR TO G9-R-C.                                  LB243270
            IF F9-S-C4SDR NOT = F9-R-C                                  LB243280
                MOVE "F9-S-C4SDR" TO TEST-ID                            LB243290
                MOVE F9-S-C4SDR TO SENT-VAL                             LB243300
                MOVE F9-R-C TO RCVD-VAL                                 LB243310
                ADD 1 TO FAIL-COUNT                                     LB243320
                PERFORM PRINT-ERRS THRU PR-OUT                          LB243330
            ELSE                                                        LB243340
              ADD 1 TO PASS-COUNT.                                      LB243350
                                                                        LB243360
            MOVE SEND-DATA TO F9-S-C4S                                  LB243370
            MOVE G9-S-C4S TO G9-R-C.                                    LB243380
            IF F9-S-C4S NOT = F9-R-C                                    LB243390
                MOVE "F9-S-C4S" TO TEST-ID                              LB243400
                MOVE F9-S-C4S TO SENT-VAL                               LB243410
                MOVE F9-R-C TO RCVD-VAL                                 LB243420
                ADD 1 TO FAIL-COUNT                                     LB243430
                PERFORM PRINT-ERRS THRU PR-OUT                          LB243440
            ELSE                                                        LB243450
              ADD 1 TO PASS-COUNT.                                      LB243460
                                                                        LB243470
            MOVE SEND-DATA TO F9-S-C4SL                                 LB243480
            MOVE G9-S-C4SL TO G9-R-C.                                   LB243490
            IF F9-S-C4SL NOT = F9-R-C                                   LB243500
                MOVE "F9-S-C4SL" TO TEST-ID                             LB243510
                MOVE F9-S-C4SL TO SENT-VAL                              LB243520
                MOVE F9-R-C TO RCVD-VAL                                 LB243530
                ADD 1 TO FAIL-COUNT                                     LB243540
                PERFORM PRINT-ERRS THRU PR-OUT                          LB243550
            ELSE                                                        LB243560
              ADD 1 TO PASS-COUNT.                                      LB243570
                                                                        LB243580
            MOVE SEND-DATA TO F9-S-C4SR                                 LB243590
            MOVE G9-S-C4SR TO G9-R-C.                                   LB243600
            IF F9-S-C4SR NOT = F9-R-C                                   LB243610
                MOVE "F9-S-C4SR" TO TEST-ID                             LB243620
                MOVE F9-S-C4SR TO SENT-VAL                              LB243630
                MOVE F9-R-C TO RCVD-VAL                                 LB243640
                ADD 1 TO FAIL-COUNT                                     LB243650
                PERFORM PRINT-ERRS THRU PR-OUT                          LB243660
            ELSE                                                        LB243670
              ADD 1 TO PASS-COUNT.                                      LB243680
                                                                        LB243690
                                                                        LB243700
      **********************************************************        LB243710
      *                                                         *       LB243720
      *    MOVE 18 VARIATIONS OF 9 DIGIT FIELD TO A             *       LB243730
      *      "COMPUTATIONAL-5"  RECEIVING FIELD                 *       LB243740
      *                                                         *       LB243750
      **********************************************************        LB243760
                                                                        LB243770
            MOVE SEND-DATA TO F9-S-BSD                                  LB243780
            MOVE G9-S-BSD TO G9-R-C4.                                   LB243790
            IF F9-S-BSD NOT = F9-R-C4                                   LB243800
                MOVE "F9-S-BSD" TO TEST-ID                              LB243810
                MOVE F9-S-BSD TO SENT-VAL                               LB243820
                MOVE F9-R-C4 TO RCVD-VAL                                LB243830
                ADD 1 TO FAIL-COUNT                                     LB243840
                PERFORM PRINT-ERRS THRU PR-OUT                          LB243850
            ELSE                                                        LB243860
              ADD 1 TO PASS-COUNT.                                      LB243870
                                                                        LB243880
            MOVE SEND-DATA TO F9-S-BSDL                                 LB243890
            MOVE G9-S-BSDL TO G9-R-C4.                                  LB243900
            IF F9-S-BSDL NOT = F9-R-C4                                  LB243910
                MOVE "F9-S-BSDL" TO TEST-ID                             LB243920
                MOVE F9-S-BSDL TO SENT-VAL                              LB243930
                MOVE F9-R-C4 TO RCVD-VAL                                LB243940
                ADD 1 TO FAIL-COUNT                                     LB243950
                PERFORM PRINT-ERRS THRU PR-OUT                          LB243960
            ELSE                                                        LB243970
              ADD 1 TO PASS-COUNT.                                      LB243980
                                                                        LB243990
            MOVE SEND-DATA TO F9-S-BSDR                                 LB244000
            MOVE G9-S-BSDR TO G9-R-C4.                                  LB244010
            IF F9-S-BSDR NOT = F9-R-C4                                  LB244020
                MOVE "F9-S-BSDR" TO TEST-ID                             LB244030
                MOVE F9-S-BSDR TO SENT-VAL                              LB244040
                MOVE F9-R-C4 TO RCVD-VAL                                LB244050
                ADD 1 TO FAIL-COUNT                                     LB244060
                PERFORM PRINT-ERRS THRU PR-OUT                          LB244070
            ELSE                                                        LB244080
              ADD 1 TO PASS-COUNT.                                      LB244090
                                                                        LB244100
            MOVE SEND-DATA TO F9-S-BS                                   LB244110
            MOVE G9-S-BS TO G9-R-C4.                                    LB244120
            IF F9-S-BS NOT = F9-R-C4                                    LB244130
                MOVE "F9-S-BS" TO TEST-ID                               LB244140
                MOVE F9-S-BS TO SENT-VAL                                LB244150
                MOVE F9-R-C4 TO RCVD-VAL                                LB244160
                ADD 1 TO FAIL-COUNT                                     LB244170
                PERFORM PRINT-ERRS THRU PR-OUT                          LB244180
            ELSE                                                        LB244190
              ADD 1 TO PASS-COUNT.                                      LB244200
                                                                        LB244210
            MOVE SEND-DATA TO F9-S-BSL                                  LB244220
            MOVE G9-S-BSL TO G9-R-C4.                                   LB244230
            IF F9-S-BSL NOT = F9-R-C4                                   LB244240
                MOVE "F9-S-BSL" TO TEST-ID                              LB244250
                MOVE F9-S-BSL TO SENT-VAL                               LB244260
                MOVE F9-R-C4 TO RCVD-VAL                                LB244270
                ADD 1 TO FAIL-COUNT                                     LB244280
                PERFORM PRINT-ERRS THRU PR-OUT                          LB244290
            ELSE                                                        LB244300
              ADD 1 TO PASS-COUNT.                                      LB244310
                                                                        LB244320
            MOVE SEND-DATA TO F9-S-BSR                                  LB244330
            MOVE G9-S-BSR TO G9-R-C4.                                   LB244340
            IF F9-S-BSR NOT = F9-R-C4                                   LB244350
                MOVE "F9-S-BSR" TO TEST-ID                              LB244360
                MOVE F9-S-BSR TO SENT-VAL                               LB244370
                MOVE F9-R-C4 TO RCVD-VAL                                LB244380
                ADD 1 TO FAIL-COUNT                                     LB244390
                PERFORM PRINT-ERRS THRU PR-OUT                          LB244400
            ELSE                                                        LB244410
              ADD 1 TO PASS-COUNT.                                      LB244420
                                                                        LB244430
            MOVE SEND-DATA TO F9-S-CSD                                  LB244440
            MOVE G9-S-CSD TO G9-R-C4.                                   LB244450
            IF F9-S-CSD NOT = F9-R-C4                                   LB244460
                MOVE "F9-S-CSD" TO TEST-ID                              LB244470
                MOVE F9-S-CSD TO SENT-VAL                               LB244480
                MOVE F9-R-C4 TO RCVD-VAL                                LB244490
                ADD 1 TO FAIL-COUNT                                     LB244500
                PERFORM PRINT-ERRS THRU PR-OUT                          LB244510
            ELSE                                                        LB244520
              ADD 1 TO PASS-COUNT.                                      LB244530
                                                                        LB244540
            MOVE SEND-DATA TO F9-S-CSDL                                 LB244550
            MOVE G9-S-CSDL TO G9-R-C4.                                  LB244560
            IF F9-S-CSDL NOT = F9-R-C4                                  LB244570
                MOVE "F9-S-CSDL" TO TEST-ID                             LB244580
                MOVE F9-S-CSDL TO SENT-VAL                              LB244590
                MOVE F9-R-C4 TO RCVD-VAL                                LB244600
                ADD 1 TO FAIL-COUNT                                     LB244610
                PERFORM PRINT-ERRS THRU PR-OUT                          LB244620
            ELSE                                                        LB244630
              ADD 1 TO PASS-COUNT.                                      LB244640
                                                                        LB244650
            MOVE SEND-DATA TO F9-S-CSDR                                 LB244660
            MOVE G9-S-CSDR TO G9-R-C4.                                  LB244670
            IF F9-S-CSDR NOT = F9-R-C4                                  LB244680
                MOVE "F9-S-CSDR" TO TEST-ID                             LB244690
                MOVE F9-S-CSDR TO SENT-VAL                              LB244700
                MOVE F9-R-C4 TO RCVD-VAL                                LB244710
                ADD 1 TO FAIL-COUNT                                     LB244720
                PERFORM PRINT-ERRS THRU PR-OUT                          LB244730
            ELSE                                                        LB244740
              ADD 1 TO PASS-COUNT.                                      LB244750
                                                                        LB244760
            MOVE SEND-DATA TO F9-S-CS                                   LB244770
            MOVE G9-S-CS TO G9-R-C4.                                    LB244780
            IF F9-S-CS NOT = F9-R-C4                                    LB244790
                MOVE "F9-S-CS" TO TEST-ID                               LB244800
                MOVE F9-S-CS TO SENT-VAL                                LB244810
                MOVE F9-R-C4 TO RCVD-VAL                                LB244820
                ADD 1 TO FAIL-COUNT                                     LB244830
                PERFORM PRINT-ERRS THRU PR-OUT                          LB244840
            ELSE                                                        LB244850
              ADD 1 TO PASS-COUNT.                                      LB244860
                                                                        LB244870
            MOVE SEND-DATA TO F9-S-CSL                                  LB244880
            MOVE G9-S-CSL TO G9-R-C4.                                   LB244890
            IF F9-S-CSL NOT = F9-R-C4                                   LB244900
                MOVE "F9-S-CSL" TO TEST-ID                              LB244910
                MOVE F9-S-CSL TO SENT-VAL                               LB244920
                MOVE F9-R-C4 TO RCVD-VAL                                LB244930
                ADD 1 TO FAIL-COUNT                                     LB244940
                PERFORM PRINT-ERRS THRU PR-OUT                          LB244950
            ELSE                                                        LB244960
              ADD 1 TO PASS-COUNT.                                      LB244970
                                                                        LB244980
            MOVE SEND-DATA TO F9-S-CSR                                  LB244990
            MOVE G9-S-CSR TO G9-R-C4.                                   LB245000
            IF F9-S-CSR NOT = F9-R-C4                                   LB245010
                MOVE "F9-S-CSR" TO TEST-ID                              LB245020
                MOVE F9-S-CSR TO SENT-VAL                               LB245030
                MOVE F9-R-C4 TO RCVD-VAL                                LB245040
                ADD 1 TO FAIL-COUNT                                     LB245050
                PERFORM PRINT-ERRS THRU PR-OUT                          LB245060
            ELSE                                                        LB245070
              ADD 1 TO PASS-COUNT.                                      LB245080
                                                                        LB245090
            MOVE SEND-DATA TO F9-S-C4SD                                 LB245100
            MOVE G9-S-C4SD TO G9-R-C4.                                  LB245110
            IF F9-S-C4SD NOT = F9-R-C4                                  LB245120
                MOVE "F9-S-C4SD" TO TEST-ID                             LB245130
                MOVE F9-S-C4SD TO SENT-VAL                              LB245140
                MOVE F9-R-C4 TO RCVD-VAL                                LB245150
                ADD 1 TO FAIL-COUNT                                     LB245160
                PERFORM PRINT-ERRS THRU PR-OUT                          LB245170
            ELSE                                                        LB245180
              ADD 1 TO PASS-COUNT.                                      LB245190
                                                                        LB245200
            MOVE SEND-DATA TO F9-S-C4SDL                                LB245210
            MOVE G9-S-C4SDL TO G9-R-C4.                                 LB245220
            IF F9-S-C4SDL NOT = F9-R-C4                                 LB245230
                MOVE "F9-S-C4SDL" TO TEST-ID                            LB245240
                MOVE F9-S-C4SDL TO SENT-VAL                             LB245250
                MOVE F9-R-C4 TO RCVD-VAL                                LB245260
                ADD 1 TO FAIL-COUNT                                     LB245270
                PERFORM PRINT-ERRS THRU PR-OUT                          LB245280
            ELSE                                                        LB245290
              ADD 1 TO PASS-COUNT.                                      LB245300
                                                                        LB245310
            MOVE SEND-DATA TO F9-S-C4SDR                                LB245320
            MOVE G9-S-C4SDR TO G9-R-C4.                                 LB245330
            IF F9-S-C4SDR NOT = F9-R-C4                                 LB245340
                MOVE "F9-S-C4SDR" TO TEST-ID                            LB245350
                MOVE F9-S-C4SDR TO SENT-VAL                             LB245360
                MOVE F9-R-C4 TO RCVD-VAL                                LB245370
                ADD 1 TO FAIL-COUNT                                     LB245380
                PERFORM PRINT-ERRS THRU PR-OUT                          LB245390
            ELSE                                                        LB245400
              ADD 1 TO PASS-COUNT.                                      LB245410
                                                                        LB245420
            MOVE SEND-DATA TO F9-S-C4S                                  LB245430
            MOVE G9-S-C4S TO G9-R-C4.                                   LB245440
            IF F9-S-C4S NOT = F9-R-C4                                   LB245450
                MOVE "F9-S-C4S" TO TEST-ID                              LB245460
                MOVE F9-S-C4S TO SENT-VAL                               LB245470
                MOVE F9-R-C4 TO RCVD-VAL                                LB245480
                ADD 1 TO FAIL-COUNT                                     LB245490
                PERFORM PRINT-ERRS THRU PR-OUT                          LB245500
            ELSE                                                        LB245510
              ADD 1 TO PASS-COUNT.                                      LB245520
                                                                        LB245530
            MOVE SEND-DATA TO F9-S-C4SL                                 LB245540
            MOVE G9-S-C4SL TO G9-R-C4.                                  LB245550
            IF F9-S-C4SL NOT = F9-R-C4                                  LB245560
                MOVE "F9-S-C4SL" TO TEST-ID                             LB245570
                MOVE F9-S-C4SL TO SENT-VAL                              LB245580
                MOVE F9-R-C4 TO RCVD-VAL                                LB245590
                ADD 1 TO FAIL-COUNT                                     LB245600
                PERFORM PRINT-ERRS THRU PR-OUT                          LB245610
            ELSE                                                        LB245620
              ADD 1 TO PASS-COUNT.                                      LB245630
                                                                        LB245640
            MOVE SEND-DATA TO F9-S-C4SR                                 LB245650
            MOVE G9-S-C4SR TO G9-R-C4.                                  LB245660
            IF F9-S-C4SR NOT = F9-R-C4                                  LB245670
                MOVE "F9-S-C4SR" TO TEST-ID                             LB245680
                MOVE F9-S-C4SR TO SENT-VAL                              LB245690
                MOVE F9-R-C4 TO RCVD-VAL                                LB245700
                ADD 1 TO FAIL-COUNT                                     LB245710
                PERFORM PRINT-ERRS THRU PR-OUT                          LB245720
            ELSE                                                        LB245730
              ADD 1 TO PASS-COUNT.                                      LB245740
                                                                        LB245750
      *********************************************************         LB245760
      *                                                        *        LB245770
      *    MOVE 18 VARIATIONS OF 10 DIGIT FIELD TO A " comp-5"   *      LB245780
      *                  RECEIVING FIELD                       *        LB245790
      *                                                        *        LB245800
      **********************************************************        LB245810
                                                                        LB245820
            MOVE SEND-DATA TO F10-S-BSD                                 LB245830
            MOVE G10-S-BSD TO G10-R-B.                                  LB245840
            IF F10-S-BSD NOT = F10-R-B                                  LB245850
                display "1. F10-S-BSD"
                MOVE "F10-S-BSD" TO TEST-ID                             LB245860
                MOVE F10-S-BSD TO SENT-VAL                              LB245870
                MOVE F10-R-B TO RCVD-VAL                                LB245880
                ADD 1 TO FAIL-COUNT                                     LB245890
                PERFORM PRINT-ERRS THRU PR-OUT                          LB245900
            ELSE                                                        LB245910
              ADD 1 TO PASS-COUNT.                                      LB245920
                                                                        LB245930
            MOVE SEND-DATA TO F10-S-BSDL                                LB245940
            MOVE G10-S-BSDL TO G10-R-B.                                 LB245950
            IF F10-S-BSDL NOT = F10-R-B                                 LB245960
                MOVE "F10-S-BSDL" TO TEST-ID                            LB245970
                MOVE F10-S-BSDL TO SENT-VAL                             LB245980
                MOVE F10-R-B TO RCVD-VAL                                LB245990
                ADD 1 TO FAIL-COUNT                                     LB246000
                PERFORM PRINT-ERRS THRU PR-OUT                          LB246010
            ELSE                                                        LB246020
              ADD 1 TO PASS-COUNT.                                      LB246030
                                                                        LB246040
            MOVE SEND-DATA TO F10-S-BSDR                                LB246050
            MOVE G10-S-BSDR TO G10-R-B.                                 LB246060
            IF F10-S-BSDR NOT = F10-R-B                                 LB246070
                MOVE "F10-S-BSDR" TO TEST-ID                            LB246080
                MOVE F10-S-BSDR TO SENT-VAL                             LB246090
                MOVE F10-R-B TO RCVD-VAL                                LB246100
                ADD 1 TO FAIL-COUNT                                     LB246110
                PERFORM PRINT-ERRS THRU PR-OUT                          LB246120
            ELSE                                                        LB246130
              ADD 1 TO PASS-COUNT.                                      LB246140
                                                                        LB246150
            MOVE SEND-DATA TO F10-S-BS                                  LB246160
            MOVE G10-S-BS TO G10-R-B.                                   LB246170
            IF F10-S-BS NOT = F10-R-B                                   LB246180
                MOVE "F10-S-BS" TO TEST-ID                              LB246190
                MOVE F10-S-BS TO SENT-VAL                               LB246200
                MOVE F10-R-B TO RCVD-VAL                                LB246210
                ADD 1 TO FAIL-COUNT                                     LB246220
                PERFORM PRINT-ERRS THRU PR-OUT                          LB246230
            ELSE                                                        LB246240
              ADD 1 TO PASS-COUNT.                                      LB246250
                                                                        LB246260
            MOVE SEND-DATA TO F10-S-BSL                                 LB246270
            MOVE G10-S-BSL TO G10-R-B.                                  LB246280
            IF F10-S-BSL NOT = F10-R-B                                  LB246290
                MOVE "F10-S-BSL" TO TEST-ID                             LB246300
                MOVE F10-S-BSL TO SENT-VAL                              LB246310
                MOVE F10-R-B TO RCVD-VAL                                LB246320
                ADD 1 TO FAIL-COUNT                                     LB246330
                PERFORM PRINT-ERRS THRU PR-OUT                          LB246340
            ELSE                                                        LB246350
              ADD 1 TO PASS-COUNT.                                      LB246360
                                                                        LB246370
            MOVE SEND-DATA TO F10-S-BSR                                 LB246380
            MOVE G10-S-BSR TO G10-R-B.                                  LB246390
            IF F10-S-BSR NOT = F10-R-B                                  LB246400
                MOVE "F10-S-BSR" TO TEST-ID                             LB246410
                MOVE F10-S-BSR TO SENT-VAL                              LB246420
                MOVE F10-R-B TO RCVD-VAL                                LB246430
                ADD 1 TO FAIL-COUNT                                     LB246440
                PERFORM PRINT-ERRS THRU PR-OUT                          LB246450
            ELSE                                                        LB246460
              ADD 1 TO PASS-COUNT.                                      LB246470
                                                                        LB246480
            MOVE SEND-DATA TO F10-S-CSD                                 LB246490
            MOVE G10-S-CSD TO G10-R-B.                                  LB246500
            IF F10-S-CSD NOT = F10-R-B                                  LB246510
                MOVE "F10-S-CSD" TO TEST-ID                             LB246520
                MOVE F10-S-CSD TO SENT-VAL                              LB246530
                MOVE F10-R-B TO RCVD-VAL                                LB246540
                ADD 1 TO FAIL-COUNT                                     LB246550
                PERFORM PRINT-ERRS THRU PR-OUT                          LB246560
            ELSE                                                        LB246570
              ADD 1 TO PASS-COUNT.                                      LB246580
                                                                        LB246590
            MOVE SEND-DATA TO F10-S-CSDL                                LB246600
            MOVE G10-S-CSDL TO G10-R-B.                                 LB246610
            IF F10-S-CSDL NOT = F10-R-B                                 LB246620
                MOVE "F10-S-CSDL" TO TEST-ID                            LB246630
                MOVE F10-S-CSDL TO SENT-VAL                             LB246640
                MOVE F10-R-B TO RCVD-VAL                                LB246650
                ADD 1 TO FAIL-COUNT                                     LB246660
                PERFORM PRINT-ERRS THRU PR-OUT                          LB246670
            ELSE                                                        LB246680
              ADD 1 TO PASS-COUNT.                                      LB246690
                                                                        LB246700
            MOVE SEND-DATA TO F10-S-CSDR                                LB246710
            MOVE G10-S-CSDR TO G10-R-B.                                 LB246720
            IF F10-S-CSDR NOT = F10-R-B                                 LB246730
                MOVE "F10-S-CSDR" TO TEST-ID                            LB246740
                MOVE F10-S-CSDR TO SENT-VAL                             LB246750
                MOVE F10-R-B TO RCVD-VAL                                LB246760
                ADD 1 TO FAIL-COUNT                                     LB246770
                PERFORM PRINT-ERRS THRU PR-OUT                          LB246780
            ELSE                                                        LB246790
              ADD 1 TO PASS-COUNT.                                      LB246800
                                                                        LB246810
            MOVE SEND-DATA TO F10-S-CS                                  LB246820
            MOVE G10-S-CS TO G10-R-B.                                   LB246830
            IF F10-S-CS NOT = F10-R-B                                   LB246840
                MOVE "F10-S-CS" TO TEST-ID                              LB246850
                MOVE F10-S-CS TO SENT-VAL                               LB246860
                MOVE F10-R-B TO RCVD-VAL                                LB246870
                ADD 1 TO FAIL-COUNT                                     LB246880
                PERFORM PRINT-ERRS THRU PR-OUT                          LB246890
            ELSE                                                        LB246900
              ADD 1 TO PASS-COUNT.                                      LB246910
                                                                        LB246920
            MOVE SEND-DATA TO F10-S-CSL                                 LB246930
            MOVE G10-S-CSL TO G10-R-B.                                  LB246940
            IF F10-S-CSL NOT = F10-R-B                                  LB246950
                MOVE "F10-S-CSL" TO TEST-ID                             LB246960
                MOVE F10-S-CSL TO SENT-VAL                              LB246970
                MOVE F10-R-B TO RCVD-VAL                                LB246980
                ADD 1 TO FAIL-COUNT                                     LB246990
                PERFORM PRINT-ERRS THRU PR-OUT                          LB247000
            ELSE                                                        LB247010
              ADD 1 TO PASS-COUNT.                                      LB247020
                                                                        LB247030
            MOVE SEND-DATA TO F10-S-CSR                                 LB247040
            MOVE G10-S-CSR TO G10-R-B.                                  LB247050
            IF F10-S-CSR NOT = F10-R-B                                  LB247060
                MOVE "F10-S-CSR" TO TEST-ID                             LB247070
                MOVE F10-S-CSR TO SENT-VAL                              LB247080
                MOVE F10-R-B TO RCVD-VAL                                LB247090
                ADD 1 TO FAIL-COUNT                                     LB247100
                PERFORM PRINT-ERRS THRU PR-OUT                          LB247110
            ELSE                                                        LB247120
              ADD 1 TO PASS-COUNT.                                      LB247130
                                                                        LB247140
            MOVE SEND-DATA TO F10-S-C4SD                                LB247150
            MOVE G10-S-C4SD TO G10-R-B.                                 LB247160
            IF F10-S-C4SD NOT = F10-R-B                                 LB247170
                MOVE "F10-S-C4SD" TO TEST-ID                            LB247180
                MOVE F10-S-C4SD TO SENT-VAL                             LB247190
                MOVE F10-R-B TO RCVD-VAL                                LB247200
                ADD 1 TO FAIL-COUNT                                     LB247210
                PERFORM PRINT-ERRS THRU PR-OUT                          LB247220
            ELSE                                                        LB247230
              ADD 1 TO PASS-COUNT.                                      LB247240
                                                                        LB247250
            MOVE SEND-DATA TO F10-S-C4SDL                               LB247260
            MOVE G10-S-C4SDL TO G10-R-B.                                LB247270
            IF F10-S-C4SDL NOT = F10-R-B                                LB247280
                MOVE "F10-S-C4SDL" TO TEST-ID                           LB247290
                MOVE F10-S-C4SDL TO SENT-VAL                            LB247300
                MOVE F10-R-B TO RCVD-VAL                                LB247310
                ADD 1 TO FAIL-COUNT                                     LB247320
                PERFORM PRINT-ERRS THRU PR-OUT                          LB247330
            ELSE                                                        LB247340
              ADD 1 TO PASS-COUNT.                                      LB247350
                                                                        LB247360
            MOVE SEND-DATA TO F10-S-C4SDR                               LB247370
            MOVE G10-S-C4SDR TO G10-R-B.                                LB247380
            IF F10-S-C4SDR NOT = F10-R-B                                LB247390
                MOVE "F10-S-C4SDR" TO TEST-ID                           LB247400
                MOVE F10-S-C4SDR TO SENT-VAL                            LB247410
                MOVE F10-R-B TO RCVD-VAL                                LB247420
                ADD 1 TO FAIL-COUNT                                     LB247430
                PERFORM PRINT-ERRS THRU PR-OUT                          LB247440
            ELSE                                                        LB247450
              ADD 1 TO PASS-COUNT.                                      LB247460
                                                                        LB247470
            MOVE SEND-DATA TO F10-S-C4S                                 LB247480
            MOVE G10-S-C4S TO G10-R-B.                                  LB247490
            IF F10-S-C4S NOT = F10-R-B                                  LB247500
                MOVE "F10-S-C4S" TO TEST-ID                             LB247510
                MOVE F10-S-C4S TO SENT-VAL                              LB247520
                MOVE F10-R-B TO RCVD-VAL                                LB247530
                ADD 1 TO FAIL-COUNT                                     LB247540
                PERFORM PRINT-ERRS THRU PR-OUT                          LB247550
            ELSE                                                        LB247560
              ADD 1 TO PASS-COUNT.                                      LB247570
                                                                        LB247580
            MOVE SEND-DATA TO F10-S-C4SL                                LB247590
            MOVE G10-S-C4SL TO G10-R-B.                                 LB247600
            IF F10-S-C4SL NOT = F10-R-B                                 LB247610
                MOVE "F10-S-C4SL" TO TEST-ID                            LB247620
                MOVE F10-S-C4SL TO SENT-VAL                             LB247630
                MOVE F10-R-B TO RCVD-VAL                                LB247640
                ADD 1 TO FAIL-COUNT                                     LB247650
                PERFORM PRINT-ERRS THRU PR-OUT                          LB247660
            ELSE                                                        LB247670
              ADD 1 TO PASS-COUNT.                                      LB247680
                                                                        LB247690
            MOVE SEND-DATA TO F10-S-C4SR                                LB247700
            MOVE G10-S-C4SR TO G10-R-B.                                 LB247710
            IF F10-S-C4SR NOT = F10-R-B                                 LB247720
                MOVE "F10-S-C4SR" TO TEST-ID                            LB247730
                MOVE F10-S-C4SR TO SENT-VAL                             LB247740
                MOVE F10-R-B TO RCVD-VAL                                LB247750
                ADD 1 TO FAIL-COUNT                                     LB247760
                PERFORM PRINT-ERRS THRU PR-OUT                          LB247770
            ELSE                                                        LB247780
              ADD 1 TO PASS-COUNT.                                      LB247790
                                                                        LB247800
                                                                        LB247810
      **********************************************************        LB247820
      *                                                         *       LB247830
      *    MOVE 18 VARIATIONS OF 10 DIGIT FIELD TO A "comp-5"   *       LB247840
      *                  RECEIVING FIELD                        *       LB247850
      *                                                         *       LB247860
      **********************************************************        LB247870
                                                                        LB247880
            MOVE SEND-DATA TO F10-S-BSD                                 LB247890
            MOVE G10-S-BSD TO G10-R-C.                                  LB247900
            IF F10-S-BSD NOT = F10-R-C                                  LB247910
                display "2. F10-S-BSD"
                MOVE "F10-S-BSD" TO TEST-ID                             LB247920
                MOVE F10-S-BSD TO SENT-VAL                              LB247930
                MOVE F10-R-C TO RCVD-VAL                                LB247940
                ADD 1 TO FAIL-COUNT                                     LB247950
                PERFORM PRINT-ERRS THRU PR-OUT                          LB247960
            ELSE                                                        LB247970
              ADD 1 TO PASS-COUNT.                                      LB247980
                                                                        LB247990
            MOVE SEND-DATA TO F10-S-BSDL                                LB248000
            MOVE G10-S-BSDL TO G10-R-C.                                 LB248010
            IF F10-S-BSDL NOT = F10-R-C                                 LB248020
                MOVE "F10-S-BSDL" TO TEST-ID                            LB248030
                MOVE F10-S-BSDL TO SENT-VAL                             LB248040
                MOVE F10-R-C TO RCVD-VAL                                LB248050
                ADD 1 TO FAIL-COUNT                                     LB248060
                PERFORM PRINT-ERRS THRU PR-OUT                          LB248070
            ELSE                                                        LB248080
              ADD 1 TO PASS-COUNT.                                      LB248090
                                                                        LB248100
            MOVE SEND-DATA TO F10-S-BSDR                                LB248110
            MOVE G10-S-BSDR TO G10-R-C.                                 LB248120
            IF F10-S-BSDR NOT = F10-R-C                                 LB248130
                MOVE "F10-S-BSDR" TO TEST-ID                            LB248140
                MOVE F10-S-BSDR TO SENT-VAL                             LB248150
                MOVE F10-R-C TO RCVD-VAL                                LB248160
                ADD 1 TO FAIL-COUNT                                     LB248170
                PERFORM PRINT-ERRS THRU PR-OUT                          LB248180
            ELSE                                                        LB248190
              ADD 1 TO PASS-COUNT.                                      LB248200
                                                                        LB248210
            MOVE SEND-DATA TO F10-S-BS                                  LB248220
            MOVE G10-S-BS TO G10-R-C.                                   LB248230
            IF F10-S-BS NOT = F10-R-C                                   LB248240
                MOVE "F10-S-BS" TO TEST-ID                              LB248250
                MOVE F10-S-BS TO SENT-VAL                               LB248260
                MOVE F10-R-C TO RCVD-VAL                                LB248270
                ADD 1 TO FAIL-COUNT                                     LB248280
                PERFORM PRINT-ERRS THRU PR-OUT                          LB248290
            ELSE                                                        LB248300
              ADD 1 TO PASS-COUNT.                                      LB248310
                                                                        LB248320
            MOVE SEND-DATA TO F10-S-BSL                                 LB248330
            MOVE G10-S-BSL TO G10-R-C.                                  LB248340
            IF F10-S-BSL NOT = F10-R-C                                  LB248350
                MOVE "F10-S-BSL" TO TEST-ID                             LB248360
                MOVE F10-S-BSL TO SENT-VAL                              LB248370
                MOVE F10-R-C TO RCVD-VAL                                LB248380
                ADD 1 TO FAIL-COUNT                                     LB248390
                PERFORM PRINT-ERRS THRU PR-OUT                          LB248400
            ELSE                                                        LB248410
              ADD 1 TO PASS-COUNT.                                      LB248420
                                                                        LB248430
            MOVE SEND-DATA TO F10-S-BSR                                 LB248440
            MOVE G10-S-BSR TO G10-R-C.                                  LB248450
            IF F10-S-BSR NOT = F10-R-C                                  LB248460
                MOVE "F10-S-BSR" TO TEST-ID                             LB248470
                MOVE F10-S-BSR TO SENT-VAL                              LB248480
                MOVE F10-R-C TO RCVD-VAL                                LB248490
                ADD 1 TO FAIL-COUNT                                     LB248500
                PERFORM PRINT-ERRS THRU PR-OUT                          LB248510
            ELSE                                                        LB248520
              ADD 1 TO PASS-COUNT.                                      LB248530
                                                                        LB248540
            MOVE SEND-DATA TO F10-S-CSD                                 LB248550
            MOVE G10-S-CSD TO G10-R-C.                                  LB248560
            IF F10-S-CSD NOT = F10-R-C                                  LB248570
                MOVE "F10-S-CSD" TO TEST-ID                             LB248580
                MOVE F10-S-CSD TO SENT-VAL                              LB248590
                MOVE F10-R-C TO RCVD-VAL                                LB248600
                ADD 1 TO FAIL-COUNT                                     LB248610
                PERFORM PRINT-ERRS THRU PR-OUT                          LB248620
            ELSE                                                        LB248630
              ADD 1 TO PASS-COUNT.                                      LB248640
                                                                        LB248650
            MOVE SEND-DATA TO F10-S-CSDL                                LB248660
            MOVE G10-S-CSDL TO G10-R-C.                                 LB248670
            IF F10-S-CSDL NOT = F10-R-C                                 LB248680
                MOVE "F10-S-CSDL" TO TEST-ID                            LB248690
                MOVE F10-S-CSDL TO SENT-VAL                             LB248700
                MOVE F10-R-C TO RCVD-VAL                                LB248710
                ADD 1 TO FAIL-COUNT                                     LB248720
                PERFORM PRINT-ERRS THRU PR-OUT                          LB248730
            ELSE                                                        LB248740
              ADD 1 TO PASS-COUNT.                                      LB248750
                                                                        LB248760
            MOVE SEND-DATA TO F10-S-CSDR                                LB248770
            MOVE G10-S-CSDR TO G10-R-C.                                 LB248780
            IF F10-S-CSDR NOT = F10-R-C                                 LB248790
                MOVE "F10-S-CSDR" TO TEST-ID                            LB248800
                MOVE F10-S-CSDR TO SENT-VAL                             LB248810
                MOVE F10-R-C TO RCVD-VAL                                LB248820
                ADD 1 TO FAIL-COUNT                                     LB248830
                PERFORM PRINT-ERRS THRU PR-OUT                          LB248840
            ELSE                                                        LB248850
              ADD 1 TO PASS-COUNT.                                      LB248860
                                                                        LB248870
            MOVE SEND-DATA TO F10-S-CS                                  LB248880
            MOVE G10-S-CS TO G10-R-C.                                   LB248890
            IF F10-S-CS NOT = F10-R-C                                   LB248900
                MOVE "F10-S-CS" TO TEST-ID                              LB248910
                MOVE F10-S-CS TO SENT-VAL                               LB248920
                MOVE F10-R-C TO RCVD-VAL                                LB248930
                ADD 1 TO FAIL-COUNT                                     LB248940
                PERFORM PRINT-ERRS THRU PR-OUT                          LB248950
            ELSE                                                        LB248960
              ADD 1 TO PASS-COUNT.                                      LB248970
                                                                        LB248980
            MOVE SEND-DATA TO F10-S-CSL                                 LB248990
            MOVE G10-S-CSL TO G10-R-C.                                  LB249000
            IF F10-S-CSL NOT = F10-R-C                                  LB249010
                MOVE "F10-S-CSL" TO TEST-ID                             LB249020
                MOVE F10-S-CSL TO SENT-VAL                              LB249030
                MOVE F10-R-C TO RCVD-VAL                                LB249040
                ADD 1 TO FAIL-COUNT                                     LB249050
                PERFORM PRINT-ERRS THRU PR-OUT                          LB249060
            ELSE                                                        LB249070
              ADD 1 TO PASS-COUNT.                                      LB249080
                                                                        LB249090
            MOVE SEND-DATA TO F10-S-CSR                                 LB249100
            MOVE G10-S-CSR TO G10-R-C.                                  LB249110
            IF F10-S-CSR NOT = F10-R-C                                  LB249120
                MOVE "F10-S-CSR" TO TEST-ID                             LB249130
                MOVE F10-S-CSR TO SENT-VAL                              LB249140
                MOVE F10-R-C TO RCVD-VAL                                LB249150
                ADD 1 TO FAIL-COUNT                                     LB249160
                PERFORM PRINT-ERRS THRU PR-OUT                          LB249170
            ELSE                                                        LB249180
              ADD 1 TO PASS-COUNT.                                      LB249190
                                                                        LB249200
            MOVE SEND-DATA TO F10-S-C4SD                                LB249210
            MOVE G10-S-C4SD TO G10-R-C.                                 LB249220
            IF F10-S-C4SD NOT = F10-R-C                                 LB249230
                MOVE "F10-S-C4SD" TO TEST-ID                            LB249240
                MOVE F10-S-C4SD TO SENT-VAL                             LB249250
                MOVE F10-R-C TO RCVD-VAL                                LB249260
                ADD 1 TO FAIL-COUNT                                     LB249270
                PERFORM PRINT-ERRS THRU PR-OUT                          LB249280
            ELSE                                                        LB249290
              ADD 1 TO PASS-COUNT.                                      LB249300
                                                                        LB249310
            MOVE SEND-DATA TO F10-S-C4SDL                               LB249320
            MOVE G10-S-C4SDL TO G10-R-C.                                LB249330
            IF F10-S-C4SDL NOT = F10-R-C                                LB249340
                MOVE "F10-S-C4SDL" TO TEST-ID                           LB249350
                MOVE F10-S-C4SDL TO SENT-VAL                            LB249360
                MOVE F10-R-C TO RCVD-VAL                                LB249370
                ADD 1 TO FAIL-COUNT                                     LB249380
                PERFORM PRINT-ERRS THRU PR-OUT                          LB249390
            ELSE                                                        LB249400
              ADD 1 TO PASS-COUNT.                                      LB249410
                                                                        LB249420
            MOVE SEND-DATA TO F10-S-C4SDR                               LB249430
            MOVE G10-S-C4SDR TO G10-R-C.                                LB249440
            IF F10-S-C4SDR NOT = F10-R-C                                LB249450
                MOVE "F10-S-C4SDR" TO TEST-ID                           LB249460
                MOVE F10-S-C4SDR TO SENT-VAL                            LB249470
                MOVE F10-R-C TO RCVD-VAL                                LB249480
                ADD 1 TO FAIL-COUNT                                     LB249490
                PERFORM PRINT-ERRS THRU PR-OUT                          LB249500
            ELSE                                                        LB249510
              ADD 1 TO PASS-COUNT.                                      LB249520
                                                                        LB249530
            MOVE SEND-DATA TO F10-S-C4S                                 LB249540
            MOVE G10-S-C4S TO G10-R-C.                                  LB249550
            IF F10-S-C4S NOT = F10-R-C                                  LB249560
                MOVE "F10-S-C4S" TO TEST-ID                             LB249570
                MOVE F10-S-C4S TO SENT-VAL                              LB249580
                MOVE F10-R-C TO RCVD-VAL                                LB249590
                ADD 1 TO FAIL-COUNT                                     LB249600
                PERFORM PRINT-ERRS THRU PR-OUT                          LB249610
            ELSE                                                        LB249620
              ADD 1 TO PASS-COUNT.                                      LB249630
                                                                        LB249640
            MOVE SEND-DATA TO F10-S-C4SL                                LB249650
            MOVE G10-S-C4SL TO G10-R-C.                                 LB249660
            IF F10-S-C4SL NOT = F10-R-C                                 LB249670
                MOVE "F10-S-C4SL" TO TEST-ID                            LB249680
                MOVE F10-S-C4SL TO SENT-VAL                             LB249690
                MOVE F10-R-C TO RCVD-VAL                                LB249700
                ADD 1 TO FAIL-COUNT                                     LB249710
                PERFORM PRINT-ERRS THRU PR-OUT                          LB249720
            ELSE                                                        LB249730
              ADD 1 TO PASS-COUNT.                                      LB249740
                                                                        LB249750
            MOVE SEND-DATA TO F10-S-C4SR                                LB249760
            MOVE G10-S-C4SR TO G10-R-C.                                 LB249770
            IF F10-S-C4SR NOT = F10-R-C                                 LB249780
                MOVE "F10-S-C4SR" TO TEST-ID                            LB249790
                MOVE F10-S-C4SR TO SENT-VAL                             LB249800
                MOVE F10-R-C TO RCVD-VAL                                LB249810
                ADD 1 TO FAIL-COUNT                                     LB249820
                PERFORM PRINT-ERRS THRU PR-OUT                          LB249830
            ELSE                                                        LB249840
              ADD 1 TO PASS-COUNT.                                      LB249850
                                                                        LB249860
                                                                        LB249870
      **********************************************************        LB249880
      *                                                         *       LB249890
      *    MOVE 18 VARIATIONS OF 10 DIGIT FIELD TO A             *      LB249900
      *      "COMPUTATIONAL-5"  RECEIVING FIELD                 *       LB249910
      *                                                         *       LB249920
      **********************************************************        LB249930
                                                                        LB249940
            MOVE SEND-DATA TO F10-S-BSD                                 LB249950
            MOVE G10-S-BSD TO G10-R-C4.                                 LB249960
            IF F10-S-BSD NOT = F10-R-C4                                 LB249970
                display "3. F10-S-BSD"
                MOVE "F10-S-BSD" TO TEST-ID                             LB249980
                MOVE F10-S-BSD TO SENT-VAL                              LB249990
                MOVE F10-R-C4 TO RCVD-VAL                               LB250000
                ADD 1 TO FAIL-COUNT                                     LB250010
                PERFORM PRINT-ERRS THRU PR-OUT                          LB250020
            ELSE                                                        LB250030
              ADD 1 TO PASS-COUNT.                                      LB250040
                                                                        LB250050
            MOVE SEND-DATA TO F10-S-BSDL                                LB250060
            MOVE G10-S-BSDL TO G10-R-C4.                                LB250070
            IF F10-S-BSDL NOT = F10-R-C4                                LB250080
                MOVE "F10-S-BSDL" TO TEST-ID                            LB250090
                MOVE F10-S-BSDL TO SENT-VAL                             LB250100
                MOVE F10-R-C4 TO RCVD-VAL                               LB250110
                ADD 1 TO FAIL-COUNT                                     LB250120
                PERFORM PRINT-ERRS THRU PR-OUT                          LB250130
            ELSE                                                        LB250140
              ADD 1 TO PASS-COUNT.                                      LB250150
                                                                        LB250160
            MOVE SEND-DATA TO F10-S-BSDR                                LB250170
            MOVE G10-S-BSDR TO G10-R-C4.                                LB250180
            IF F10-S-BSDR NOT = F10-R-C4                                LB250190
                MOVE "F10-S-BSDR" TO TEST-ID                            LB250200
                MOVE F10-S-BSDR TO SENT-VAL                             LB250210
                MOVE F10-R-C4 TO RCVD-VAL                               LB250220
                ADD 1 TO FAIL-COUNT                                     LB250230
                PERFORM PRINT-ERRS THRU PR-OUT                          LB250240
            ELSE                                                        LB250250
              ADD 1 TO PASS-COUNT.                                      LB250260
                                                                        LB250270
            MOVE SEND-DATA TO F10-S-BS                                  LB250280
            MOVE G10-S-BS TO G10-R-C4.                                  LB250290
            IF F10-S-BS NOT = F10-R-C4                                  LB250300
                MOVE "F10-S-BS" TO TEST-ID                              LB250310
                MOVE F10-S-BS TO SENT-VAL                               LB250320
                MOVE F10-R-C4 TO RCVD-VAL                               LB250330
                ADD 1 TO FAIL-COUNT                                     LB250340
                PERFORM PRINT-ERRS THRU PR-OUT                          LB250350
            ELSE                                                        LB250360
              ADD 1 TO PASS-COUNT.                                      LB250370
                                                                        LB250380
            MOVE SEND-DATA TO F10-S-BSL                                 LB250390
            MOVE G10-S-BSL TO G10-R-C4.                                 LB250400
            IF F10-S-BSL NOT = F10-R-C4                                 LB250410
                MOVE "F10-S-BSL" TO TEST-ID                             LB250420
                MOVE F10-S-BSL TO SENT-VAL                              LB250430
                MOVE F10-R-C4 TO RCVD-VAL                               LB250440
                ADD 1 TO FAIL-COUNT                                     LB250450
                PERFORM PRINT-ERRS THRU PR-OUT                          LB250460
            ELSE                                                        LB250470
              ADD 1 TO PASS-COUNT.                                      LB250480
                                                                        LB250490
            MOVE SEND-DATA TO F10-S-BSR                                 LB250500
            MOVE G10-S-BSR TO G10-R-C4.                                 LB250510
            IF F10-S-BSR NOT = F10-R-C4                                 LB250520
                MOVE "F10-S-BSR" TO TEST-ID                             LB250530
                MOVE F10-S-BSR TO SENT-VAL                              LB250540
                MOVE F10-R-C4 TO RCVD-VAL                               LB250550
                ADD 1 TO FAIL-COUNT                                     LB250560
                PERFORM PRINT-ERRS THRU PR-OUT                          LB250570
            ELSE                                                        LB250580
              ADD 1 TO PASS-COUNT.                                      LB250590
                                                                        LB250600
            MOVE SEND-DATA TO F10-S-CSD                                 LB250610
            MOVE G10-S-CSD TO G10-R-C4.                                 LB250620
            IF F10-S-CSD NOT = F10-R-C4                                 LB250630
                MOVE "F10-S-CSD" TO TEST-ID                             LB250640
                MOVE F10-S-CSD TO SENT-VAL                              LB250650
                MOVE F10-R-C4 TO RCVD-VAL                               LB250660
                ADD 1 TO FAIL-COUNT                                     LB250670
                PERFORM PRINT-ERRS THRU PR-OUT                          LB250680
            ELSE                                                        LB250690
              ADD 1 TO PASS-COUNT.                                      LB250700
                                                                        LB250710
            MOVE SEND-DATA TO F10-S-CSDL                                LB250720
            MOVE G10-S-CSDL TO G10-R-C4.                                LB250730
            IF F10-S-CSDL NOT = F10-R-C4                                LB250740
                MOVE "F10-S-CSDL" TO TEST-ID                            LB250750
                MOVE F10-S-CSDL TO SENT-VAL                             LB250760
                MOVE F10-R-C4 TO RCVD-VAL                               LB250770
                ADD 1 TO FAIL-COUNT                                     LB250780
                PERFORM PRINT-ERRS THRU PR-OUT                          LB250790
            ELSE                                                        LB250800
              ADD 1 TO PASS-COUNT.                                      LB250810
                                                                        LB250820
            MOVE SEND-DATA TO F10-S-CSDR                                LB250830
            MOVE G10-S-CSDR TO G10-R-C4.                                LB250840
            IF F10-S-CSDR NOT = F10-R-C4                                LB250850
                MOVE "F10-S-CSDR" TO TEST-ID                            LB250860
                MOVE F10-S-CSDR TO SENT-VAL                             LB250870
                MOVE F10-R-C4 TO RCVD-VAL                               LB250880
                ADD 1 TO FAIL-COUNT                                     LB250890
                PERFORM PRINT-ERRS THRU PR-OUT                          LB250900
            ELSE                                                        LB250910
              ADD 1 TO PASS-COUNT.                                      LB250920
                                                                        LB250930
            MOVE SEND-DATA TO F10-S-CS                                  LB250940
            MOVE G10-S-CS TO G10-R-C4.                                  LB250950
            IF F10-S-CS NOT = F10-R-C4                                  LB250960
                MOVE "F10-S-CS" TO TEST-ID                              LB250970
                MOVE F10-S-CS TO SENT-VAL                               LB250980
                MOVE F10-R-C4 TO RCVD-VAL                               LB250990
                ADD 1 TO FAIL-COUNT                                     LB251000
                PERFORM PRINT-ERRS THRU PR-OUT                          LB251010
            ELSE                                                        LB251020
              ADD 1 TO PASS-COUNT.                                      LB251030
                                                                        LB251040
            MOVE SEND-DATA TO F10-S-CSL                                 LB251050
            MOVE G10-S-CSL TO G10-R-C4.                                 LB251060
            IF F10-S-CSL NOT = F10-R-C4                                 LB251070
                MOVE "F10-S-CSL" TO TEST-ID                             LB251080
                MOVE F10-S-CSL TO SENT-VAL                              LB251090
                MOVE F10-R-C4 TO RCVD-VAL                               LB251100
                ADD 1 TO FAIL-COUNT                                     LB251110
                PERFORM PRINT-ERRS THRU PR-OUT                          LB251120
            ELSE                                                        LB251130
              ADD 1 TO PASS-COUNT.                                      LB251140
                                                                        LB251150
            MOVE SEND-DATA TO F10-S-CSR                                 LB251160
            MOVE G10-S-CSR TO G10-R-C4.                                 LB251170
            IF F10-S-CSR NOT = F10-R-C4                                 LB251180
                MOVE "F10-S-CSR" TO TEST-ID                             LB251190
                MOVE F10-S-CSR TO SENT-VAL                              LB251200
                MOVE F10-R-C4 TO RCVD-VAL                               LB251210
                ADD 1 TO FAIL-COUNT                                     LB251220
                PERFORM PRINT-ERRS THRU PR-OUT                          LB251230
            ELSE                                                        LB251240
              ADD 1 TO PASS-COUNT.                                      LB251250
                                                                        LB251260
            MOVE SEND-DATA TO F10-S-C4SD                                LB251270
            MOVE G10-S-C4SD TO G10-R-C4.                                LB251280
            IF F10-S-C4SD NOT = F10-R-C4                                LB251290
                MOVE "F10-S-C4SD" TO TEST-ID                            LB251300
                MOVE F10-S-C4SD TO SENT-VAL                             LB251310
                MOVE F10-R-C4 TO RCVD-VAL                               LB251320
                ADD 1 TO FAIL-COUNT                                     LB251330
                PERFORM PRINT-ERRS THRU PR-OUT                          LB251340
            ELSE                                                        LB251350
              ADD 1 TO PASS-COUNT.                                      LB251360
                                                                        LB251370
            MOVE SEND-DATA TO F10-S-C4SDL                               LB251380
            MOVE G10-S-C4SDL TO G10-R-C4.                               LB251390
            IF F10-S-C4SDL NOT = F10-R-C4                               LB251400
                MOVE "F10-S-C4SDL" TO TEST-ID                           LB251410
                MOVE F10-S-C4SDL TO SENT-VAL                            LB251420
                MOVE F10-R-C4 TO RCVD-VAL                               LB251430
                ADD 1 TO FAIL-COUNT                                     LB251440
                PERFORM PRINT-ERRS THRU PR-OUT                          LB251450
            ELSE                                                        LB251460
              ADD 1 TO PASS-COUNT.                                      LB251470
                                                                        LB251480
            MOVE SEND-DATA TO F10-S-C4SDR                               LB251490
            MOVE G10-S-C4SDR TO G10-R-C4.                               LB251500
            IF F10-S-C4SDR NOT = F10-R-C4                               LB251510
                MOVE "F10-S-C4SDR" TO TEST-ID                           LB251520
                MOVE F10-S-C4SDR TO SENT-VAL                            LB251530
                MOVE F10-R-C4 TO RCVD-VAL                               LB251540
                ADD 1 TO FAIL-COUNT                                     LB251550
                PERFORM PRINT-ERRS THRU PR-OUT                          LB251560
            ELSE                                                        LB251570
              ADD 1 TO PASS-COUNT.                                      LB251580
                                                                        LB251590
            MOVE SEND-DATA TO F10-S-C4S                                 LB251600
            MOVE G10-S-C4S TO G10-R-C4.                                 LB251610
            IF F10-S-C4S NOT = F10-R-C4                                 LB251620
                MOVE "F10-S-C4S" TO TEST-ID                             LB251630
                MOVE F10-S-C4S TO SENT-VAL                              LB251640
                MOVE F10-R-C4 TO RCVD-VAL                               LB251650
                ADD 1 TO FAIL-COUNT                                     LB251660
                PERFORM PRINT-ERRS THRU PR-OUT                          LB251670
            ELSE                                                        LB251680
              ADD 1 TO PASS-COUNT.                                      LB251690
                                                                        LB251700
            MOVE SEND-DATA TO F10-S-C4SL                                LB251710
            MOVE G10-S-C4SL TO G10-R-C4.                                LB251720
            IF F10-S-C4SL NOT = F10-R-C4                                LB251730
                MOVE "F10-S-C4SL" TO TEST-ID                            LB251740
                MOVE F10-S-C4SL TO SENT-VAL                             LB251750
                MOVE F10-R-C4 TO RCVD-VAL                               LB251760
                ADD 1 TO FAIL-COUNT                                     LB251770
                PERFORM PRINT-ERRS THRU PR-OUT                          LB251780
            ELSE                                                        LB251790
              ADD 1 TO PASS-COUNT.                                      LB251800
                                                                        LB251810
            MOVE SEND-DATA TO F10-S-C4SR                                LB251820
            MOVE G10-S-C4SR TO G10-R-C4.                                LB251830
            IF F10-S-C4SR NOT = F10-R-C4                                LB251840
                MOVE "F10-S-C4SR" TO TEST-ID                            LB251850
                MOVE F10-S-C4SR TO SENT-VAL                             LB251860
                MOVE F10-R-C4 TO RCVD-VAL                               LB251870
                ADD 1 TO FAIL-COUNT                                     LB251880
                PERFORM PRINT-ERRS THRU PR-OUT                          LB251890
            ELSE                                                        LB251900
              ADD 1 TO PASS-COUNT.                                      LB251910
                                                                        LB251920
                                                                        LB251930
      *********************************************************         LB251940
      *                                                        *        LB251950
      *    MOVE 18 VARIATIONS OF 15 DIGIT FIELD TO A " comp-5"   *      LB251960
      *                  RECEIVING FIELD                       *        LB251970
      *                                                        *        LB251980
      **********************************************************        LB251990
                                                                        LB252000
            MOVE SEND-DATA TO F15-S-BSD                                 LB252010
            MOVE G15-S-BSD TO G15-R-B.                                  LB252020
            IF F15-S-BSD NOT = F15-R-B                                  LB252030
                MOVE "F15-S-BSD" TO TEST-ID                             LB252040
                MOVE F15-S-BSD TO SENT-VAL                              LB252050
                MOVE F15-R-B TO RCVD-VAL                                LB252060
                ADD 1 TO FAIL-COUNT                                     LB252070
                PERFORM PRINT-ERRS THRU PR-OUT                          LB252080
            ELSE                                                        LB252090
              ADD 1 TO PASS-COUNT.                                      LB252100
                                                                        LB252110
            MOVE SEND-DATA TO F15-S-BSDL                                LB252120
            MOVE G15-S-BSDL TO G15-R-B.                                 LB252130
            IF F15-S-BSDL NOT = F15-R-B                                 LB252140
                MOVE "F15-S-BSDL" TO TEST-ID                            LB252150
                MOVE F15-S-BSDL TO SENT-VAL                             LB252160
                MOVE F15-R-B TO RCVD-VAL                                LB252170
                ADD 1 TO FAIL-COUNT                                     LB252180
                PERFORM PRINT-ERRS THRU PR-OUT                          LB252190
            ELSE                                                        LB252200
              ADD 1 TO PASS-COUNT.                                      LB252210
                                                                        LB252220
            MOVE SEND-DATA TO F15-S-BSDR                                LB252230
            MOVE G15-S-BSDR TO G15-R-B.                                 LB252240
            IF F15-S-BSDR NOT = F15-R-B                                 LB252250
                MOVE "F15-S-BSDR" TO TEST-ID                            LB252260
                MOVE F15-S-BSDR TO SENT-VAL                             LB252270
                MOVE F15-R-B TO RCVD-VAL                                LB252280
                ADD 1 TO FAIL-COUNT                                     LB252290
                PERFORM PRINT-ERRS THRU PR-OUT                          LB252300
            ELSE                                                        LB252310
              ADD 1 TO PASS-COUNT.                                      LB252320
                                                                        LB252330
            MOVE SEND-DATA TO F15-S-BS                                  LB252340
            MOVE G15-S-BS TO G15-R-B.                                   LB252350
            IF F15-S-BS NOT = F15-R-B                                   LB252360
                MOVE "F15-S-BS" TO TEST-ID                              LB252370
                MOVE F15-S-BS TO SENT-VAL                               LB252380
                MOVE F15-R-B TO RCVD-VAL                                LB252390
                ADD 1 TO FAIL-COUNT                                     LB252400
                PERFORM PRINT-ERRS THRU PR-OUT                          LB252410
            ELSE                                                        LB252420
              ADD 1 TO PASS-COUNT.                                      LB252430
                                                                        LB252440
            MOVE SEND-DATA TO F15-S-BSL                                 LB252450
            MOVE G15-S-BSL TO G15-R-B.                                  LB252460
            IF F15-S-BSL NOT = F15-R-B                                  LB252470
                MOVE "F15-S-BSL" TO TEST-ID                             LB252480
                MOVE F15-S-BSL TO SENT-VAL                              LB252490
                MOVE F15-R-B TO RCVD-VAL                                LB252500
                ADD 1 TO FAIL-COUNT                                     LB252510
                PERFORM PRINT-ERRS THRU PR-OUT                          LB252520
            ELSE                                                        LB252530
              ADD 1 TO PASS-COUNT.                                      LB252540
                                                                        LB252550
            MOVE SEND-DATA TO F15-S-BSR                                 LB252560
            MOVE G15-S-BSR TO G15-R-B.                                  LB252570
            IF F15-S-BSR NOT = F15-R-B                                  LB252580
                MOVE "F15-S-BSR" TO TEST-ID                             LB252590
                MOVE F15-S-BSR TO SENT-VAL                              LB252600
                MOVE F15-R-B TO RCVD-VAL                                LB252610
                ADD 1 TO FAIL-COUNT                                     LB252620
                PERFORM PRINT-ERRS THRU PR-OUT                          LB252630
            ELSE                                                        LB252640
              ADD 1 TO PASS-COUNT.                                      LB252650
                                                                        LB252660
            MOVE SEND-DATA TO F15-S-CSD                                 LB252670
            MOVE G15-S-CSD TO G15-R-B.                                  LB252680
            IF F15-S-CSD NOT = F15-R-B                                  LB252690
                MOVE "F15-S-CSD" TO TEST-ID                             LB252700
                MOVE F15-S-CSD TO SENT-VAL                              LB252710
                MOVE F15-R-B TO RCVD-VAL                                LB252720
                ADD 1 TO FAIL-COUNT                                     LB252730
                PERFORM PRINT-ERRS THRU PR-OUT                          LB252740
            ELSE                                                        LB252750
              ADD 1 TO PASS-COUNT.                                      LB252760
                                                                        LB252770
            MOVE SEND-DATA TO F15-S-CSDL                                LB252780
            MOVE G15-S-CSDL TO G15-R-B.                                 LB252790
            IF F15-S-CSDL NOT = F15-R-B                                 LB252800
                MOVE "F15-S-CSDL" TO TEST-ID                            LB252810
                MOVE F15-S-CSDL TO SENT-VAL                             LB252820
                MOVE F15-R-B TO RCVD-VAL                                LB252830
                ADD 1 TO FAIL-COUNT                                     LB252840
                PERFORM PRINT-ERRS THRU PR-OUT                          LB252850
            ELSE                                                        LB252860
              ADD 1 TO PASS-COUNT.                                      LB252870
                                                                        LB252880
            MOVE SEND-DATA TO F15-S-CSDR                                LB252890
            MOVE G15-S-CSDR TO G15-R-B.                                 LB252900
            IF F15-S-CSDR NOT = F15-R-B                                 LB252910
                MOVE "F15-S-CSDR" TO TEST-ID                            LB252920
                MOVE F15-S-CSDR TO SENT-VAL                             LB252930
                MOVE F15-R-B TO RCVD-VAL                                LB252940
                ADD 1 TO FAIL-COUNT                                     LB252950
                PERFORM PRINT-ERRS THRU PR-OUT                          LB252960
            ELSE                                                        LB252970
              ADD 1 TO PASS-COUNT.                                      LB252980
                                                                        LB252990
            MOVE SEND-DATA TO F15-S-CS                                  LB253000
            MOVE G15-S-CS TO G15-R-B.                                   LB253010
            IF F15-S-CS NOT = F15-R-B                                   LB253020
                MOVE "F15-S-CS" TO TEST-ID                              LB253030
                MOVE F15-S-CS TO SENT-VAL                               LB253040
                MOVE F15-R-B TO RCVD-VAL                                LB253050
                ADD 1 TO FAIL-COUNT                                     LB253060
                PERFORM PRINT-ERRS THRU PR-OUT                          LB253070
            ELSE                                                        LB253080
              ADD 1 TO PASS-COUNT.                                      LB253090
                                                                        LB253100
            MOVE SEND-DATA TO F15-S-CSL                                 LB253110
            MOVE G15-S-CSL TO G15-R-B.                                  LB253120
            IF F15-S-CSL NOT = F15-R-B                                  LB253130
                MOVE "F15-S-CSL" TO TEST-ID                             LB253140
                MOVE F15-S-CSL TO SENT-VAL                              LB253150
                MOVE F15-R-B TO RCVD-VAL                                LB253160
                ADD 1 TO FAIL-COUNT                                     LB253170
                PERFORM PRINT-ERRS THRU PR-OUT                          LB253180
            ELSE                                                        LB253190
              ADD 1 TO PASS-COUNT.                                      LB253200
                                                                        LB253210
            MOVE SEND-DATA TO F15-S-CSR                                 LB253220
            MOVE G15-S-CSR TO G15-R-B.                                  LB253230
            IF F15-S-CSR NOT = F15-R-B                                  LB253240
                MOVE "F15-S-CSR" TO TEST-ID                             LB253250
                MOVE F15-S-CSR TO SENT-VAL                              LB253260
                MOVE F15-R-B TO RCVD-VAL                                LB253270
                ADD 1 TO FAIL-COUNT                                     LB253280
                PERFORM PRINT-ERRS THRU PR-OUT                          LB253290
            ELSE                                                        LB253300
              ADD 1 TO PASS-COUNT.                                      LB253310
                                                                        LB253320
            MOVE SEND-DATA TO F15-S-C4SD                                LB253330
            MOVE G15-S-C4SD TO G15-R-B.                                 LB253340
            IF F15-S-C4SD NOT = F15-R-B                                 LB253350
                MOVE "F15-S-C4SD" TO TEST-ID                            LB253360
                MOVE F15-S-C4SD TO SENT-VAL                             LB253370
                MOVE F15-R-B TO RCVD-VAL                                LB253380
                ADD 1 TO FAIL-COUNT                                     LB253390
                PERFORM PRINT-ERRS THRU PR-OUT                          LB253400
            ELSE                                                        LB253410
              ADD 1 TO PASS-COUNT.                                      LB253420
                                                                        LB253430
            MOVE SEND-DATA TO F15-S-C4SDL                               LB253440
            MOVE G15-S-C4SDL TO G15-R-B.                                LB253450
            IF F15-S-C4SDL NOT = F15-R-B                                LB253460
                MOVE "F15-S-C4SDL" TO TEST-ID                           LB253470
                MOVE F15-S-C4SDL TO SENT-VAL                            LB253480
                MOVE F15-R-B TO RCVD-VAL                                LB253490
                ADD 1 TO FAIL-COUNT                                     LB253500
                PERFORM PRINT-ERRS THRU PR-OUT                          LB253510
            ELSE                                                        LB253520
              ADD 1 TO PASS-COUNT.                                      LB253530
                                                                        LB253540
            MOVE SEND-DATA TO F15-S-C4SDR                               LB253550
            MOVE G15-S-C4SDR TO G15-R-B.                                LB253560
            IF F15-S-C4SDR NOT = F15-R-B                                LB253570
                MOVE "F15-S-C4SDR" TO TEST-ID                           LB253580
                MOVE F15-S-C4SDR TO SENT-VAL                            LB253590
                MOVE F15-R-B TO RCVD-VAL                                LB253600
                ADD 1 TO FAIL-COUNT                                     LB253610
                PERFORM PRINT-ERRS THRU PR-OUT                          LB253620
            ELSE                                                        LB253630
              ADD 1 TO PASS-COUNT.                                      LB253640
                                                                        LB253650
            MOVE SEND-DATA TO F15-S-C4S                                 LB253660
            MOVE G15-S-C4S TO G15-R-B.                                  LB253670
            IF F15-S-C4S NOT = F15-R-B                                  LB253680
                MOVE "F15-S-C4S" TO TEST-ID                             LB253690
                MOVE F15-S-C4S TO SENT-VAL                              LB253700
                MOVE F15-R-B TO RCVD-VAL                                LB253710
                ADD 1 TO FAIL-COUNT                                     LB253720
                PERFORM PRINT-ERRS THRU PR-OUT                          LB253730
            ELSE                                                        LB253740
              ADD 1 TO PASS-COUNT.                                      LB253750
                                                                        LB253760
            MOVE SEND-DATA TO F15-S-C4SL                                LB253770
            MOVE G15-S-C4SL TO G15-R-B.                                 LB253780
            IF F15-S-C4SL NOT = F15-R-B                                 LB253790
                MOVE "F15-S-C4SL" TO TEST-ID                            LB253800
                MOVE F15-S-C4SL TO SENT-VAL                             LB253810
                MOVE F15-R-B TO RCVD-VAL                                LB253820
                ADD 1 TO FAIL-COUNT                                     LB253830
                PERFORM PRINT-ERRS THRU PR-OUT                          LB253840
            ELSE                                                        LB253850
              ADD 1 TO PASS-COUNT.                                      LB253860
                                                                        LB253870
            MOVE SEND-DATA TO F15-S-C4SR                                LB253880
            MOVE G15-S-C4SR TO G15-R-B.                                 LB253890
            IF F15-S-C4SR NOT = F15-R-B                                 LB253900
                MOVE "F15-S-C4SR" TO TEST-ID                            LB253910
                MOVE F15-S-C4SR TO SENT-VAL                             LB253920
                MOVE F15-R-B TO RCVD-VAL                                LB253930
                ADD 1 TO FAIL-COUNT                                     LB253940
                PERFORM PRINT-ERRS THRU PR-OUT                          LB253950
            ELSE                                                        LB253960
              ADD 1 TO PASS-COUNT.                                      LB253970
                                                                        LB253980
                                                                        LB253990
      **********************************************************        LB254000
      *                                                         *       LB254010
      *    MOVE 18 VARIATIONS OF 15 DIGIT FIELD TO A "comp-5"   *       LB254020
      *                  RECEIVING FIELD                        *       LB254030
      *                                                         *       LB254040
      **********************************************************        LB254050
                                                                        LB254060
            MOVE SEND-DATA TO F15-S-BSD                                 LB254070
            MOVE G15-S-BSD TO G15-R-C.                                  LB254080
            IF F15-S-BSD NOT = F15-R-C                                  LB254090
                MOVE "F15-S-BSD" TO TEST-ID                             LB254100
                MOVE F15-S-BSD TO SENT-VAL                              LB254110
                MOVE F15-R-C TO RCVD-VAL                                LB254120
                ADD 1 TO FAIL-COUNT                                     LB254130
                PERFORM PRINT-ERRS THRU PR-OUT                          LB254140
            ELSE                                                        LB254150
              ADD 1 TO PASS-COUNT.                                      LB254160
                                                                        LB254170
            MOVE SEND-DATA TO F15-S-BSDL                                LB254180
            MOVE G15-S-BSDL TO G15-R-C.                                 LB254190
            IF F15-S-BSDL NOT = F15-R-C                                 LB254200
                MOVE "F15-S-BSDL" TO TEST-ID                            LB254210
                MOVE F15-S-BSDL TO SENT-VAL                             LB254220
                MOVE F15-R-C TO RCVD-VAL                                LB254230
                ADD 1 TO FAIL-COUNT                                     LB254240
                PERFORM PRINT-ERRS THRU PR-OUT                          LB254250
            ELSE                                                        LB254260
              ADD 1 TO PASS-COUNT.                                      LB254270
                                                                        LB254280
            MOVE SEND-DATA TO F15-S-BSDR                                LB254290
            MOVE G15-S-BSDR TO G15-R-C.                                 LB254300
            IF F15-S-BSDR NOT = F15-R-C                                 LB254310
                MOVE "F15-S-BSDR" TO TEST-ID                            LB254320
                MOVE F15-S-BSDR TO SENT-VAL                             LB254330
                MOVE F15-R-C TO RCVD-VAL                                LB254340
                ADD 1 TO FAIL-COUNT                                     LB254350
                PERFORM PRINT-ERRS THRU PR-OUT                          LB254360
            ELSE                                                        LB254370
              ADD 1 TO PASS-COUNT.                                      LB254380
                                                                        LB254390
            MOVE SEND-DATA TO F15-S-BS                                  LB254400
            MOVE G15-S-BS TO G15-R-C.                                   LB254410
            IF F15-S-BS NOT = F15-R-C                                   LB254420
                MOVE "F15-S-BS" TO TEST-ID                              LB254430
                MOVE F15-S-BS TO SENT-VAL                               LB254440
                MOVE F15-R-C TO RCVD-VAL                                LB254450
                ADD 1 TO FAIL-COUNT                                     LB254460
                PERFORM PRINT-ERRS THRU PR-OUT                          LB254470
            ELSE                                                        LB254480
              ADD 1 TO PASS-COUNT.                                      LB254490
                                                                        LB254500
            MOVE SEND-DATA TO F15-S-BSL                                 LB254510
            MOVE G15-S-BSL TO G15-R-C.                                  LB254520
            IF F15-S-BSL NOT = F15-R-C                                  LB254530
                MOVE "F15-S-BSL" TO TEST-ID                             LB254540
                MOVE F15-S-BSL TO SENT-VAL                              LB254550
                MOVE F15-R-C TO RCVD-VAL                                LB254560
                ADD 1 TO FAIL-COUNT                                     LB254570
                PERFORM PRINT-ERRS THRU PR-OUT                          LB254580
            ELSE                                                        LB254590
              ADD 1 TO PASS-COUNT.                                      LB254600
                                                                        LB254610
            MOVE SEND-DATA TO F15-S-BSR                                 LB254620
            MOVE G15-S-BSR TO G15-R-C.                                  LB254630
            IF F15-S-BSR NOT = F15-R-C                                  LB254640
                MOVE "F15-S-BSR" TO TEST-ID                             LB254650
                MOVE F15-S-BSR TO SENT-VAL                              LB254660
                MOVE F15-R-C TO RCVD-VAL                                LB254670
                ADD 1 TO FAIL-COUNT                                     LB254680
                PERFORM PRINT-ERRS THRU PR-OUT                          LB254690
            ELSE                                                        LB254700
              ADD 1 TO PASS-COUNT.                                      LB254710
                                                                        LB254720
            MOVE SEND-DATA TO F15-S-CSD                                 LB254730
            MOVE G15-S-CSD TO G15-R-C.                                  LB254740
            IF F15-S-CSD NOT = F15-R-C                                  LB254750
                MOVE "F15-S-CSD" TO TEST-ID                             LB254760
                MOVE F15-S-CSD TO SENT-VAL                              LB254770
                MOVE F15-R-C TO RCVD-VAL                                LB254780
                ADD 1 TO FAIL-COUNT                                     LB254790
                PERFORM PRINT-ERRS THRU PR-OUT                          LB254800
            ELSE                                                        LB254810
              ADD 1 TO PASS-COUNT.                                      LB254820
                                                                        LB254830
            MOVE SEND-DATA TO F15-S-CSDL                                LB254840
            MOVE G15-S-CSDL TO G15-R-C.                                 LB254850
            IF F15-S-CSDL NOT = F15-R-C                                 LB254860
                MOVE "F15-S-CSDL" TO TEST-ID                            LB254870
                MOVE F15-S-CSDL TO SENT-VAL                             LB254880
                MOVE F15-R-C TO RCVD-VAL                                LB254890
                ADD 1 TO FAIL-COUNT                                     LB254900
                PERFORM PRINT-ERRS THRU PR-OUT                          LB254910
            ELSE                                                        LB254920
              ADD 1 TO PASS-COUNT.                                      LB254930
                                                                        LB254940
            MOVE SEND-DATA TO F15-S-CSDR                                LB254950
            MOVE G15-S-CSDR TO G15-R-C.                                 LB254960
            IF F15-S-CSDR NOT = F15-R-C                                 LB254970
                MOVE "F15-S-CSDR" TO TEST-ID                            LB254980
                MOVE F15-S-CSDR TO SENT-VAL                             LB254990
                MOVE F15-R-C TO RCVD-VAL                                LB255000
                ADD 1 TO FAIL-COUNT                                     LB255010
                PERFORM PRINT-ERRS THRU PR-OUT                          LB255020
            ELSE                                                        LB255030
              ADD 1 TO PASS-COUNT.                                      LB255040
                                                                        LB255050
            MOVE SEND-DATA TO F15-S-CS                                  LB255060
            MOVE G15-S-CS TO G15-R-C.                                   LB255070
            IF F15-S-CS NOT = F15-R-C                                   LB255080
                MOVE "F15-S-CS" TO TEST-ID                              LB255090
                MOVE F15-S-CS TO SENT-VAL                               LB255100
                MOVE F15-R-C TO RCVD-VAL                                LB255110
                ADD 1 TO FAIL-COUNT                                     LB255120
                PERFORM PRINT-ERRS THRU PR-OUT                          LB255130
            ELSE                                                        LB255140
              ADD 1 TO PASS-COUNT.                                      LB255150
                                                                        LB255160
            MOVE SEND-DATA TO F15-S-CSL                                 LB255170
            MOVE G15-S-CSL TO G15-R-C.                                  LB255180
            IF F15-S-CSL NOT = F15-R-C                                  LB255190
                MOVE "F15-S-CSL" TO TEST-ID                             LB255200
                MOVE F15-S-CSL TO SENT-VAL                              LB255210
                MOVE F15-R-C TO RCVD-VAL                                LB255220
                ADD 1 TO FAIL-COUNT                                     LB255230
                PERFORM PRINT-ERRS THRU PR-OUT                          LB255240
            ELSE                                                        LB255250
              ADD 1 TO PASS-COUNT.                                      LB255260
                                                                        LB255270
            MOVE SEND-DATA TO F15-S-CSR                                 LB255280
            MOVE G15-S-CSR TO G15-R-C.                                  LB255290
            IF F15-S-CSR NOT = F15-R-C                                  LB255300
                MOVE "F15-S-CSR" TO TEST-ID                             LB255310
                MOVE F15-S-CSR TO SENT-VAL                              LB255320
                MOVE F15-R-C TO RCVD-VAL                                LB255330
                ADD 1 TO FAIL-COUNT                                     LB255340
                PERFORM PRINT-ERRS THRU PR-OUT                          LB255350
            ELSE                                                        LB255360
              ADD 1 TO PASS-COUNT.                                      LB255370
                                                                        LB255380
            MOVE SEND-DATA TO F15-S-C4SD                                LB255390
            MOVE G15-S-C4SD TO G15-R-C.                                 LB255400
            IF F15-S-C4SD NOT = F15-R-C                                 LB255410
                MOVE "F15-S-C4SD" TO TEST-ID                            LB255420
                MOVE F15-S-C4SD TO SENT-VAL                             LB255430
                MOVE F15-R-C TO RCVD-VAL                                LB255440
                ADD 1 TO FAIL-COUNT                                     LB255450
                PERFORM PRINT-ERRS THRU PR-OUT                          LB255460
            ELSE                                                        LB255470
              ADD 1 TO PASS-COUNT.                                      LB255480
                                                                        LB255490
            MOVE SEND-DATA TO F15-S-C4SDL                               LB255500
            MOVE G15-S-C4SDL TO G15-R-C.                                LB255510
            IF F15-S-C4SDL NOT = F15-R-C                                LB255520
                MOVE "F15-S-C4SDL" TO TEST-ID                           LB255530
                MOVE F15-S-C4SDL TO SENT-VAL                            LB255540
                MOVE F15-R-C TO RCVD-VAL                                LB255550
                ADD 1 TO FAIL-COUNT                                     LB255560
                PERFORM PRINT-ERRS THRU PR-OUT                          LB255570
            ELSE                                                        LB255580
              ADD 1 TO PASS-COUNT.                                      LB255590
                                                                        LB255600
            MOVE SEND-DATA TO F15-S-C4SDR                               LB255610
            MOVE G15-S-C4SDR TO G15-R-C.                                LB255620
            IF F15-S-C4SDR NOT = F15-R-C                                LB255630
                MOVE "F15-S-C4SDR" TO TEST-ID                           LB255640
                MOVE F15-S-C4SDR TO SENT-VAL                            LB255650
                MOVE F15-R-C TO RCVD-VAL                                LB255660
                ADD 1 TO FAIL-COUNT                                     LB255670
                PERFORM PRINT-ERRS THRU PR-OUT                          LB255680
            ELSE                                                        LB255690
              ADD 1 TO PASS-COUNT.                                      LB255700
                                                                        LB255710
            MOVE SEND-DATA TO F15-S-C4S                                 LB255720
            MOVE G15-S-C4S TO G15-R-C.                                  LB255730
            IF F15-S-C4S NOT = F15-R-C                                  LB255740
                MOVE "F15-S-C4S" TO TEST-ID                             LB255750
                MOVE F15-S-C4S TO SENT-VAL                              LB255760
                MOVE F15-R-C TO RCVD-VAL                                LB255770
                ADD 1 TO FAIL-COUNT                                     LB255780
                PERFORM PRINT-ERRS THRU PR-OUT                          LB255790
            ELSE                                                        LB255800
              ADD 1 TO PASS-COUNT.                                      LB255810
                                                                        LB255820
            MOVE SEND-DATA TO F15-S-C4SL                                LB255830
            MOVE G15-S-C4SL TO G15-R-C.                                 LB255840
            IF F15-S-C4SL NOT = F15-R-C                                 LB255850
                MOVE "F15-S-C4SL" TO TEST-ID                            LB255860
                MOVE F15-S-C4SL TO SENT-VAL                             LB255870
                MOVE F15-R-C TO RCVD-VAL                                LB255880
                ADD 1 TO FAIL-COUNT                                     LB255890
                PERFORM PRINT-ERRS THRU PR-OUT                          LB255900
            ELSE                                                        LB255910
              ADD 1 TO PASS-COUNT.                                      LB255920
                                                                        LB255930
            MOVE SEND-DATA TO F15-S-C4SR                                LB255940
            MOVE G15-S-C4SR TO G15-R-C.                                 LB255950
            IF F15-S-C4SR NOT = F15-R-C                                 LB255960
                MOVE "F15-S-C4SR" TO TEST-ID                            LB255970
                MOVE F15-S-C4SR TO SENT-VAL                             LB255980
                MOVE F15-R-C TO RCVD-VAL                                LB255990
                ADD 1 TO FAIL-COUNT                                     LB256000
                PERFORM PRINT-ERRS THRU PR-OUT                          LB256010
            ELSE                                                        LB256020
              ADD 1 TO PASS-COUNT.                                      LB256030
                                                                        LB256040
                                                                        LB256050
      **********************************************************        LB256060
      *                                                         *       LB256070
      *    MOVE 18 VARIATIONS OF 15 DIGIT FIELD TO A             *      LB256080
      *      "COMPUTATIONAL-5"  RECEIVING FIELD                 *       LB256090
      *                                                         *       LB256100
      **********************************************************        LB256110
                                                                        LB256120
            MOVE SEND-DATA TO F15-S-BSD                                 LB256130
            MOVE G15-S-BSD TO G15-R-C4.                                 LB256140
            IF F15-S-BSD NOT = F15-R-C4                                 LB256150
                MOVE "F15-S-BSD" TO TEST-ID                             LB256160
                MOVE F15-S-BSD TO SENT-VAL                              LB256170
                MOVE F15-R-C4 TO RCVD-VAL                               LB256180
                ADD 1 TO FAIL-COUNT                                     LB256190
                PERFORM PRINT-ERRS THRU PR-OUT                          LB256200
            ELSE                                                        LB256210
              ADD 1 TO PASS-COUNT.                                      LB256220
                                                                        LB256230
            MOVE SEND-DATA TO F15-S-BSDL                                LB256240
            MOVE G15-S-BSDL TO G15-R-C4.                                LB256250
            IF F15-S-BSDL NOT = F15-R-C4                                LB256260
                MOVE "F15-S-BSDL" TO TEST-ID                            LB256270
                MOVE F15-S-BSDL TO SENT-VAL                             LB256280
                MOVE F15-R-C4 TO RCVD-VAL                               LB256290
                ADD 1 TO FAIL-COUNT                                     LB256300
                PERFORM PRINT-ERRS THRU PR-OUT                          LB256310
            ELSE                                                        LB256320
              ADD 1 TO PASS-COUNT.                                      LB256330
                                                                        LB256340
            MOVE SEND-DATA TO F15-S-BSDR                                LB256350
            MOVE G15-S-BSDR TO G15-R-C4.                                LB256360
            IF F15-S-BSDR NOT = F15-R-C4                                LB256370
                MOVE "F15-S-BSDR" TO TEST-ID                            LB256380
                MOVE F15-S-BSDR TO SENT-VAL                             LB256390
                MOVE F15-R-C4 TO RCVD-VAL                               LB256400
                ADD 1 TO FAIL-COUNT                                     LB256410
                PERFORM PRINT-ERRS THRU PR-OUT                          LB256420
            ELSE                                                        LB256430
              ADD 1 TO PASS-COUNT.                                      LB256440
                                                                        LB256450
            MOVE SEND-DATA TO F15-S-BS                                  LB256460
            MOVE G15-S-BS TO G15-R-C4.                                  LB256470
            IF F15-S-BS NOT = F15-R-C4                                  LB256480
                MOVE "F15-S-BS" TO TEST-ID                              LB256490
                MOVE F15-S-BS TO SENT-VAL                               LB256500
                MOVE F15-R-C4 TO RCVD-VAL                               LB256510
                ADD 1 TO FAIL-COUNT                                     LB256520
                PERFORM PRINT-ERRS THRU PR-OUT                          LB256530
            ELSE                                                        LB256540
              ADD 1 TO PASS-COUNT.                                      LB256550
                                                                        LB256560
            MOVE SEND-DATA TO F15-S-BSL                                 LB256570
            MOVE G15-S-BSL TO G15-R-C4.                                 LB256580
            IF F15-S-BSL NOT = F15-R-C4                                 LB256590
                MOVE "F15-S-BSL" TO TEST-ID                             LB256600
                MOVE F15-S-BSL TO SENT-VAL                              LB256610
                MOVE F15-R-C4 TO RCVD-VAL                               LB256620
                ADD 1 TO FAIL-COUNT                                     LB256630
                PERFORM PRINT-ERRS THRU PR-OUT                          LB256640
            ELSE                                                        LB256650
              ADD 1 TO PASS-COUNT.                                      LB256660
                                                                        LB256670
            MOVE SEND-DATA TO F15-S-BSR                                 LB256680
            MOVE G15-S-BSR TO G15-R-C4.                                 LB256690
            IF F15-S-BSR NOT = F15-R-C4                                 LB256700
                MOVE "F15-S-BSR" TO TEST-ID                             LB256710
                MOVE F15-S-BSR TO SENT-VAL                              LB256720
                MOVE F15-R-C4 TO RCVD-VAL                               LB256730
                ADD 1 TO FAIL-COUNT                                     LB256740
                PERFORM PRINT-ERRS THRU PR-OUT                          LB256750
            ELSE                                                        LB256760
              ADD 1 TO PASS-COUNT.                                      LB256770
                                                                        LB256780
            MOVE SEND-DATA TO F15-S-CSD                                 LB256790
            MOVE G15-S-CSD TO G15-R-C4.                                 LB256800
            IF F15-S-CSD NOT = F15-R-C4                                 LB256810
                MOVE "F15-S-CSD" TO TEST-ID                             LB256820
                MOVE F15-S-CSD TO SENT-VAL                              LB256830
                MOVE F15-R-C4 TO RCVD-VAL                               LB256840
                ADD 1 TO FAIL-COUNT                                     LB256850
                PERFORM PRINT-ERRS THRU PR-OUT                          LB256860
            ELSE                                                        LB256870
              ADD 1 TO PASS-COUNT.                                      LB256880
                                                                        LB256890
            MOVE SEND-DATA TO F15-S-CSDL                                LB256900
            MOVE G15-S-CSDL TO G15-R-C4.                                LB256910
            IF F15-S-CSDL NOT = F15-R-C4                                LB256920
                MOVE "F15-S-CSDL" TO TEST-ID                            LB256930
                MOVE F15-S-CSDL TO SENT-VAL                             LB256940
                MOVE F15-R-C4 TO RCVD-VAL                               LB256950
                ADD 1 TO FAIL-COUNT                                     LB256960
                PERFORM PRINT-ERRS THRU PR-OUT                          LB256970
            ELSE                                                        LB256980
              ADD 1 TO PASS-COUNT.                                      LB256990
                                                                        LB257000
            MOVE SEND-DATA TO F15-S-CSDR                                LB257010
            MOVE G15-S-CSDR TO G15-R-C4.                                LB257020
            IF F15-S-CSDR NOT = F15-R-C4                                LB257030
                MOVE "F15-S-CSDR" TO TEST-ID                            LB257040
                MOVE F15-S-CSDR TO SENT-VAL                             LB257050
                MOVE F15-R-C4 TO RCVD-VAL                               LB257060
                ADD 1 TO FAIL-COUNT                                     LB257070
                PERFORM PRINT-ERRS THRU PR-OUT                          LB257080
            ELSE                                                        LB257090
              ADD 1 TO PASS-COUNT.                                      LB257100
                                                                        LB257110
            MOVE SEND-DATA TO F15-S-CS                                  LB257120
            MOVE G15-S-CS TO G15-R-C4.                                  LB257130
            IF F15-S-CS NOT = F15-R-C4                                  LB257140
                MOVE "F15-S-CS" TO TEST-ID                              LB257150
                MOVE F15-S-CS TO SENT-VAL                               LB257160
                MOVE F15-R-C4 TO RCVD-VAL                               LB257170
                ADD 1 TO FAIL-COUNT                                     LB257180
                PERFORM PRINT-ERRS THRU PR-OUT                          LB257190
            ELSE                                                        LB257200
              ADD 1 TO PASS-COUNT.                                      LB257210
                                                                        LB257220
            MOVE SEND-DATA TO F15-S-CSL                                 LB257230
            MOVE G15-S-CSL TO G15-R-C4.                                 LB257240
            IF F15-S-CSL NOT = F15-R-C4                                 LB257250
                MOVE "F15-S-CSL" TO TEST-ID                             LB257260
                MOVE F15-S-CSL TO SENT-VAL                              LB257270
                MOVE F15-R-C4 TO RCVD-VAL                               LB257280
                ADD 1 TO FAIL-COUNT                                     LB257290
                PERFORM PRINT-ERRS THRU PR-OUT                          LB257300
            ELSE                                                        LB257310
              ADD 1 TO PASS-COUNT.                                      LB257320
                                                                        LB257330
            MOVE SEND-DATA TO F15-S-CSR                                 LB257340
            MOVE G15-S-CSR TO G15-R-C4.                                 LB257350
            IF F15-S-CSR NOT = F15-R-C4                                 LB257360
                MOVE "F15-S-CSR" TO TEST-ID                             LB257370
                MOVE F15-S-CSR TO SENT-VAL                              LB257380
                MOVE F15-R-C4 TO RCVD-VAL                               LB257390
                ADD 1 TO FAIL-COUNT                                     LB257400
                PERFORM PRINT-ERRS THRU PR-OUT                          LB257410
            ELSE                                                        LB257420
              ADD 1 TO PASS-COUNT.                                      LB257430
                                                                        LB257440
            MOVE SEND-DATA TO F15-S-C4SD                                LB257450
            MOVE G15-S-C4SD TO G15-R-C4.                                LB257460
            IF F15-S-C4SD NOT = F15-R-C4                                LB257470
                MOVE "F15-S-C4SD" TO TEST-ID                            LB257480
                MOVE F15-S-C4SD TO SENT-VAL                             LB257490
                MOVE F15-R-C4 TO RCVD-VAL                               LB257500
                ADD 1 TO FAIL-COUNT                                     LB257510
                PERFORM PRINT-ERRS THRU PR-OUT                          LB257520
            ELSE                                                        LB257530
              ADD 1 TO PASS-COUNT.                                      LB257540
                                                                        LB257550
            MOVE SEND-DATA TO F15-S-C4SDL                               LB257560
            MOVE G15-S-C4SDL TO G15-R-C4.                               LB257570
            IF F15-S-C4SDL NOT = F15-R-C4                               LB257580
                MOVE "F15-S-C4SDL" TO TEST-ID                           LB257590
                MOVE F15-S-C4SDL TO SENT-VAL                            LB257600
                MOVE F15-R-C4 TO RCVD-VAL                               LB257610
                ADD 1 TO FAIL-COUNT                                     LB257620
                PERFORM PRINT-ERRS THRU PR-OUT                          LB257630
            ELSE                                                        LB257640
              ADD 1 TO PASS-COUNT.                                      LB257650
                                                                        LB257660
            MOVE SEND-DATA TO F15-S-C4SDR                               LB257670
            MOVE G15-S-C4SDR TO G15-R-C4.                               LB257680
            IF F15-S-C4SDR NOT = F15-R-C4                               LB257690
                MOVE "F15-S-C4SDR" TO TEST-ID                           LB257700
                MOVE F15-S-C4SDR TO SENT-VAL                            LB257710
                MOVE F15-R-C4 TO RCVD-VAL                               LB257720
                ADD 1 TO FAIL-COUNT                                     LB257730
                PERFORM PRINT-ERRS THRU PR-OUT                          LB257740
            ELSE                                                        LB257750
              ADD 1 TO PASS-COUNT.                                      LB257760
                                                                        LB257770
            MOVE SEND-DATA TO F15-S-C4S                                 LB257780
            MOVE G15-S-C4S TO G15-R-C4.                                 LB257790
            IF F15-S-C4S NOT = F15-R-C4                                 LB257800
                MOVE "F15-S-C4S" TO TEST-ID                             LB257810
                MOVE F15-S-C4S TO SENT-VAL                              LB257820
                MOVE F15-R-C4 TO RCVD-VAL                               LB257830
                ADD 1 TO FAIL-COUNT                                     LB257840
                PERFORM PRINT-ERRS THRU PR-OUT                          LB257850
            ELSE                                                        LB257860
              ADD 1 TO PASS-COUNT.                                      LB257870
                                                                        LB257880
            MOVE SEND-DATA TO F15-S-C4SL                                LB257890
            MOVE G15-S-C4SL TO G15-R-C4.                                LB257900
            IF F15-S-C4SL NOT = F15-R-C4                                LB257910
                MOVE "F15-S-C4SL" TO TEST-ID                            LB257920
                MOVE F15-S-C4SL TO SENT-VAL                             LB257930
                MOVE F15-R-C4 TO RCVD-VAL                               LB257940
                ADD 1 TO FAIL-COUNT                                     LB257950
                PERFORM PRINT-ERRS THRU PR-OUT                          LB257960
            ELSE                                                        LB257970
              ADD 1 TO PASS-COUNT.                                      LB257980
                                                                        LB257990
            MOVE SEND-DATA TO F15-S-C4SR                                LB258000
            MOVE G15-S-C4SR TO G15-R-C4.                                LB258010
            IF F15-S-C4SR NOT = F15-R-C4                                LB258020
                MOVE "F15-S-C4SR" TO TEST-ID                            LB258030
                MOVE F15-S-C4SR TO SENT-VAL                             LB258040
                MOVE F15-R-C4 TO RCVD-VAL                               LB258050
                ADD 1 TO FAIL-COUNT                                     LB258060
                PERFORM PRINT-ERRS THRU PR-OUT                          LB258070
            ELSE                                                        LB258080
              ADD 1 TO PASS-COUNT.                                      LB258090
                                                                        LB258100
                                                                        LB258110
      **********************************************************        LB258120
      *                                                         *       LB258130
      *    MOVE 18 VARIATIONS OF 18 DIGIT FIELD TO A " comp-5"   *      LB258140
      *                  RECEIVING FIELD                        *       LB258150
      *                                                         *       LB258160
      **********************************************************        LB258170
                                                                        LB258180
            MOVE SEND-DATA TO F18-S-BSD                                 LB258190
            MOVE G18-S-BSD TO G18-R-B.                                  LB258200
            IF F18-S-BSD NOT = F18-R-B                                  LB258210
                MOVE "F18-S-BSD" TO TEST-ID                             LB258220
                MOVE F18-S-BSD TO SENT-VAL                              LB258230
                MOVE F18-R-B TO RCVD-VAL                                LB258240
                ADD 1 TO FAIL-COUNT                                     LB258250
                PERFORM PRINT-ERRS THRU PR-OUT                          LB258260
            ELSE                                                        LB258270
              ADD 1 TO PASS-COUNT.                                      LB258280
                                                                        LB258290
            MOVE SEND-DATA TO F18-S-BSDL                                LB258300
            MOVE G18-S-BSDL TO G18-R-B.                                 LB258310
            IF F18-S-BSDL NOT = F18-R-B                                 LB258320
                MOVE "F18-S-BSDL" TO TEST-ID                            LB258330
                MOVE F18-S-BSDL TO SENT-VAL                             LB258340
                MOVE F18-R-B TO RCVD-VAL                                LB258350
                ADD 1 TO FAIL-COUNT                                     LB258360
                PERFORM PRINT-ERRS THRU PR-OUT                          LB258370
            ELSE                                                        LB258380
              ADD 1 TO PASS-COUNT.                                      LB258390
                                                                        LB258400
            MOVE SEND-DATA TO F18-S-BSDR                                LB258410
            MOVE G18-S-BSDR TO G18-R-B.                                 LB258420
            IF F18-S-BSDR NOT = F18-R-B                                 LB258430
                MOVE "F18-S-BSDR" TO TEST-ID                            LB258440
                MOVE F18-S-BSDR TO SENT-VAL                             LB258450
                MOVE F18-R-B TO RCVD-VAL                                LB258460
                ADD 1 TO FAIL-COUNT                                     LB258470
                PERFORM PRINT-ERRS THRU PR-OUT                          LB258480
            ELSE                                                        LB258490
              ADD 1 TO PASS-COUNT.                                      LB258500
                                                                        LB258510
            MOVE SEND-DATA TO F18-S-BS                                  LB258520
            MOVE G18-S-BS TO G18-R-B.                                   LB258530
            IF F18-S-BS NOT = F18-R-B                                   LB258540
                MOVE "F18-S-BS" TO TEST-ID                              LB258550
                MOVE F18-S-BS TO SENT-VAL                               LB258560
                MOVE F18-R-B TO RCVD-VAL                                LB258570
                ADD 1 TO FAIL-COUNT                                     LB258580
                PERFORM PRINT-ERRS THRU PR-OUT                          LB258590
            ELSE                                                        LB258600
              ADD 1 TO PASS-COUNT.                                      LB258610
                                                                        LB258620
            MOVE SEND-DATA TO F18-S-BSL                                 LB258630
            MOVE G18-S-BSL TO G18-R-B.                                  LB258640
            IF F18-S-BSL NOT = F18-R-B                                  LB258650
                MOVE "F18-S-BSL" TO TEST-ID                             LB258660
                MOVE F18-S-BSL TO SENT-VAL                              LB258670
                MOVE F18-R-B TO RCVD-VAL                                LB258680
                ADD 1 TO FAIL-COUNT                                     LB258690
                PERFORM PRINT-ERRS THRU PR-OUT                          LB258700
            ELSE                                                        LB258710
              ADD 1 TO PASS-COUNT.                                      LB258720
                                                                        LB258730
            MOVE SEND-DATA TO F18-S-BSR                                 LB258740
            MOVE G18-S-BSR TO G18-R-B.                                  LB258750
            IF F18-S-BSR NOT = F18-R-B                                  LB258760
                MOVE "F18-S-BSR" TO TEST-ID                             LB258770
                MOVE F18-S-BSR TO SENT-VAL                              LB258780
                MOVE F18-R-B TO RCVD-VAL                                LB258790
                ADD 1 TO FAIL-COUNT                                     LB258800
                PERFORM PRINT-ERRS THRU PR-OUT                          LB258810
            ELSE                                                        LB258820
              ADD 1 TO PASS-COUNT.                                      LB258830
                                                                        LB258840
            MOVE SEND-DATA TO F18-S-CSD                                 LB258850
            MOVE G18-S-CSD TO G18-R-B.                                  LB258860
            IF F18-S-CSD NOT = F18-R-B                                  LB258870
                MOVE "F18-S-CSD" TO TEST-ID                             LB258880
                MOVE F18-S-CSD TO SENT-VAL                              LB258890
                MOVE F18-R-B TO RCVD-VAL                                LB258900
                ADD 1 TO FAIL-COUNT                                     LB258910
                PERFORM PRINT-ERRS THRU PR-OUT                          LB258920
            ELSE                                                        LB258930
              ADD 1 TO PASS-COUNT.                                      LB258940
                                                                        LB258950
            MOVE SEND-DATA TO F18-S-CSDL                                LB258960
            MOVE G18-S-CSDL TO G18-R-B.                                 LB258970
            IF F18-S-CSDL NOT = F18-R-B                                 LB258980
                MOVE "F18-S-CSDL" TO TEST-ID                            LB258990
                MOVE F18-S-CSDL TO SENT-VAL                             LB259000
                MOVE F18-R-B TO RCVD-VAL                                LB259010
                ADD 1 TO FAIL-COUNT                                     LB259020
                PERFORM PRINT-ERRS THRU PR-OUT                          LB259030
            ELSE                                                        LB259040
              ADD 1 TO PASS-COUNT.                                      LB259050
                                                                        LB259060
            MOVE SEND-DATA TO F18-S-CSDR                                LB259070
            MOVE G18-S-CSDR TO G18-R-B.                                 LB259080
            IF F18-S-CSDR NOT = F18-R-B                                 LB259090
                MOVE "F18-S-CSDR" TO TEST-ID                            LB259100
                MOVE F18-S-CSDR TO SENT-VAL                             LB259110
                MOVE F18-R-B TO RCVD-VAL                                LB259120
                ADD 1 TO FAIL-COUNT                                     LB259130
                PERFORM PRINT-ERRS THRU PR-OUT                          LB259140
            ELSE                                                        LB259150
              ADD 1 TO PASS-COUNT.                                      LB259160
                                                                        LB259170
            MOVE SEND-DATA TO F18-S-CS                                  LB259180
            MOVE G18-S-CS TO G18-R-B.                                   LB259190
            IF F18-S-CS NOT = F18-R-B                                   LB259200
                MOVE "F18-S-CS" TO TEST-ID                              LB259210
                MOVE F18-S-CS TO SENT-VAL                               LB259220
                MOVE F18-R-B TO RCVD-VAL                                LB259230
                ADD 1 TO FAIL-COUNT                                     LB259240
                PERFORM PRINT-ERRS THRU PR-OUT                          LB259250
            ELSE                                                        LB259260
              ADD 1 TO PASS-COUNT.                                      LB259270
                                                                        LB259280
            MOVE SEND-DATA TO F18-S-CSL                                 LB259290
            MOVE G18-S-CSL TO G18-R-B.                                  LB259300
            IF F18-S-CSL NOT = F18-R-B                                  LB259310
                MOVE "F18-S-CSL" TO TEST-ID                             LB259320
                MOVE F18-S-CSL TO SENT-VAL                              LB259330
                MOVE F18-R-B TO RCVD-VAL                                LB259340
                ADD 1 TO FAIL-COUNT                                     LB259350
                PERFORM PRINT-ERRS THRU PR-OUT                          LB259360
            ELSE                                                        LB259370
              ADD 1 TO PASS-COUNT.                                      LB259380
                                                                        LB259390
            MOVE SEND-DATA TO F18-S-CSR                                 LB259400
            MOVE G18-S-CSR TO G18-R-B.                                  LB259410
            IF F18-S-CSR NOT = F18-R-B                                  LB259420
                MOVE "F18-S-CSR" TO TEST-ID                             LB259430
                MOVE F18-S-CSR TO SENT-VAL                              LB259440
                MOVE F18-R-B TO RCVD-VAL                                LB259450
                ADD 1 TO FAIL-COUNT                                     LB259460
                PERFORM PRINT-ERRS THRU PR-OUT                          LB259470
            ELSE                                                        LB259480
              ADD 1 TO PASS-COUNT.                                      LB259490
                                                                        LB259500
            MOVE SEND-DATA TO F18-S-C4SD                                LB259510
            MOVE G18-S-C4SD TO G18-R-B.                                 LB259520
            IF F18-S-C4SD NOT = F18-R-B                                 LB259530
                MOVE "F18-S-C4SD" TO TEST-ID                            LB259540
                MOVE F18-S-C4SD TO SENT-VAL                             LB259550
                MOVE F18-R-B TO RCVD-VAL                                LB259560
                ADD 1 TO FAIL-COUNT                                     LB259570
                PERFORM PRINT-ERRS THRU PR-OUT                          LB259580
            ELSE                                                        LB259590
              ADD 1 TO PASS-COUNT.                                      LB259600
                                                                        LB259610
            MOVE SEND-DATA TO F18-S-C4SDL                               LB259620
            MOVE G18-S-C4SDL TO G18-R-B.                                LB259630
            IF F18-S-C4SDL NOT = F18-R-B                                LB259640
                MOVE "F18-S-C4SDL" TO TEST-ID                           LB259650
                MOVE F18-S-C4SDL TO SENT-VAL                            LB259660
                MOVE F18-R-B TO RCVD-VAL                                LB259670
                ADD 1 TO FAIL-COUNT                                     LB259680
                PERFORM PRINT-ERRS THRU PR-OUT                          LB259690
            ELSE                                                        LB259700
              ADD 1 TO PASS-COUNT.                                      LB259710
                                                                        LB259720
            MOVE SEND-DATA TO F18-S-C4SDR                               LB259730
            MOVE G18-S-C4SDR TO G18-R-B.                                LB259740
            IF F18-S-C4SDR NOT = F18-R-B                                LB259750
                MOVE "F18-S-C4SDR" TO TEST-ID                           LB259760
                MOVE F18-S-C4SDR TO SENT-VAL                            LB259770
                MOVE F18-R-B TO RCVD-VAL                                LB259780
                ADD 1 TO FAIL-COUNT                                     LB259790
                PERFORM PRINT-ERRS THRU PR-OUT                          LB259800
            ELSE                                                        LB259810
              ADD 1 TO PASS-COUNT.                                      LB259820
                                                                        LB259830
            MOVE SEND-DATA TO F18-S-C4S                                 LB259840
            MOVE G18-S-C4S TO G18-R-B.                                  LB259850
            IF F18-S-C4S NOT = F18-R-B                                  LB259860
                MOVE "F18-S-C4S" TO TEST-ID                             LB259870
                MOVE F18-S-C4S TO SENT-VAL                              LB259880
                MOVE F18-R-B TO RCVD-VAL                                LB259890
                ADD 1 TO FAIL-COUNT                                     LB259900
                PERFORM PRINT-ERRS THRU PR-OUT                          LB259910
            ELSE                                                        LB259920
              ADD 1 TO PASS-COUNT.                                      LB259930
                                                                        LB259940
            MOVE SEND-DATA TO F18-S-C4SL                                LB259950
            MOVE G18-S-C4SL TO G18-R-B.                                 LB259960
            IF F18-S-C4SL NOT = F18-R-B                                 LB259970
                MOVE "F18-S-C4SL" TO TEST-ID                            LB259980
                MOVE F18-S-C4SL TO SENT-VAL                             LB259990
                MOVE F18-R-B TO RCVD-VAL                                LB260000
                ADD 1 TO FAIL-COUNT                                     LB260010
                PERFORM PRINT-ERRS THRU PR-OUT                          LB260020
            ELSE                                                        LB260030
              ADD 1 TO PASS-COUNT.                                      LB260040
                                                                        LB260050
            MOVE SEND-DATA TO F18-S-C4SR                                LB260060
            MOVE G18-S-C4SR TO G18-R-B.                                 LB260070
            IF F18-S-C4SR NOT = F18-R-B                                 LB260080
                MOVE "F18-S-C4SR" TO TEST-ID                            LB260090
                MOVE F18-S-C4SR TO SENT-VAL                             LB260100
                MOVE F18-R-B TO RCVD-VAL                                LB260110
                ADD 1 TO FAIL-COUNT                                     LB260120
                PERFORM PRINT-ERRS THRU PR-OUT                          LB260130
            ELSE                                                        LB260140
              ADD 1 TO PASS-COUNT.                                      LB260150
                                                                        LB260160
                                                                        LB260170
      **********************************************************        LB260180
      *                                                         *       LB260190
      *    MOVE 18 VARIATIONS OF 18 DIGIT FIELD TO A "comp-5"   *       LB260200
      *                  RECEIVING FIELD                        *       LB260210
      *                                                         *       LB260220
      **********************************************************        LB260230
                                                                        LB260240
            MOVE SEND-DATA TO F18-S-BSD                                 LB260250
            MOVE G18-S-BSD TO G18-R-C.                                  LB260260
            IF F18-S-BSD NOT = F18-R-C                                  LB260270
                MOVE "F18-S-BSD" TO TEST-ID                             LB260280
                MOVE F18-S-BSD TO SENT-VAL                              LB260290
                MOVE F18-R-C TO RCVD-VAL                                LB260300
                ADD 1 TO FAIL-COUNT                                     LB260310
                PERFORM PRINT-ERRS THRU PR-OUT                          LB260320
            ELSE                                                        LB260330
              ADD 1 TO PASS-COUNT.                                      LB260340
                                                                        LB260350
            MOVE SEND-DATA TO F18-S-BSDL                                LB260360
            MOVE G18-S-BSDL TO G18-R-C.                                 LB260370
            IF F18-S-BSDL NOT = F18-R-C                                 LB260380
                MOVE "F18-S-BSDL" TO TEST-ID                            LB260390
                MOVE F18-S-BSDL TO SENT-VAL                             LB260400
                MOVE F18-R-C TO RCVD-VAL                                LB260410
                ADD 1 TO FAIL-COUNT                                     LB260420
                PERFORM PRINT-ERRS THRU PR-OUT                          LB260430
            ELSE                                                        LB260440
              ADD 1 TO PASS-COUNT.                                      LB260450
                                                                        LB260460
            MOVE SEND-DATA TO F18-S-BSDR                                LB260470
            MOVE G18-S-BSDR TO G18-R-C.                                 LB260480
            IF F18-S-BSDR NOT = F18-R-C                                 LB260490
                MOVE "F18-S-BSDR" TO TEST-ID                            LB260500
                MOVE F18-S-BSDR TO SENT-VAL                             LB260510
                MOVE F18-R-C TO RCVD-VAL                                LB260520
                ADD 1 TO FAIL-COUNT                                     LB260530
                PERFORM PRINT-ERRS THRU PR-OUT                          LB260540
            ELSE                                                        LB260550
              ADD 1 TO PASS-COUNT.                                      LB260560
                                                                        LB260570
            MOVE SEND-DATA TO F18-S-BS                                  LB260580
            MOVE G18-S-BS TO G18-R-C.                                   LB260590
            IF F18-S-BS NOT = F18-R-C                                   LB260600
                MOVE "F18-S-BS" TO TEST-ID                              LB260610
                MOVE F18-S-BS TO SENT-VAL                               LB260620
                MOVE F18-R-C TO RCVD-VAL                                LB260630
                ADD 1 TO FAIL-COUNT                                     LB260640
                PERFORM PRINT-ERRS THRU PR-OUT                          LB260650
            ELSE                                                        LB260660
              ADD 1 TO PASS-COUNT.                                      LB260670
                                                                        LB260680
            MOVE SEND-DATA TO F18-S-BSL                                 LB260690
            MOVE G18-S-BSL TO G18-R-C.                                  LB260700
            IF F18-S-BSL NOT = F18-R-C                                  LB260710
                MOVE "F18-S-BSL" TO TEST-ID                             LB260720
                MOVE F18-S-BSL TO SENT-VAL                              LB260730
                MOVE F18-R-C TO RCVD-VAL                                LB260740
                ADD 1 TO FAIL-COUNT                                     LB260750
                PERFORM PRINT-ERRS THRU PR-OUT                          LB260760
            ELSE                                                        LB260770
              ADD 1 TO PASS-COUNT.                                      LB260780
                                                                        LB260790
            MOVE SEND-DATA TO F18-S-BSR                                 LB260800
            MOVE G18-S-BSR TO G18-R-C.                                  LB260810
            IF F18-S-BSR NOT = F18-R-C                                  LB260820
                MOVE "F18-S-BSR" TO TEST-ID                             LB260830
                MOVE F18-S-BSR TO SENT-VAL                              LB260840
                MOVE F18-R-C TO RCVD-VAL                                LB260850
                ADD 1 TO FAIL-COUNT                                     LB260860
                PERFORM PRINT-ERRS THRU PR-OUT                          LB260870
            ELSE                                                        LB260880
              ADD 1 TO PASS-COUNT.                                      LB260890
                                                                        LB260900
            MOVE SEND-DATA TO F18-S-CSD                                 LB260910
            MOVE G18-S-CSD TO G18-R-C.                                  LB260920
            IF F18-S-CSD NOT = F18-R-C                                  LB260930
                MOVE "F18-S-CSD" TO TEST-ID                             LB260940
                MOVE F18-S-CSD TO SENT-VAL                              LB260950
                MOVE F18-R-C TO RCVD-VAL                                LB260960
                ADD 1 TO FAIL-COUNT                                     LB260970
                PERFORM PRINT-ERRS THRU PR-OUT                          LB260980
            ELSE                                                        LB260990
              ADD 1 TO PASS-COUNT.                                      LB261000
                                                                        LB261010
            MOVE SEND-DATA TO F18-S-CSDL                                LB261020
            MOVE G18-S-CSDL TO G18-R-C.                                 LB261030
            IF F18-S-CSDL NOT = F18-R-C                                 LB261040
                MOVE "F18-S-CSDL" TO TEST-ID                            LB261050
                MOVE F18-S-CSDL TO SENT-VAL                             LB261060
                MOVE F18-R-C TO RCVD-VAL                                LB261070
                ADD 1 TO FAIL-COUNT                                     LB261080
                PERFORM PRINT-ERRS THRU PR-OUT                          LB261090
            ELSE                                                        LB261100
              ADD 1 TO PASS-COUNT.                                      LB261110
                                                                        LB261120
            MOVE SEND-DATA TO F18-S-CSDR                                LB261130
            MOVE G18-S-CSDR TO G18-R-C.                                 LB261140
            IF F18-S-CSDR NOT = F18-R-C                                 LB261150
                MOVE "F18-S-CSDR" TO TEST-ID                            LB261160
                MOVE F18-S-CSDR TO SENT-VAL                             LB261170
                MOVE F18-R-C TO RCVD-VAL                                LB261180
                ADD 1 TO FAIL-COUNT                                     LB261190
                PERFORM PRINT-ERRS THRU PR-OUT                          LB261200
            ELSE                                                        LB261210
              ADD 1 TO PASS-COUNT.                                      LB261220
                                                                        LB261230
            MOVE SEND-DATA TO F18-S-CS                                  LB261240
            MOVE G18-S-CS TO G18-R-C.                                   LB261250
            IF F18-S-CS NOT = F18-R-C                                   LB261260
                MOVE "F18-S-CS" TO TEST-ID                              LB261270
                MOVE F18-S-CS TO SENT-VAL                               LB261280
                MOVE F18-R-C TO RCVD-VAL                                LB261290
                ADD 1 TO FAIL-COUNT                                     LB261300
                PERFORM PRINT-ERRS THRU PR-OUT                          LB261310
            ELSE                                                        LB261320
              ADD 1 TO PASS-COUNT.                                      LB261330
                                                                        LB261340
            MOVE SEND-DATA TO F18-S-CSL                                 LB261350
            MOVE G18-S-CSL TO G18-R-C.                                  LB261360
            IF F18-S-CSL NOT = F18-R-C                                  LB261370
                MOVE "F18-S-CSL" TO TEST-ID                             LB261380
                MOVE F18-S-CSL TO SENT-VAL                              LB261390
                MOVE F18-R-C TO RCVD-VAL                                LB261400
                ADD 1 TO FAIL-COUNT                                     LB261410
                PERFORM PRINT-ERRS THRU PR-OUT                          LB261420
            ELSE                                                        LB261430
              ADD 1 TO PASS-COUNT.                                      LB261440
                                                                        LB261450
            MOVE SEND-DATA TO F18-S-CSR                                 LB261460
            MOVE G18-S-CSR TO G18-R-C.                                  LB261470
            IF F18-S-CSR NOT = F18-R-C                                  LB261480
                MOVE "F18-S-CSR" TO TEST-ID                             LB261490
                MOVE F18-S-CSR TO SENT-VAL                              LB261500
                MOVE F18-R-C TO RCVD-VAL                                LB261510
                ADD 1 TO FAIL-COUNT                                     LB261520
                PERFORM PRINT-ERRS THRU PR-OUT                          LB261530
            ELSE                                                        LB261540
              ADD 1 TO PASS-COUNT.                                      LB261550
                                                                        LB261560
            MOVE SEND-DATA TO F18-S-C4SD                                LB261570
            MOVE G18-S-C4SD TO G18-R-C.                                 LB261580
            IF F18-S-C4SD NOT = F18-R-C                                 LB261590
                MOVE "F18-S-C4SD" TO TEST-ID                            LB261600
                MOVE F18-S-C4SD TO SENT-VAL                             LB261610
                MOVE F18-R-C TO RCVD-VAL                                LB261620
                ADD 1 TO FAIL-COUNT                                     LB261630
                PERFORM PRINT-ERRS THRU PR-OUT                          LB261640
            ELSE                                                        LB261650
              ADD 1 TO PASS-COUNT.                                      LB261660
                                                                        LB261670
            MOVE SEND-DATA TO F18-S-C4SDL                               LB261680
            MOVE G18-S-C4SDL TO G18-R-C.                                LB261690
            IF F18-S-C4SDL NOT = F18-R-C                                LB261700
                MOVE "F18-S-C4SDL" TO TEST-ID                           LB261710
                MOVE F18-S-C4SDL TO SENT-VAL                            LB261720
                MOVE F18-R-C TO RCVD-VAL                                LB261730
                ADD 1 TO FAIL-COUNT                                     LB261740
                PERFORM PRINT-ERRS THRU PR-OUT                          LB261750
            ELSE                                                        LB261760
              ADD 1 TO PASS-COUNT.                                      LB261770
                                                                        LB261780
            MOVE SEND-DATA TO F18-S-C4SDR                               LB261790
            MOVE G18-S-C4SDR TO G18-R-C.                                LB261800
            IF F18-S-C4SDR NOT = F18-R-C                                LB261810
                MOVE "F18-S-C4SDR" TO TEST-ID                           LB261820
                MOVE F18-S-C4SDR TO SENT-VAL                            LB261830
                MOVE F18-R-C TO RCVD-VAL                                LB261840
                ADD 1 TO FAIL-COUNT                                     LB261850
                PERFORM PRINT-ERRS THRU PR-OUT                          LB261860
            ELSE                                                        LB261870
              ADD 1 TO PASS-COUNT.                                      LB261880
                                                                        LB261890
            MOVE SEND-DATA TO F18-S-C4S                                 LB261900
            MOVE G18-S-C4S TO G18-R-C.                                  LB261910
            IF F18-S-C4S NOT = F18-R-C                                  LB261920
                MOVE "F18-S-C4S" TO TEST-ID                             LB261930
                MOVE F18-S-C4S TO SENT-VAL                              LB261940
                MOVE F18-R-C TO RCVD-VAL                                LB261950
                ADD 1 TO FAIL-COUNT                                     LB261960
                PERFORM PRINT-ERRS THRU PR-OUT                          LB261970
            ELSE                                                        LB261980
              ADD 1 TO PASS-COUNT.                                      LB261990
                                                                        LB262000
            MOVE SEND-DATA TO F18-S-C4SL                                LB262010
            MOVE G18-S-C4SL TO G18-R-C.                                 LB262020
            IF F18-S-C4SL NOT = F18-R-C                                 LB262030
                MOVE "F18-S-C4SL" TO TEST-ID                            LB262040
                MOVE F18-S-C4SL TO SENT-VAL                             LB262050
                MOVE F18-R-C TO RCVD-VAL                                LB262060
                ADD 1 TO FAIL-COUNT                                     LB262070
                PERFORM PRINT-ERRS THRU PR-OUT                          LB262080
            ELSE                                                        LB262090
              ADD 1 TO PASS-COUNT.                                      LB262100
                                                                        LB262110
            MOVE SEND-DATA TO F18-S-C4SR                                LB262120
            MOVE G18-S-C4SR TO G18-R-C.                                 LB262130
            IF F18-S-C4SR NOT = F18-R-C                                 LB262140
                MOVE "F18-S-C4SR" TO TEST-ID                            LB262150
                MOVE F18-S-C4SR TO SENT-VAL                             LB262160
                MOVE F18-R-C TO RCVD-VAL                                LB262170
                ADD 1 TO FAIL-COUNT                                     LB262180
                PERFORM PRINT-ERRS THRU PR-OUT                          LB262190
            ELSE                                                        LB262200
              ADD 1 TO PASS-COUNT.                                      LB262210
                                                                        LB262220
                                                                        LB262230
      **********************************************************        LB262240
      *                                                         *       LB262250
      *    MOVE 18 VARIATIONS OF 18 DIGIT FIELD TO A             *      LB262260
      *      "COMPUTATIONAL-5"  RECEIVING FIELD                 *       LB262270
      *                                                         *       LB262280
      **********************************************************        LB262290
                                                                        LB262300
            MOVE SEND-DATA TO F18-S-BSD                                 LB262310
            MOVE G18-S-BSD TO G18-R-C4.                                 LB262320
            IF F18-S-BSD NOT = F18-R-C4                                 LB262330
                MOVE "F18-S-BSD" TO TEST-ID                             LB262340
                MOVE F18-S-BSD TO SENT-VAL                              LB262350
                MOVE F18-R-C4 TO RCVD-VAL                               LB262360
                ADD 1 TO FAIL-COUNT                                     LB262370
                PERFORM PRINT-ERRS THRU PR-OUT                          LB262380
            ELSE                                                        LB262390
              ADD 1 TO PASS-COUNT.                                      LB262400
                                                                        LB262410
            MOVE SEND-DATA TO F18-S-BSDL                                LB262420
            MOVE G18-S-BSDL TO G18-R-C4.                                LB262430
            IF F18-S-BSDL NOT = F18-R-C4                                LB262440
                MOVE "F18-S-BSDL" TO TEST-ID                            LB262450
                MOVE F18-S-BSDL TO SENT-VAL                             LB262460
                MOVE F18-R-C4 TO RCVD-VAL                               LB262470
                ADD 1 TO FAIL-COUNT                                     LB262480
                PERFORM PRINT-ERRS THRU PR-OUT                          LB262490
            ELSE                                                        LB262500
              ADD 1 TO PASS-COUNT.                                      LB262510
                                                                        LB262520
            MOVE SEND-DATA TO F18-S-BSDR                                LB262530
            MOVE G18-S-BSDR TO G18-R-C4.                                LB262540
            IF F18-S-BSDR NOT = F18-R-C4                                LB262550
                MOVE "F18-S-BSDR" TO TEST-ID                            LB262560
                MOVE F18-S-BSDR TO SENT-VAL                             LB262570
                MOVE F18-R-C4 TO RCVD-VAL                               LB262580
                ADD 1 TO FAIL-COUNT                                     LB262590
                PERFORM PRINT-ERRS THRU PR-OUT                          LB262600
            ELSE                                                        LB262610
              ADD 1 TO PASS-COUNT.                                      LB262620
                                                                        LB262630
            MOVE SEND-DATA TO F18-S-BS                                  LB262640
            MOVE G18-S-BS TO G18-R-C4.                                  LB262650
            IF F18-S-BS NOT = F18-R-C4                                  LB262660
                MOVE "F18-S-BS" TO TEST-ID                              LB262670
                MOVE F18-S-BS TO SENT-VAL                               LB262680
                MOVE F18-R-C4 TO RCVD-VAL                               LB262690
                ADD 1 TO FAIL-COUNT                                     LB262700
                PERFORM PRINT-ERRS THRU PR-OUT                          LB262710
            ELSE                                                        LB262720
              ADD 1 TO PASS-COUNT.                                      LB262730
                                                                        LB262740
            MOVE SEND-DATA TO F18-S-BSL                                 LB262750
            MOVE G18-S-BSL TO G18-R-C4.                                 LB262760
            IF F18-S-BSL NOT = F18-R-C4                                 LB262770
                MOVE "F18-S-BSL" TO TEST-ID                             LB262780
                MOVE F18-S-BSL TO SENT-VAL                              LB262790
                MOVE F18-R-C4 TO RCVD-VAL                               LB262800
                ADD 1 TO FAIL-COUNT                                     LB262810
                PERFORM PRINT-ERRS THRU PR-OUT                          LB262820
            ELSE                                                        LB262830
              ADD 1 TO PASS-COUNT.                                      LB262840
                                                                        LB262850
            MOVE SEND-DATA TO F18-S-BSR                                 LB262860
            MOVE G18-S-BSR TO G18-R-C4.                                 LB262870
            IF F18-S-BSR NOT = F18-R-C4                                 LB262880
                MOVE "F18-S-BSR" TO TEST-ID                             LB262890
                MOVE F18-S-BSR TO SENT-VAL                              LB262900
                MOVE F18-R-C4 TO RCVD-VAL                               LB262910
                ADD 1 TO FAIL-COUNT                                     LB262920
                PERFORM PRINT-ERRS THRU PR-OUT                          LB262930
            ELSE                                                        LB262940
              ADD 1 TO PASS-COUNT.                                      LB262950
                                                                        LB262960
            MOVE SEND-DATA TO F18-S-CSD                                 LB262970
            MOVE G18-S-CSD TO G18-R-C4.                                 LB262980
            IF F18-S-CSD NOT = F18-R-C4                                 LB262990
                MOVE "F18-S-CSD" TO TEST-ID                             LB263000
                MOVE F18-S-CSD TO SENT-VAL                              LB263010
                MOVE F18-R-C4 TO RCVD-VAL                               LB263020
                ADD 1 TO FAIL-COUNT                                     LB263030
                PERFORM PRINT-ERRS THRU PR-OUT                          LB263040
            ELSE                                                        LB263050
              ADD 1 TO PASS-COUNT.                                      LB263060
                                                                        LB263070
            MOVE SEND-DATA TO F18-S-CSDL                                LB263080
            MOVE G18-S-CSDL TO G18-R-C4.                                LB263090
            IF F18-S-CSDL NOT = F18-R-C4                                LB263100
                MOVE "F18-S-CSDL" TO TEST-ID                            LB263110
                MOVE F18-S-CSDL TO SENT-VAL                             LB263120
                MOVE F18-R-C4 TO RCVD-VAL                               LB263130
                ADD 1 TO FAIL-COUNT                                     LB263140
                PERFORM PRINT-ERRS THRU PR-OUT                          LB263150
            ELSE                                                        LB263160
              ADD 1 TO PASS-COUNT.                                      LB263170
                                                                        LB263180
            MOVE SEND-DATA TO F18-S-CSDR                                LB263190
            MOVE G18-S-CSDR TO G18-R-C4.                                LB263200
            IF F18-S-CSDR NOT = F18-R-C4                                LB263210
                MOVE "F18-S-CSDR" TO TEST-ID                            LB263220
                MOVE F18-S-CSDR TO SENT-VAL                             LB263230
                MOVE F18-R-C4 TO RCVD-VAL                               LB263240
                ADD 1 TO FAIL-COUNT                                     LB263250
                PERFORM PRINT-ERRS THRU PR-OUT                          LB263260
            ELSE                                                        LB263270
              ADD 1 TO PASS-COUNT.                                      LB263280
                                                                        LB263290
            MOVE SEND-DATA TO F18-S-CS                                  LB263300
            MOVE G18-S-CS TO G18-R-C4.                                  LB263310
            IF F18-S-CS NOT = F18-R-C4                                  LB263320
                MOVE "F18-S-CS" TO TEST-ID                              LB263330
                MOVE F18-S-CS TO SENT-VAL                               LB263340
                MOVE F18-R-C4 TO RCVD-VAL                               LB263350
                ADD 1 TO FAIL-COUNT                                     LB263360
                PERFORM PRINT-ERRS THRU PR-OUT                          LB263370
            ELSE                                                        LB263380
              ADD 1 TO PASS-COUNT.                                      LB263390
                                                                        LB263400
            MOVE SEND-DATA TO F18-S-CSL                                 LB263410
            MOVE G18-S-CSL TO G18-R-C4.                                 LB263420
            IF F18-S-CSL NOT = F18-R-C4                                 LB263430
                MOVE "F18-S-CSL" TO TEST-ID                             LB263440
                MOVE F18-S-CSL TO SENT-VAL                              LB263450
                MOVE F18-R-C4 TO RCVD-VAL                               LB263460
                ADD 1 TO FAIL-COUNT                                     LB263470
                PERFORM PRINT-ERRS THRU PR-OUT                          LB263480
            ELSE                                                        LB263490
              ADD 1 TO PASS-COUNT.                                      LB263500
                                                                        LB263510
            MOVE SEND-DATA TO F18-S-CSR                                 LB263520
            MOVE G18-S-CSR TO G18-R-C4.                                 LB263530
            IF F18-S-CSR NOT = F18-R-C4                                 LB263540
                MOVE "F18-S-CSR" TO TEST-ID                             LB263550
                MOVE F18-S-CSR TO SENT-VAL                              LB263560
                MOVE F18-R-C4 TO RCVD-VAL                               LB263570
                ADD 1 TO FAIL-COUNT                                     LB263580
                PERFORM PRINT-ERRS THRU PR-OUT                          LB263590
            ELSE                                                        LB263600
              ADD 1 TO PASS-COUNT.                                      LB263610
                                                                        LB263620
            MOVE SEND-DATA TO F18-S-C4SD                                LB263630
            MOVE G18-S-C4SD TO G18-R-C4.                                LB263640
            IF F18-S-C4SD NOT = F18-R-C4                                LB263650
                MOVE "F18-S-C4SD" TO TEST-ID                            LB263660
                MOVE F18-S-C4SD TO SENT-VAL                             LB263670
                MOVE F18-R-C4 TO RCVD-VAL                               LB263680
                ADD 1 TO FAIL-COUNT                                     LB263690
                PERFORM PRINT-ERRS THRU PR-OUT                          LB263700
            ELSE                                                        LB263710
              ADD 1 TO PASS-COUNT.                                      LB263720
                                                                        LB263730
            MOVE SEND-DATA TO F18-S-C4SDL                               LB263740
            MOVE G18-S-C4SDL TO G18-R-C4.                               LB263750
            IF F18-S-C4SDL NOT = F18-R-C4                               LB263760
                MOVE "F18-S-C4SDL" TO TEST-ID                           LB263770
                MOVE F18-S-C4SDL TO SENT-VAL                            LB263780
                MOVE F18-R-C4 TO RCVD-VAL                               LB263790
                ADD 1 TO FAIL-COUNT                                     LB263800
                PERFORM PRINT-ERRS THRU PR-OUT                          LB263810
            ELSE                                                        LB263820
              ADD 1 TO PASS-COUNT.                                      LB263830
                                                                        LB263840
            MOVE SEND-DATA TO F18-S-C4SDR                               LB263850
            MOVE G18-S-C4SDR TO G18-R-C4.                               LB263860
            IF F18-S-C4SDR NOT = F18-R-C4                               LB263870
                MOVE "F18-S-C4SDR" TO TEST-ID                           LB263880
                MOVE F18-S-C4SDR TO SENT-VAL                            LB263890
                MOVE F18-R-C4 TO RCVD-VAL                               LB263900
                ADD 1 TO FAIL-COUNT                                     LB263910
                PERFORM PRINT-ERRS THRU PR-OUT                          LB263920
            ELSE                                                        LB263930
              ADD 1 TO PASS-COUNT.                                      LB263940
                                                                        LB263950
            MOVE SEND-DATA TO F18-S-C4S                                 LB263960
            MOVE G18-S-C4S TO G18-R-C4.                                 LB263970
            IF F18-S-C4S NOT = F18-R-C4                                 LB263980
                MOVE "F18-S-C4S" TO TEST-ID                             LB263990
                MOVE F18-S-C4S TO SENT-VAL                              LB264000
                MOVE F18-R-C4 TO RCVD-VAL                               LB264010
                ADD 1 TO FAIL-COUNT                                     LB264020
                PERFORM PRINT-ERRS THRU PR-OUT                          LB264030
            ELSE                                                        LB264040
              ADD 1 TO PASS-COUNT.                                      LB264050
                                                                        LB264060
            MOVE SEND-DATA TO F18-S-C4SL                                LB264070
            MOVE G18-S-C4SL TO G18-R-C4.                                LB264080
            IF F18-S-C4SL NOT = F18-R-C4                                LB264090
                MOVE "F18-S-C4SL" TO TEST-ID                            LB264100
                MOVE F18-S-C4SL TO SENT-VAL                             LB264110
                MOVE F18-R-C4 TO RCVD-VAL                               LB264120
                ADD 1 TO FAIL-COUNT                                     LB264130
                PERFORM PRINT-ERRS THRU PR-OUT                          LB264140
            ELSE                                                        LB264150
                ADD 1 TO PASS-COUNT.                                    LB264160
                                                                        LB264170
            MOVE SEND-DATA TO F18-S-C4SR                                LB264180
            MOVE G18-S-C4SR TO G18-R-C4.                                LB264190
             IF F18-S-C4SR NOT = F18-R-C4                               LB264200
                MOVE "F18-S-C4SR" TO TEST-ID                            LB264210
                MOVE F18-S-C4SR TO SENT-VAL                             LB264220
                MOVE F18-R-C4 TO RCVD-VAL                               LB264230
                ADD 1 TO FAIL-COUNT                                     LB264240
                PERFORM PRINT-ERRS THRU PR-OUT                          LB264250
            ELSE                                                        LB264260
                ADD 1 TO PASS-COUNT.                                    LB264270
                                                                        LB264280
      *                                                                 LB264290
      ********** MULTIPLE GROUP TEST. *************                     LB264300
      *                                                                 LB264310
           MOVE MULTIPLE-GROUP TO MULT-GROUP-RCV.                       LB264320
           IF M-S-1 NOT = M-R-1                                         LB264330
               MOVE "MUL 1" TO TEST-ID                                  LB264340
               MOVE M-S-1 TO SENT-VAL                                   LB264350
               MOVE M-R-1 TO RCVD-VAL                                   LB264360
               ADD 1 TO FAIL-COUNT                                      LB264370
               PERFORM PRINT-ERRS THRU PR-OUT                           LB264380
             ELSE                                                       LB264390
               ADD 1 TO PASS-COUNT.                                     LB264400
      *                                                                 LB264410
           IF M-S-2 NOT = M-R-2                                         LB264420
               MOVE "MUL 2" TO TEST-ID                                  LB264430
               MOVE M-S-2 TO SENT-VAL                                   LB264440
               MOVE M-R-2 TO RCVD-VAL                                   LB264450
               ADD 1 TO FAIL-COUNT                                      LB264460
               PERFORM PRINT-ERRS THRU PR-OUT                           LB264470
             ELSE                                                       LB264480
               ADD 1 TO PASS-COUNT.                                     LB264490
      *                                                                 LB264500
           IF M-S-3 NOT = M-R-3                                         LB264510
               MOVE "MUL 3" TO TEST-ID                                  LB264520
               MOVE M-S-3 TO SENT-VAL                                   LB264530
               MOVE M-R-3 TO RCVD-VAL                                   LB264540
               ADD 1 TO FAIL-COUNT                                      LB264550
               PERFORM PRINT-ERRS THRU PR-OUT                           LB264560
             ELSE                                                       LB264570
               ADD 1 TO PASS-COUNT.                                     LB264580
      *                                                                 LB264590
           IF M-S-4 NOT = M-R-4                                         LB264600
               MOVE "MUL 4" TO TEST-ID                                  LB264610
               MOVE M-S-4 TO SENT-VAL                                   LB264620
               MOVE M-R-4 TO RCVD-VAL                                   LB264630
               ADD 1 TO FAIL-COUNT                                      LB264640
               PERFORM PRINT-ERRS THRU PR-OUT                           LB264650
             ELSE                                                       LB264660
               ADD 1 TO PASS-COUNT.                                     LB264670
      *                                                                 LB264680
           IF M-S-5 NOT = M-R-5                                         LB264690
               MOVE "MUL 5" TO TEST-ID                                  LB264700
               MOVE M-S-5 TO SENT-VAL                                   LB264710
               MOVE M-R-5 TO RCVD-VAL                                   LB264720
               ADD 1 TO FAIL-COUNT                                      LB264730
               PERFORM PRINT-ERRS THRU PR-OUT                           LB264740
             ELSE                                                       LB264750
               ADD 1 TO PASS-COUNT.                                     LB264760
      *                                                                 LB264770
           IF M-S-6 NOT = M-R-6                                         LB264780
               MOVE "MUL 6" TO TEST-ID                                  LB264790
               MOVE M-S-6 TO SENT-VAL                                   LB264800
               MOVE M-R-6 TO RCVD-VAL                                   LB264810
               ADD 1 TO FAIL-COUNT                                      LB264820
               PERFORM PRINT-ERRS THRU PR-OUT                           LB264830
             ELSE                                                       LB264840
               ADD 1 TO PASS-COUNT.                                     LB264850
      *                                                                 LB264860
           IF M-S-7 NOT = M-R-7                                         LB264870
               MOVE "MUL 7" TO TEST-ID                                  LB264880
               MOVE M-S-7 TO SENT-VAL                                   LB264890
               MOVE M-R-7 TO RCVD-VAL                                   LB264900
               ADD 1 TO FAIL-COUNT                                      LB264910
               PERFORM PRINT-ERRS THRU PR-OUT                           LB264920
             ELSE                                                       LB264930
               ADD 1 TO PASS-COUNT.                                     LB264940
      *                                                                 LB264950
      *                                                                 LB264960
      *** END OF TESTS ***                                              LB264970
      *                                                                 LB264980
       LAST-PARA.                                                       LB264990
           IF FAIL-COUNT = 0 MOVE "P" TO PGM-STATUS                     LB265000
                           GO TO FINNISH.                               LB265010
           MOVE "F" TO PGM-STATUS.                                      LB265020
           PERFORM HED-RTN THRU HED-OUT.                                LB265030
       FINNISH.                                                         LB265040
           ADD PASS-COUNT FAIL-COUNT GIVING TEST-COUNT.                 LB265050
           WRITE REPORT-RECORD FROM SUMM-HED-1.                         LB265060
           MOVE PASS-COUNT TO PRETTY-PASS.                              LB265070
           WRITE REPORT-RECORD FROM SUMM-HED-2.                         LB265080
           MOVE FAIL-COUNT TO PRETTY-FAIL.                              LB265090
           WRITE REPORT-RECORD FROM SUMM-HED-3.                         LB265100
                                                                        LB265110
           CALL "ITRAP100" USING PGM-ID PGM-STATUS.                     LB265120
                                                                        LB265130
       TIDY-UP.                                                         LB265140
           CLOSE PRTG341.                                               LB265150
       END-PARA.
           STOP RUN.                                                    LB265160
